
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СписокТочекХранения) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокТочекХранения,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокТочекХранения,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Ложь);
	КонецЕсли;
	
КонецПроцедуры
