//+++АСТБ_Горюшин_Алексей_23751
// В запрос добалено получение поля НоменклатурныеНомераОрганизаций.НаименованиеОрганизации
// Поле НаименованиеОрганизации добавлено в варианты отчёта "Выдача СИЗ сотрудникам по подразделениям" и "Выдача СИЗ сотрудникам по МВЗ"
//---АСТБ_Горюшин_Алексей_23751

//+++АСТБ_Горюшин_Алексей_27771
// В варианты отчёта "Выдача СИЗ сотрудникам по подразделениям" и "Выдача СИЗ сотрудникам по МВЗ" добавлена группировка по полю НоменклатураНормы
//---АСТБ_Горюшин_Алексей_27771