
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		ТекущаяНормаВыдачи = ПредопределенноеЗначение("Справочник.НормыВыдачиСИЗ.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СоставНормыВыдачи.Отбор, "Ссылка", ТекущаяНормаВыдачи,ВидСравненияКомпоновкиДанных.Равно, "Ссылка", Истина);
	Иначе
		Если ЗначениеЗаполнено(ЭтаФорма.Элементы.Список.ТекущаяСтрока) Тогда
			ТекущаяНормаВыдачи = ЭтаФорма.Элементы.Список.ТекущаяСтрока;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СоставНормыВыдачи.Отбор, "Ссылка", ТекущаяНормаВыдачи,ВидСравненияКомпоновкиДанных.Равно, "Ссылка", Истина);
		Иначе
			ТекущаяНормаВыдачи = ПредопределенноеЗначение("Справочник.НормыВыдачиСИЗ.ПустаяСсылка");
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СоставНормыВыдачи.Отбор, "Ссылка", ТекущаяНормаВыдачи,ВидСравненияКомпоновкиДанных.Равно, "Ссылка", Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
