&НаКлиенте
Процедура ЗагрузитьФККО(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если Блок1 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок1");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
	Если Блок2 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок2");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если Блок3 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок3");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если Блок4 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок4");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если Блок6 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок6");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если Блок7 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок7");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если Блок8 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок8");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если Блок9 Тогда
		ПараметрыФормы.Вставить("ИмяМакета","Блок9");
		ОткрытьФорму("Обработка.ПодборФККО.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Блок1 = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Элементы.Дерево.Обновить();
	Элементы.Список.Обновить();
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок1ПриИзменении(Элемент)
	
	Если Блок1 Тогда
		Блок2 = Ложь;
		Блок3 = Ложь;
		Блок4 = Ложь;
		Блок6 = Ложь;
		Блок7 = Ложь;
		Блок8 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок2ПриИзменении(Элемент)
	
	Если Блок2 Тогда
		Блок1 = Ложь;
		Блок3 = Ложь;
		Блок4 = Ложь;
		Блок6 = Ложь;
		Блок7 = Ложь;
		Блок8 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок3ПриИзменении(Элемент)
	
	Если Блок3 Тогда
		Блок1 = Ложь;
		Блок2 = Ложь;
		Блок4 = Ложь;
		Блок6 = Ложь;
		Блок7 = Ложь;
		Блок8 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок4ПриИзменении(Элемент)
	
	Если Блок4 Тогда
		Блок1 = Ложь;
		Блок2 = Ложь;
		Блок3 = Ложь;
		Блок6 = Ложь;
		Блок7 = Ложь;
		Блок8 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок6ПриИзменении(Элемент)
	
	Если Блок6 Тогда
		Блок1 = Ложь;
		Блок2 = Ложь;
		Блок3 = Ложь;
		Блок4 = Ложь;
		Блок7 = Ложь;
		Блок8 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок7ПриИзменении(Элемент)
	
	Если Блок7 Тогда
		Блок1 = Ложь;
		Блок2 = Ложь;
		Блок3 = Ложь;
		Блок4 = Ложь;
		Блок6 = Ложь;
		Блок8 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок8ПриИзменении(Элемент)
	
	Если Блок8 Тогда
		Блок1 = Ложь;
		Блок2 = Ложь;
		Блок3 = Ложь;
		Блок4 = Ложь;
		Блок6 = Ложь;
		Блок7 = Ложь;
		Блок9 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Блок9ПриИзменении(Элемент)
	
	Если Блок9 Тогда
		Блок1 = Ложь;
		Блок2 = Ложь;
		Блок3 = Ложь;
		Блок4 = Ложь;
		Блок6 = Ложь;
		Блок7 = Ложь;
		Блок8 = Ложь;
	КонецЕсли;	
	
КонецПроцедуры
