#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	//АсТБ_Alexey_********************************************************************
	
	// УниверсальныеМеханизмы
	Если ИменаПараметровСеанса = Неопределено Тогда

		// раздел безусловной установки параметров сеанса

	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	//
	// Конец переопределяемого блока
	
	// УниверсальныеМеханизмы
	
	   //+++АсТБ_Alexey_109047_********************************************************************
		
		Если НЕ Метаданные.ОбщиеФормы.Найти("Видеокурс") = Неопределено и НЕ ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
			
			НастройкаНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
			
			СоставФорм = Новый СоставФормНачальнойСтраницы;
			
			СоставФорм.ЛеваяКолонка.Добавить("Документ.ВыдачаСредствЗащитыСотруднику.Форма.ФормаСписка");
			СоставФорм.ЛеваяКолонка.Добавить("Документ.СписаниеСредствЗащитыСотрудника.Форма.ФормаСписка");
			СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ЖурналДокументовПоПотребности.Форма.ФормаСписка");
			
			//Танцюра А.Н. -- №126411 Новостной центр -- 28.09.2021 <<<
			//СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.Видеокурс");
			СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.НовостнойЦентр");
			//Танцюра А.Н. -- №126411 Новостной центр -- 28.09.2021 >>>
			СоставФорм.ПраваяКолонка.Добавить("Справочник.Сотрудники.Форма.ФормаСписка");
			
			НастройкаНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
			
			ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкаНачальнойСтраницы);
			
		КонецЕсли;
		
		//+++АсТБ_Alexey_109047_********************************************************************
	
	Иначе
		// установка параметров сеанса "по требованию"
		
		// параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. для того, чтобы избежать их повторной инициализации, 
		// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры
		УстановленныеПараметры = Новый Массив();
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
		//+++АсТБ_Alexey_109047_********************************************************************
		
		Если НЕ Метаданные.ОбщиеФормы.Найти("НовостнойЦентр") = Неопределено и НЕ ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
			
			НастройкаНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
			
			СоставФорм = Новый СоставФормНачальнойСтраницы;
			
			СоставФорм.ЛеваяКолонка.Добавить("Документ.ВыдачаСредствЗащитыСотруднику.Форма.ФормаСписка");
			СоставФорм.ЛеваяКолонка.Добавить("Документ.СписаниеСредствЗащитыСотрудника.Форма.ФормаСписка");
			СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ЖурналДокументовПоПотребности.Форма.ФормаСписка");
			
			//Танцюра А.Н. -- №126411 Новостной центр -- 28.09.2021 <<<
			//СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.Видеокурс");
			СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.НовостнойЦентр");
			//Танцюра А.Н. -- №126411 Новостной центр -- 28.09.2021 >>>
			СоставФорм.ПраваяКолонка.Добавить("Справочник.Сотрудники.Форма.ФормаСписка");
			
			НастройкаНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
			
			ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкаНачальнойСтраницы);
			
		КонецЕсли;
		
		//+++АсТБ_Alexey_109047_********************************************************************
		
	КонецЕсли;
	// Конец УниверсальныеМеханизмы
	
	//АсТБ_Alexey_********************************************************************
	
КонецПроцедуры

//АсТБ_Alexey_********************************************************************

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// Конец УниверсальныеМеханизмы
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Конец УниверсальныеМеханизмы

	// Переопределяемый блок

	//ПодключаемоеОборудование
	МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	// Конец ПодключаемоеОборудование

	// Конец переопределяемого блока

КонецПроцедуры

//АсТБ_Alexey_********************************************************************

#КонецОбласти

#КонецЕсли