#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Результат.Добавить("Склад");
	Результат.Добавить("МОЛ");
	Результат.Добавить("Сотрудник");
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ПериодРасчета,
	|			Организация = &ОрганизацияДляОстатков
	|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
	|ГДЕ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.СкладОтправитель КАК СкладОтправитель,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК Период,
	|		&ОрганизацияДляОстатков КАК Организация,
	|		ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад КАК Склад,
	|		ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.СкладОтправитель КАК СкладОтправитель,
	|		ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|		ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|		КОНЕЦ КАК Количество,
	|		ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса КАК ПроцентИзноса,
	|		ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|		ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|		ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник
	|	ИЗ
	|		Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|	ГДЕ
	|		ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|		И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|		И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество = 0) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.СкладОтправитель,
	|	ВложенныйЗапрос.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ТаблицаДокумента.Период КАК Период,
	|	ВТ_ТаблицаДокумента.Организация КАК Организация,
	|	ВТ_ТаблицаДокумента.Склад КАК Склад,
	|	ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ОстаткиРасходПоСкладу
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ТаблицаДокумента.Период КАК Период,
	|	ВТ_ТаблицаДокумента.Организация КАК Организация,
	|	ВТ_ТаблицаДокумента.СкладОтправитель КАК Склад,
	|	ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ПеремещатьВсе
	|			ТОГДА ВТ_ТаблицаДокумента.Количество
	|		КОГДА ВТ_ТаблицаДокумента.Количество >= ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|			ТОГДА ВТ_ТаблицаДокумента.Количество - ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ОстаткиРасходПоСкладуОтправителю
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|		ПО ВТ_ТаблицаДокумента.Номенклатура = ВТ_ОстаткиНоменклатуры.Номенклатура
	|			И ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры = ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА &ПеремещатьВсе
	|					ТОГДА ЛОЖЬ
	|				КОГДА ВТ_ТаблицаДокумента.Количество >= ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|					ТОГДА ВТ_ТаблицаДокумента.Количество - ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_ТаблицаДокумента.Период КАК Период,
	|	ВТ_ТаблицаДокумента.Организация КАК Организация,
	|	ВТ_ТаблицаДокумента.Склад КАК Склад,
	|	ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ПеремещатьВсе
	|			ТОГДА ВТ_ТаблицаДокумента.Количество
	|		КОГДА ВТ_ТаблицаДокумента.Количество >= ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|			ТОГДА ВТ_ТаблицаДокумента.Количество - ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ОстаткиПриход
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|		ПО ВТ_ТаблицаДокумента.Номенклатура = ВТ_ОстаткиНоменклатуры.Номенклатура
	|			И ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры = ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА &ПеремещатьВсе
	|					ТОГДА ЛОЖЬ
	|				КОГДА ВТ_ТаблицаДокумента.Количество >= ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|					ТОГДА ВТ_ТаблицаДокумента.Количество - ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|ГДЕ
	|	НЕ ШтрихкодыНоменклатурыДляУчетаЧистки.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.ВидДвижения КАК ВидДвижения,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Период КАК Период,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Организация КАК Организация,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Склад КАК Склад,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Количество КАК Количество,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ОстаткиРасходПоСкладуОтправителю КАК ВТ_ОстаткиРасходПоСкладуОтправителю
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиПриход.ВидДвижения,
	|	ВТ_ОстаткиПриход.Период,
	|	ВТ_ОстаткиПриход.Организация,
	|	ВТ_ОстаткиПриход.Склад,
	|	ВТ_ОстаткиПриход.Номенклатура,
	|	ВТ_ОстаткиПриход.ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиПриход.Количество,
	|	ВТ_ОстаткиПриход.ПроцентИзноса
	|ИЗ
	|	ВТ_ОстаткиПриход КАК ВТ_ОстаткиПриход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРасходПоСкладу.ВидДвижения КАК ВидДвижения,
	|	ВТ_ОстаткиРасходПоСкладу.Период КАК Период,
	|	ВТ_ОстаткиРасходПоСкладу.Организация КАК Организация,
	|	ВТ_ОстаткиРасходПоСкладу.Склад КАК Склад,
	|	ВТ_ОстаткиРасходПоСкладу.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиРасходПоСкладу.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиРасходПоСкладу.Количество КАК Количество,
	|	ВТ_ОстаткиРасходПоСкладу.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ОстаткиРасходПоСкладу КАК ВТ_ОстаткиРасходПоСкладу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.ВидДвижения КАК ВидДвижения,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Период КАК Период,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Организация КАК Организация,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Склад КАК Склад,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.Количество КАК Количество,
	|	ВТ_ОстаткиРасходПоСкладуОтправителю.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ОстаткиРасходПоСкладуОтправителю КАК ВТ_ОстаткиРасходПоСкладуОтправителю
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиПриход.ВидДвижения,
	|	ВТ_ОстаткиПриход.Период,
	|	ВТ_ОстаткиПриход.Организация,
	|	ВТ_ОстаткиПриход.Склад,
	|	ВТ_ОстаткиПриход.Номенклатура,
	|	ВТ_ОстаткиПриход.ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиПриход.Количество,
	|	ВТ_ОстаткиПриход.ПроцентИзноса
	|ИЗ
	|	ВТ_ОстаткиПриход КАК ВТ_ОстаткиПриход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРасходПоСкладу.ВидДвижения,
	|	ВТ_ОстаткиРасходПоСкладу.Период,
	|	ВТ_ОстаткиРасходПоСкладу.Организация,
	|	ВТ_ОстаткиРасходПоСкладу.Склад,
	|	ВТ_ОстаткиРасходПоСкладу.Номенклатура,
	|	ВТ_ОстаткиРасходПоСкладу.ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиРасходПоСкладу.Количество,
	|	ВТ_ОстаткиРасходПоСкладу.ПроцентИзноса
	|ИЗ
	|	ВТ_ОстаткиРасходПоСкладу КАК ВТ_ОстаткиРасходПоСкладу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.ШтрихкодыНоменклатуры КАК ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ПО ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод = ВТ_Штрихкоды.Штрихкод
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка = &Ссылка
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 <<<
	//|	И ВТ_Штрихкоды.Штрихкод ЕСТЬ NULL
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 >>>
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК Период,
	|	ВыдачаСредствЗащитыСотруднику.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотруднику.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотруднику.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотруднику.МОЛСкладаОтправителя
	|		ИНАЧЕ ВыдачаСредствЗащитыСотруднику.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииОбращенияНаСклад.ПерсональнаяВыдача)
	|		КОГДА ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииОбращенияНаСклад.КоллективнаяВыдача)
	|		КОГДА ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииОбращенияНаСклад.ПроизвольнаяВыдача)
	|		КОГДА ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.УпрощеннаяВыдача)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииОбращенияНаСклад.УпрощеннаяВыдача)
	|	КОНЕЦ КАК КатегорияОбращения,
	|	ВыдачаСредствЗащитыСотруднику.Комментарий КАК СодержаниеОбращения,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыОбращенийНаСклад.Закрыто) КАК СтатусОбращения
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.УпрощеннаяВыдача)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуКодыМаркировки.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ВыдачаСредствЗащитыСотрудникуКодыМаркировки.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуКодыМаркировки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.КодыМаркировки КАК ВыдачаСредствЗащитыСотрудникуКодыМаркировки
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуКодыМаркировки.Ссылка = &Ссылка
	|;
	//АсТБ_Alexey_79639_********************************************************************
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ФизлицаСТелефонами
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	НЕ ФизическиеЛицаКонтактнаяИнформация.НомерТелефона = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ФизлицаСПочтой
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	НЕ ФизическиеЛицаКонтактнаяИнформация.АдресЭП = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СогласияНаИнформированиеСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_СогласияНаSMS
	|ИЗ
	|	РегистрСведений.СогласияНаИнформирование.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК СогласияНаИнформированиеСрезПоследних
	|ГДЕ
	|	СогласияНаИнформированиеСрезПоследних.SMS
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СогласияНаИнформированиеСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_СогласияНаEmail
	|ИЗ
	|	РегистрСведений.СогласияНаИнформирование.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК СогласияНаИнформированиеСрезПоследних
	|ГДЕ
	|	СогласияНаИнформированиеСрезПоследних.Email
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК Период,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК ДокументВыдачи,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФизлицаСТелефонами КАК ВТ_ФизлицаСТелефонами
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник.ФизическоеЛицо = ВТ_ФизлицаСТелефонами.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СогласияНаSMS КАК ВТ_СогласияНаSMS
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = ВТ_СогласияНаSMS.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФизлицаСПочтой КАК ВТ_ФизлицаСПочтой
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник.ФизическоеЛицо = ВТ_ФизлицаСПочтой.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СогласияНаEmail КАК ВТ_СогласияНаEmail
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = ВТ_СогласияНаEmail.Сотрудник
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.НеИспользоватьПриФормированииЗаказовПоставщику
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|	И (ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.SMSИнформированиеОПоступленииНаСклад
	|					ТОГДА НЕ ВТ_ФизлицаСТелефонами.Ссылка ЕСТЬ NULL
	|							И НЕ ВТ_СогласияНаSMS.Сотрудник ЕСТЬ NULL
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.EmailИнформированиеОПоступленииНаСклад
	|					ТОГДА НЕ ВТ_ФизлицаСПочтой.Ссылка ЕСТЬ NULL
	|							И НЕ ВТ_СогласияНаEmail.Сотрудник ЕСТЬ NULL
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)";
	//АсТБ_Alexey_79639_********************************************************************
	
	Запрос.УстановитьПараметр("Ссылка",					ДокументСсылка);
	Запрос.УстановитьПараметр("ПериодРасчета",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
	Запрос.УстановитьПараметр("Склад",					ДокументСсылка.Склад);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",	?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),ДокументСсылка.Организация));
	//+++АСТБ_Горюшин_Алексей_23750
	Запрос.УстановитьПараметр("ПеремещатьВсе",			?(ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка, ДокументСсылка.ПеремещатьВсе, ЛОЖЬ));
	//---АСТБ_Горюшин_Алексей_23750
	
	//АсТБ_Alexey_79639_********************************************************************
	Запрос.УстановитьПараметр("Организация",			ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",		ДокументСсылка.Товары.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	//АсТБ_Alexey_79639_********************************************************************
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если ДокументСсылка.ПредварительнаяСборка Тогда //двигаем только складские остатки
		
		ТаблицаПеремещенияОстатков 			= Результат[6].Выгрузить();
		ТаблицаСписанияОстатков 			= Результат[7].Выгрузить();
		ТаблицаПеремещенияИСписанияОстатков = Результат[8].Выгрузить();
		
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка Тогда
			
			//движения по регистру "Остатки номенклатуры"
			ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаПеремещенияОстатков);
			
		Иначе
			
			Если ДокументСсылка.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда //фактическая выдача по предварительной заявке
				
				//движения по регистру "Остатки номенклатуры"
				ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаСписанияОстатков);
				
			Иначе //фактическая выдача без предварительной заявки
				
				Если ДокументСсылка.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
					Если НЕ ДокументСсылка.Склад.АвтоматизированнаяВыдача Тогда
						//движения по регистру "Остатки номенклатуры"
						ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаПеремещенияИСписанияОстатков);
					Иначе
						//движения по регистру "Остатки номенклатуры"
						ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаСписанияОстатков);
					КонецЕсли;	
				Иначе
					//движения по регистру "Остатки номенклатуры"
					ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаСписанияОстатков);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТаблицаПеремещенияОстатков 					= Результат[6].Выгрузить();
		ТаблицаСписанияОстатков 					= Результат[7].Выгрузить();
		ТаблицаПеремещенияИСписанияОстатков 		= Результат[8].Выгрузить();
		ТаблицаДвиженийПоШтрихкодам         		= Результат[9].Выгрузить();
		ТаблицаСрокиНоскиПоУпрощеннойВыдаче 		= Результат[11].Выгрузить();
		ТаблицаДвиженийПоМаркировке 				= Результат[12].Выгрузить();
		//АсТБ_Alexey_79639_********************************************************************
		ТаблицаДвиженийСредствамЗащитыКПолучению 	= Результат[17].Выгрузить();
		//АсТБ_Alexey_79639_********************************************************************
		
		//по регистру "КодыМаркировкиВыданныхСредствЗащиты"
		ТаблицыДляДвижений.Вставить("ТаблицаКодыМаркировкиВыданныхСредствЗащиты", ТаблицаДвиженийПоМаркировке);
		
		//по регистру "ШтрихкодыНоменклатурыДляУчетаЧистки"
		ТаблицыДляДвижений.Вставить("ТаблицаШтрихкодыНоменклатурыДляУчетаЧистки", ТаблицаДвиженийПоШтрихкодам);
		
		//по регистру "ИсторияОбращенийНаСклад"
		ТаблицыДляДвижений.Вставить("ТаблицаИсторияОбращенийНаСклад", Результат[10].Выгрузить());
		
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка Тогда
			
			//движения по регистру "Остатки номенклатуры"
			ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаПеремещенияОстатков);
			
		Иначе
			
			//движения по регистру "Выданные средства защиты"
			ТаблицыДляДвижений.Вставить("ТаблицаВыданныеСредстваЗащиты", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка));
			
			Если ДокументСсылка.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда //фактическая выдача по предварительной заявке
				
				//движения по регистру "Остатки номенклатуры"
				ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаСписанияОстатков);
				
			Иначе //фактическая выдача без предварительной заявки
				
				Если ДокументСсылка.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
					Если НЕ ДокументСсылка.Склад.АвтоматизированнаяВыдача Тогда
						//движения по регистру "Остатки номенклатуры"
						ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаПеремещенияИСписанияОстатков);
					Иначе
						//движения по регистру "Остатки номенклатуры"
						ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаСписанияОстатков);
					КонецЕсли;	
				Иначе
					//движения по регистру "Остатки номенклатуры"
					ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНоменклатуры", ТаблицаСписанияОстатков);
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ДокументСсылка.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПроизвольнаяВыдача Тогда
				
				//движения по регистру "ПотребностьВыдачиСИЗ"
				ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВыдачиСИЗ", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийПоПотребности(ДокументСсылка));
				
				ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийВыдачиПоПотребности(ДокументСсылка,ТаблицыДляДвижений.ТаблицаПотребностьВыдачиСИЗ,ТаблицыДляДвижений.ТаблицаВыданныеСредстваЗащиты));
				
				//АсТБ_Alexey_79639_********************************************************************
				//движения по регистру "Средства защиты к получению"
				ТаблицыДляДвижений.Вставить("ТаблицаСредстваЗащитыКПолучению", ТаблицаДвиженийСредствамЗащитыКПолучению);
				//АсТБ_Alexey_79639_********************************************************************
				
			КонецЕсли;
			
			Если ДокументСсылка.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.УпрощеннаяВыдача Тогда
				
				ТаблицыДляДвижений.Вставить("ТаблицаСрокиНоскиПоУпрощеннойВыдаче", ТаблицаСрокиНоскиПоУпрощеннойВыдаче);
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	//***НСК Трегубов А.А.*** -- Адресное хранение --  04.09.2019 <<<
	
	//При использовании адресного механизма предварительной сборки, документ движения не должен делать.
	//Данный функционал рабочий, но практически (от слова совсем) не используется.
	//Чтобы не делать рефакторинг кода, просто очищаю сформированные движения
	
	Если АХ_ОбменВызовСервера.НужноИспользоватьАдресныеМеханизмыВДокументе(ДокументСсылка) 
		И ДокументСсылка.АХ_СтатусСборки = Перечисления.АХ_СтатусыСборкиТоваров.ПредварительнаяСборка Тогда
		
		Для Каждого КлючИЗначениеСтруктуры из ДополнительныеСвойства.ТаблицыДляДвижений цикл			
			
			ТаблицаДвижений = КлючИЗначениеСтруктуры.Значение;
			ТаблицаДвижений.Очистить();				
			
		КонецЦикла;
		
	КонецЕсли;
	//***НСК Трегубов А.А.*** -- Адресное хранение --  04.09.2019 >>>
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МБ7") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МБ7",
		"Форма МБ-7",
		СформироватьПечатнуюФормуМБ7(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_МБ7");
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриложениеКЛичнойКарточке") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ПриложениеКЛичнойКарточке",
		"Приложение к личной карточке",
		СформироватьПечатнуюФормуПриложенияКЛичнойКарточке(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПриложениеКЛичнойКарточке");
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриложениеКЛичнойКарточкеСИзносом") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ПриложениеКЛичнойКарточкеСИзносом",
		"Приложение к личной карточке (с % износа)",
		СформироватьПечатнуюФормуПриложенияКЛичнойКарточкеСИзносом(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПриложениеКЛичнойКарточкеСИзносом");
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладная") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ТоварнаяНакладная",
			"Товарная накладная",
			СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ТоварнаяНакладная");
				
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяСИзносом") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ТоварнаяНакладнаяСИзносом",
			"Товарная накладная (с % износа)",
			СформироватьПечатнуюФормуТоварнойНакладнойСИзносом(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ТоварнаяНакладнаяСИзносом");
				
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьНаВыдачуСИЗ") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ВедомостьНаВыдачуСИЗ",
			"Ведомость на выдачу СИЗ",
			СформироватьПечатнуюФормуВедомостиНаВыдачуСИЗ(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ВедомостьНаВыдачуСИЗ");
				
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПроизвольнаяВыдачаСИЗ") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПроизвольнаяВыдачаСИЗ",
			"Произвольная выдача СИЗ",
			СформироватьПечатнуюФормуПроизвольнойВыдачиСИЗ(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПроизвольнаяВыдачаСИЗ");
				
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПроизвольнаяВыдачаСИЗСИзносом") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПроизвольнаяВыдачаСИЗСИзносом",
			"Произвольная выдача СИЗ (с % износа)",
			СформироватьПечатнуюФормуПроизвольнойВыдачиСИЗСИзносом(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПроизвольнаяВыдачаСИЗСИзносом");
				
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаданиеНаСборку") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЗаданиеНаСборку",
			"Задание на сборку",
			СформироватьПечатнуюФормуЗаданияНаСборку(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ЗаданиеНаСборку");
				
	КонецЕсли;	
	
	//АсТБ_Alexey_78736_********************************************************************
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МБ7_Износ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МБ7_Износ",
		"Форма МБ-7 (с износом)",
		СформироватьПечатнуюФормуМБ7сИзносом(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_МБ7_Износ");
		
	КонецЕсли;	
	//АсТБ_Alexey_78736_********************************************************************
		
КонецПроцедуры

Функция СформироватьПечатнуюФормуВедомостиНаВыдачуСИЗ(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху			= 0;
	ТабличныйДокумент.ПолеСнизу			= 0;
	ТабличныйДокумент.ПолеСправа			= 0;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ВедомостьНаВыдачуСИЗ";
	
	СисИнфо = Новый СистемнаяИнформация;
	Если ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра) Тогда 
		ТабличныйДокумент.ПолеСлева          = 0;
	Иначе
		ТабличныйДокумент.ПолеСлева          = 10;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	|	Документы.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕ(Документы.ВидВыдачиСИЗ) КАК ПредставлениеВыдачи,
	|	Документы.Дата КАК ПериодВыдачи
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|	И НЕ Документы.ПредварительнаяСборка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Количество КАК Количество,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.Сотрудник КАК Сотрудник,
	|	Товары.НоменклатураНормы.Наименование КАК НоменклатураНормы,
	|	Товары.НеВыданоПоПричине КАК НеВыданоПоПричине,
	|	Товары.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И НЕ Товары.Ссылка.ПредварительнаяСборка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Товары.Сотрудник.Наименование,
	|	Товары.НоменклатураНормы.Наименование,
	|	Товары.Номенклатура.Наименование,
	|	Товары.ХарактеристикаНоменклатуры.КодSAP");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ВедомостьНаВыдачуСИЗ");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ДанныеПечати = ПакетЗапросов[0].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[1].Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		ТаблицаДокумента 	= ВыборкаПоДокументам.НайтиСтроки(НОВЫЙ Структура("Ссылка", ДанныеПечати.Ссылка));
		КоличествоСтрок 	= ТаблицаДокумента.Количество();
		
		Если КоличествоСтрок = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(ДанныеПечати);
		
		ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Ведомость на выдачу СИЗ");
		Область.Параметры.ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + ?(ЗначениеЗаполнено(ДанныеПечати.ПериодВыдачи)," Период выдачи: " + Формат(ДанныеПечати.ПериодВыдачи,"ДФ='ММММ гггг'"),"");
		ТабличныйДокумент.Вывести(Область);
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
		
		СтрокНаСтранице = 16;
		СтрокШапки      = 4;
		СтрокПодвала    = 1;
		НомерСтраницы   = 1;
		
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		Ном = 0;
		
		СчетСтрок = 1;
		
		Для Каждого СтрокаТаблицыДокумента Из ТаблицаДокумента Цикл
			
			Ном = Ном + 1;
			//Начинаем новую страницу, если предыдущая строка была последней на странице
			//или пора переносить последнюю строку на последнюю страницу с подвалом.
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НаименованиеСтраницы = ТекстЗаголовка + " (страница " + НомерСтраницы + ")";
				ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Параметры.НомерСтроки 				= СчетСтрок;
			Область.Параметры.ТабельныйНомер 			= СокрЛП(СтрокаТаблицыДокумента.Сотрудник.ТабельныйНомер);
			Область.Параметры.ПредставлениеСотрудника 	= ФизическиеЛица.ФамилияИнициалыФизЛица(СтрокаТаблицыДокумента.Сотрудник.ФизическоеЛицо);
			Область.Параметры.НоменклатураНормы 		= СтрокаТаблицыДокумента.НоменклатураНормы;
			Область.Параметры.НеВыданоПоПричине 		= СтрокаТаблицыДокумента.НеВыданоПоПричине;
			Область.Параметры.КодСинхронизации 			= СтрокаТаблицыДокумента.Номенклатура.КодСинхронизации;
			Область.Параметры.НаименованиеТовара 		= СтрокаТаблицыДокумента.Номенклатура;
			Область.Параметры.ПериодичностьВыдачи 		= СтрокаТаблицыДокумента.ПериодичностьВыдачи;
			Область.Параметры.Размер 					= СтрокаТаблицыДокумента.ХарактеристикаНоменклатуры;
			Область.Параметры.Количество 				= СтрокаТаблицыДокумента.Количество;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
		Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
		Область.Параметры.ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(Строка(ДанныеПечати.Ссылка.МОЛ));
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ТоварнаяНакладная";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиНоменклатуры.Регистратор КАК Ссылка,
	|	ОстаткиНоменклатуры.Регистратор.Организация КАК Организация,
	|	ОстаткиНоменклатуры.Номенклатура,
	|	ОстаткиНоменклатуры.ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатуры.Количество
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
	|ГДЕ
	|	ОстаткиНоменклатуры.Регистратор В(&МассивОбъектов)
	|	И ОстаткиНоменклатуры.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Организация.Наименование КАК ПредставлениеОрганизации,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.СкладОтправитель.Наименование КАК ПредставлениеСкладаОтправителя,
	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Ответственный.Наименование КАК Ответственный,
	|	Документы.МОЛ.ФизическоеЛицо КАК МОЛ
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Ссылка КАК Ссылка,
	|	ВТ_ДанныеРегистра.Количество КАК Количество,
	|	ВТ_ДанныеРегистра.Номенклатура.Наименование КАК НаименованиеТовара,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВТ_ДанныеРегистра.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВТ_ДанныеРегистра.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВТ_ДанныеРегистра.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВТ_ДанныеРегистра.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВТ_ДанныеРегистра.ХарактеристикаНоменклатуры КАК Размер
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВТ_ДанныеРегистра.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВТ_ДанныеРегистра.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВТ_ДанныеРегистра.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка");
		
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ТоварнаяНакладная");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ДанныеПечати = ПакетЗапросов[1].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		Область = Макет.ПолучитьОбласть("Шапка");
		
		Область.Параметры.ТекстЗаголовка 					= "Товарная накладная №" + ДанныеПечати.Номер + " от " + Формат(ДанныеПечати.Дата,"ДЛФ=DD");
		Область.Параметры.ПредставлениеОрганизации 			= ДанныеПечати.ПредставлениеОрганизации;
		Область.Параметры.ПредставлениеСкладаОтправителя 	= ДанныеПечати.ПредставлениеСкладаОтправителя;
		Область.Параметры.ПредставлениеСклада 				= ДанныеПечати.ПредставлениеСклада;
		
		ПредставлениеПолучатель 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.МОЛ);
		ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Ответственный);
		
		ТабличныйДокумент.Вывести(Область);
			
		СчетСтрок = 0;
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			СчетСтрок = СчетСтрок + 1;
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Параметры.Заполнить(ВыборкаПоТоварам);
			Область.Параметры.НомерСтроки = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ВсегоНаименований 			= СчетСтрок;
		Область.Параметры.ПредставлениеПолучатель 		= ПредставлениеПолучатель;
		Область.Параметры.ПредставлениеОтветственного 	= ПредставлениеОтветственного;
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуТоварнойНакладнойСИзносом(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ТоварнаяНакладнаяСИзносом";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиНоменклатуры.Регистратор КАК Ссылка,
	|	ОстаткиНоменклатуры.Регистратор.Организация КАК Организация,
	|	ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатуры.Количество КАК Количество,
	|	ОстаткиНоменклатуры.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
	|ГДЕ
	|	ОстаткиНоменклатуры.Регистратор В(&МассивОбъектов)
	|	И ОстаткиНоменклатуры.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Организация.Наименование КАК ПредставлениеОрганизации,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.СкладОтправитель.Наименование КАК ПредставлениеСкладаОтправителя,
	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Ответственный.Наименование КАК Ответственный,
	|	Документы.МОЛ.ФизическоеЛицо КАК МОЛ
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Ссылка КАК Ссылка,
	|	ВТ_ДанныеРегистра.Количество КАК Количество,
	|	ВТ_ДанныеРегистра.Номенклатура.Наименование КАК НаименованиеТовара,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВТ_ДанныеРегистра.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВТ_ДанныеРегистра.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВТ_ДанныеРегистра.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВТ_ДанныеРегистра.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВТ_ДанныеРегистра.ХарактеристикаНоменклатуры КАК Размер,
	|	ВТ_ДанныеРегистра.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВТ_ДанныеРегистра.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВТ_ДанныеРегистра.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВТ_ДанныеРегистра.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка");
		
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ТоварнаяНакладнаяСИзносом");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ДанныеПечати = ПакетЗапросов[1].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		Область = Макет.ПолучитьОбласть("Шапка");
		
		Область.Параметры.ТекстЗаголовка 					= "Товарная накладная №" + ДанныеПечати.Номер + " от " + Формат(ДанныеПечати.Дата,"ДЛФ=DD");
		Область.Параметры.ПредставлениеОрганизации 			= ДанныеПечати.ПредставлениеОрганизации;
		Область.Параметры.ПредставлениеСкладаОтправителя 	= ДанныеПечати.ПредставлениеСкладаОтправителя;
		Область.Параметры.ПредставлениеСклада 				= ДанныеПечати.ПредставлениеСклада;
		
		ПредставлениеПолучатель 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.МОЛ);
		ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Ответственный);
		
		ТабличныйДокумент.Вывести(Область);
			
		СчетСтрок = 0;
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			СчетСтрок = СчетСтрок + 1;
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Параметры.Заполнить(ВыборкаПоТоварам);
			Область.Параметры.НомерСтроки = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ВсегоНаименований 			= СчетСтрок;
		Область.Параметры.ПредставлениеПолучатель 		= ПредставлениеПолучатель;
		Область.Параметры.ПредставлениеОтветственного 	= ПредставлениеОтветственного;
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуПриложенияКЛичнойКарточке(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ПриложениеКЛичнойКарточке";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотруднику.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВыдачаСредствЗащитыСотруднику.Номер КАК Номер,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК Дата,
	|	ВыдачаСредствЗащитыСотруднику.Склад.Наименование КАК ПредставлениеСклада,
	|	ВыдачаСредствЗащитыСотруднику.Организация.Префикс КАК Префикс,
	|	ВыдачаСредствЗащитыСотруднику.Сотрудник.Наименование КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотруднику.Сотрудник КАК СотрудникСсылка,
	|	ВыдачаСредствЗащитыСотруднику.Ответственный.Наименование КАК Ответственный,
	|	ВыдачаСредствЗащитыСотруднику.Сотрудник.ТабельныйНомер КАК ТабельныйНомер
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК Размер,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата, ГОД, ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата, МЕСЯЦ, ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаСледующейВыдачи,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ""Артикул""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ""Код""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ""Код синхронизации""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ""Номенклатурный номер""
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗаголовокНоменклатурногоНомера
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыданоПоПричине КАК ПричинаНеВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы.Наименование КАК НоменклатураНормы
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПриложениеКЛичнойКарточке");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ДанныеПечати 					= ПакетЗапросов[0].Выгрузить();
	ТаблицаЗапросаПоВыданным 		= ПакетЗапросов[1].Выгрузить();
	ТаблицаЗапросаПоНеВыданным 		= ПакетЗапросов[2].Выгрузить();
	
	ПервыйДокумент = Истина;
	
	ЗапросПоЗанятымРабочимМестам = Новый Запрос;
	ЗапросПоЗанятымРабочимМестам.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗанятыеРабочиеМеста.Подразделение.Наименование + "" ("" + ЗанятыеРабочиеМеста.Подразделение.Код + "")"" КАК ПредставлениеПодразделения,
	|	ЗанятыеРабочиеМеста.Должность.Наименование + "" ("" + ЗанятыеРабочиеМеста.Должность.Код + "")"" КАК ПредставлениеДолжности,
	|	ЗанятыеРабочиеМеста.РабочееМесто.Наименование + "" ("" + ЗанятыеРабочиеМеста.РабочееМесто.Код + "")"" КАК ПредставлениеРабочегоМеста,
	|	МАКСИМУМ(ЗанятыеРабочиеМеста.Период) КАК ДатаПриема,
	|	ЗанятыеРабочиеМеста.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ЗанятыеРабочиеМеста.Сотрудник.Наименование КАК Сотрудник,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК СотрудникСсылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗанятыеРабочиеМеста.Период КАК Период,
	|		ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|		ЗанятыеРабочиеМеста.Должность КАК Должность,
	|		ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(, Сотрудник В (&МассивСотрудников)) КАК ЗанятыеРабочиеМестаОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|			ПО ЗанятыеРабочиеМестаОстатки.Подразделение = ЗанятыеРабочиеМеста.Подразделение
	|				И ЗанятыеРабочиеМестаОстатки.Должность = ЗанятыеРабочиеМеста.Должность
	|				И ЗанятыеРабочиеМестаОстатки.РабочееМесто = ЗанятыеРабочиеМеста.РабочееМесто
	|				И ЗанятыеРабочиеМестаОстатки.Сотрудник = ЗанятыеРабочиеМеста.Сотрудник
	|	ГДЕ
	|		ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ЗанятыеРабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗанятыеРабочиеМеста.Подразделение.Наименование + "" ("" + ЗанятыеРабочиеМеста.Подразделение.Код + "")"",
	|	ЗанятыеРабочиеМеста.Должность.Наименование + "" ("" + ЗанятыеРабочиеМеста.Должность.Код + "")"",
	|	ЗанятыеРабочиеМеста.РабочееМесто.Наименование + "" ("" + ЗанятыеРабочиеМеста.РабочееМесто.Код + "")"",
	|	ЗанятыеРабочиеМеста.Сотрудник.ТабельныйНомер,
	|	ЗанятыеРабочиеМеста.Сотрудник.Наименование,
	|	ЗанятыеРабочиеМеста.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПриема";
	
	ЗапросПоЗанятымРабочимМестам.УстановитьПараметр("МассивСотрудников",ДанныеПечати.ВыгрузитьКолонку("СотрудникСсылка"));
	
	ТаблицаЗапросаПоПодразделениям = ЗапросПоЗанятымРабочимМестам.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДанныхДляПечати Из ДанныеПечати Цикл
		
		СтрокиПоПодразделениям 	= ТаблицаЗапросаПоПодразделениям.НайтиСтроки(Новый Структура("СотрудникСсылка", СтрокаДанныхДляПечати.СотрудникСсылка));
		СтрокиПоВыданным 		= ТаблицаЗапросаПоВыданным.НайтиСтроки(Новый Структура("Ссылка", СтрокаДанныхДляПечати.Ссылка));
		СтрокиПоНеВыданным 		= ТаблицаЗапросаПоНеВыданным.НайтиСтроки(Новый Структура("Ссылка", СтрокаДанныхДляПечати.Ссылка));
		
		Если (СтрокиПоПодразделениям.Количество() = 0 И СтрокиПоВыданным.Количество() = 0 И СтрокиПоНеВыданным.Количество() = 0) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(СтрокаДанныхДляПечати);
		
		Область.Параметры.ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", СтрокаДанныхДляПечати.Номер, СтрокаДанныхДляПечати.Дата, СтрокаДанныхДляПечати.Префикс), "Карточка (приложение к оборотной стороне ЛК)");
		ТабличныйДокумент.Вывести(Область);
		
		СчетСтрок = 1;
		Для Каждого СтрокаПоПодразделениям Из СтрокиПоПодразделениям Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаПоПодразделениям.ДатаПриема) Тогда
				Продолжить;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("СтрокаПодразделения");
			Область.Параметры.НомерПоПорядку = СчетСтрок;
			Область.Параметры.Заполнить(СтрокаПоПодразделениям);
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Сотрудник");
		Область.Параметры.Заполнить(СтрокаДанныхДляПечати);
		ТабличныйДокумент.Вывести(Область);
		
		ВыведенаВыданоШапка = Ложь;
		
		СчетСтрок = 1;
		Для Каждого СтрокаПоВыданным Из СтрокиПоВыданным Цикл
			
			Если НЕ ВыведенаВыданоШапка Тогда
				Область = Макет.ПолучитьОбласть("ВыданоШапка");
				Область.Параметры.ЗаголовокНоменклатурногоНомера = СтрокаПоВыданным.ЗаголовокНоменклатурногоНомера;
				ТабличныйДокумент.Вывести(Область);
				ВыведенаВыданоШапка = Истина;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("ВыданоСтрока");
			Область.Параметры.Заполнить(СтрокаПоВыданным);
			Область.Параметры.НомерПоПорядку = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		ВыведенаНеВыданоШапка = Ложь;
		
		СчетСтрок = 1;
		Для Каждого СтрокаПоНеВыданным Из СтрокиПоНеВыданным Цикл
			
			Если НЕ ВыведенаНеВыданоШапка Тогда
				Если ВыведенаВыданоШапка Тогда
					Область = Макет.ПолучитьОбласть("ПустаяСтрока");
					ТабличныйДокумент.Вывести(Область);
				КонецЕсли;
				Область = Макет.ПолучитьОбласть("НеВыданоШапка");
				ТабличныйДокумент.Вывести(Область);
				ВыведенаНеВыданоШапка = Истина;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("НеВыданоСтрока");
			Область.Параметры.Заполнить(СтрокаПоНеВыданным);
			Область.Параметры.НомерПоПорядку = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(СтрокаДанныхДляПечати.Ответственный);
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СтрокаДанныхДляПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуПриложенияКЛичнойКарточкеСИзносом(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ПриложениеКЛичнойКарточкеСИзносом";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотруднику.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВыдачаСредствЗащитыСотруднику.Номер КАК Номер,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК Дата,
	|	ВыдачаСредствЗащитыСотруднику.Склад.Наименование КАК ПредставлениеСклада,
	|	ВыдачаСредствЗащитыСотруднику.Организация.Префикс КАК Префикс,
	|	ВыдачаСредствЗащитыСотруднику.Сотрудник.Наименование КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотруднику.Сотрудник КАК СотрудникСсылка,
	|	ВыдачаСредствЗащитыСотруднику.Ответственный.Наименование КАК Ответственный,
	|	ВыдачаСредствЗащитыСотруднику.Сотрудник.ТабельныйНомер КАК ТабельныйНомер
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК Размер,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата, ГОД, ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата, МЕСЯЦ, ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаСледующейВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса КАК ПроцентИзноса,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ""Артикул""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ""Код""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ""Код синхронизации""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ""Номенклатурный номер""
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗаголовокНоменклатурногоНомера
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыданоПоПричине КАК ПричинаНеВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы.Наименование КАК НоменклатураНормы
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПриложениеКЛичнойКарточкеСИзносом");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ДанныеПечати 					= ПакетЗапросов[0].Выгрузить();
	ТаблицаЗапросаПоВыданным 		= ПакетЗапросов[1].Выгрузить();
	ТаблицаЗапросаПоНеВыданным 		= ПакетЗапросов[2].Выгрузить();
	
	ПервыйДокумент = Истина;
	
	ЗапросПоЗанятымРабочимМестам = Новый Запрос;
	ЗапросПоЗанятымРабочимМестам.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗанятыеРабочиеМеста.Подразделение.Наименование + "" ("" + ЗанятыеРабочиеМеста.Подразделение.Код + "")"" КАК ПредставлениеПодразделения,
	|	ЗанятыеРабочиеМеста.Должность.Наименование + "" ("" + ЗанятыеРабочиеМеста.Должность.Код + "")"" КАК ПредставлениеДолжности,
	|	ЗанятыеРабочиеМеста.РабочееМесто.Наименование + "" ("" + ЗанятыеРабочиеМеста.РабочееМесто.Код + "")"" КАК ПредставлениеРабочегоМеста,
	|	МАКСИМУМ(ЗанятыеРабочиеМеста.Период) КАК ДатаПриема,
	|	ЗанятыеРабочиеМеста.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ЗанятыеРабочиеМеста.Сотрудник.Наименование КАК Сотрудник,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК СотрудникСсылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗанятыеРабочиеМеста.Период КАК Период,
	|		ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|		ЗанятыеРабочиеМеста.Должность КАК Должность,
	|		ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(, Сотрудник В (&МассивСотрудников)) КАК ЗанятыеРабочиеМестаОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|			ПО ЗанятыеРабочиеМестаОстатки.Подразделение = ЗанятыеРабочиеМеста.Подразделение
	|				И ЗанятыеРабочиеМестаОстатки.Должность = ЗанятыеРабочиеМеста.Должность
	|				И ЗанятыеРабочиеМестаОстатки.РабочееМесто = ЗанятыеРабочиеМеста.РабочееМесто
	|				И ЗанятыеРабочиеМестаОстатки.Сотрудник = ЗанятыеРабочиеМеста.Сотрудник
	|	ГДЕ
	|		ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ЗанятыеРабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗанятыеРабочиеМеста.Подразделение.Наименование + "" ("" + ЗанятыеРабочиеМеста.Подразделение.Код + "")"",
	|	ЗанятыеРабочиеМеста.Должность.Наименование + "" ("" + ЗанятыеРабочиеМеста.Должность.Код + "")"",
	|	ЗанятыеРабочиеМеста.РабочееМесто.Наименование + "" ("" + ЗанятыеРабочиеМеста.РабочееМесто.Код + "")"",
	|	ЗанятыеРабочиеМеста.Сотрудник.ТабельныйНомер,
	|	ЗанятыеРабочиеМеста.Сотрудник.Наименование,
	|	ЗанятыеРабочиеМеста.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПриема";
	
	ЗапросПоЗанятымРабочимМестам.УстановитьПараметр("МассивСотрудников",ДанныеПечати.ВыгрузитьКолонку("СотрудникСсылка"));
	
	ТаблицаЗапросаПоПодразделениям = ЗапросПоЗанятымРабочимМестам.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДанныхДляПечати Из ДанныеПечати Цикл
		
		СтрокиПоПодразделениям 	= ТаблицаЗапросаПоПодразделениям.НайтиСтроки(Новый Структура("СотрудникСсылка", СтрокаДанныхДляПечати.СотрудникСсылка));
		СтрокиПоВыданным 		= ТаблицаЗапросаПоВыданным.НайтиСтроки(Новый Структура("Ссылка", СтрокаДанныхДляПечати.Ссылка));
		СтрокиПоНеВыданным 		= ТаблицаЗапросаПоНеВыданным.НайтиСтроки(Новый Структура("Ссылка", СтрокаДанныхДляПечати.Ссылка));
		
		Если (СтрокиПоПодразделениям.Количество() = 0 И СтрокиПоВыданным.Количество() = 0 И СтрокиПоНеВыданным.Количество() = 0) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(СтрокаДанныхДляПечати);
		
		Область.Параметры.ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", СтрокаДанныхДляПечати.Номер, СтрокаДанныхДляПечати.Дата, СтрокаДанныхДляПечати.Префикс), "Карточка (приложение к оборотной стороне ЛК)");
		ТабличныйДокумент.Вывести(Область);
		
		СчетСтрок = 1;
		Для Каждого СтрокаПоПодразделениям Из СтрокиПоПодразделениям Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаПоПодразделениям.ДатаПриема) Тогда
				Продолжить;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("СтрокаПодразделения");
			Область.Параметры.НомерПоПорядку = СчетСтрок;
			Область.Параметры.Заполнить(СтрокаПоПодразделениям);
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Сотрудник");
		Область.Параметры.Заполнить(СтрокаДанныхДляПечати);
		ТабличныйДокумент.Вывести(Область);
		
		ВыведенаВыданоШапка = Ложь;
		
		СчетСтрок = 1;
		Для Каждого СтрокаПоВыданным Из СтрокиПоВыданным Цикл
			
			Если НЕ ВыведенаВыданоШапка Тогда
				Область = Макет.ПолучитьОбласть("ВыданоШапка");
				Область.Параметры.ЗаголовокНоменклатурногоНомера = СтрокаПоВыданным.ЗаголовокНоменклатурногоНомера;
				ТабличныйДокумент.Вывести(Область);
				ВыведенаВыданоШапка = Истина;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("ВыданоСтрока");
			Область.Параметры.Заполнить(СтрокаПоВыданным);
			Область.Параметры.НомерПоПорядку = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		ВыведенаНеВыданоШапка = Ложь;
		
		СчетСтрок = 1;
		Для Каждого СтрокаПоНеВыданным Из СтрокиПоНеВыданным Цикл
			
			Если НЕ ВыведенаНеВыданоШапка Тогда
				Если ВыведенаВыданоШапка Тогда
					Область = Макет.ПолучитьОбласть("ПустаяСтрока");
					ТабличныйДокумент.Вывести(Область);
				КонецЕсли;
				Область = Макет.ПолучитьОбласть("НеВыданоШапка");
				ТабличныйДокумент.Вывести(Область);
				ВыведенаНеВыданоШапка = Истина;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("НеВыданоСтрока");
			Область.Параметры.Заполнить(СтрокаПоНеВыданным);
			Область.Параметры.НомерПоПорядку = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(СтрокаДанныхДляПечати.Ответственный);
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СтрокаДанныхДляПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуМБ7(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_МБ7";
	
	//+++АСТБ_Горюшин_Алексей_26226
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_МБ7");
	//было
	//Макет = Документы.ВыдачаСредствЗащитыСотруднику.ПолучитьМакет("ПФ_MXL_МБ7");
	//---АСТБ_Горюшин_Алексей_26226
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(, ) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Документ,
	|	ВыдачаСредствЗащитыСотруднику.Номер КАК НомерДокумента,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК ДатаСоставления,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК ДатаДокумента,
	|	ВыдачаСредствЗащитыСотруднику.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	ВыдачаСредствЗащитыСотруднику.Склад.Наименование КАК ПредставлениеСклада,
	|	ВыдачаСредствЗащитыСотруднику.Организация.ОКПО КАК ОрганизацияПоОКПО,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтроки КАК НомерПП,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование + "" ("" + ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры.Наименование + "")""
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА 12 * ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов
	|	КОНЕЦ КАК СрокСлужбы,
	|	ВыдачаСредствЗащитыСотруднику.МОЛ.ФизическоеЛицо КАК МОЛ,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Не определено""
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Подразделение.Наименование
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	//Р.Машенцев+   59867
	|				ИЛИ  ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)  
//	|				ИЛИ НЕ ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача) //Было
    //Р.Машенцев-   59867
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель.Наименование
	|	КОНЕЦ КАК РуководительПодразделения,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	//Р.Машенцев+   59867
	|				ИЛИ  ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)    
//	|				ИЛИ НЕ ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача) //Было
    //Р.Машенцев-   59867
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ОсновноеМестоРаботы1.Должность ЕСТЬ NULL
	|					ТОГДА """"
	|				ИНАЧЕ ВТ_ОсновноеМестоРаботы1.Должность.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ДолжностьРуководителя,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы2.Должность ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы2.Должность.Наименование
	|	КОНЕЦ КАК ДолжностьМОЛ
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|			ПО ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|				И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|				И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|		ПО ВыдачаСредствЗащитыСотруднику.Ссылка = ВыдачаСредствЗащитыСотрудникуТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы1
	|			ПО ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель = ВТ_ОсновноеМестоРаботы1.Сотрудник
	|		ПО (ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы2
	|		ПО ВыдачаСредствЗащитыСотруднику.МОЛ = ВТ_ОсновноеМестоРаботы2.Сотрудник
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество = 0
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|	И НЕ ВыдачаСредствЗащитыСотруднику.ПредварительнаяСборка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыдачаСредствЗащитыСотруднику.Ссылка,
	|	НомерПП
	|ИТОГИ ПО
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ПервыйДокумент = Истина;
		
		ВыборкаПоДокументам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			// заголовок
			Область = Макет.ПолучитьОбласть("Заголовок");
			Область.Параметры.Заполнить(ВыборкаПоДокументам);
			ТабДокумент.Вывести(Область);
			
			// подразделения
			ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			ТаблицаПодразделенийВШапке = Новый ТаблицаЗначений;
			ТаблицаПодразделенийВШапке.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("Строка"));
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Если НЕ ТаблицаПодразделенийВШапке.Найти(ВыборкаПоСтрокам.ПодразделениеПолучатель,"Подразделение") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("Подразделение");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				ТабДокумент.Вывести(Область);
				
				НоваяСтрока = ТаблицаПодразделенийВШапке.Добавить();
				НоваяСтрока.Подразделение = ВыборкаПоСтрокам.ПодразделениеПолучатель;
				
				РуководительПодразделения = ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоСтрокам.РуководительПодразделения);
				
				//АсТБ_Alexey_59867_********************************************************************
				ДолжностьМОЛ 			= ВыборкаПоСтрокам.ДолжностьМОЛ;
				ДолжностьРуководителя 	= ВыборкаПоСтрокам.ДолжностьРуководителя;
				//АсТБ_Alexey_59867_********************************************************************
				
			КонецЦикла;
			
			// шапка табличной части
			Область = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(Область);
			
			// Строки
			ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Сч = 1;
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				Область.Параметры.НомерПП = Сч;
				ТабДокумент.Вывести(Область);
				Сч = Сч + 1;
				
			КонецЦикла;
			
			// Подвал
			Область = Макет.ПолучитьОбласть("Подписи");
			//+++АСТБ_Горюшин_Алексей_26226
			СтруктураПодвала = Новый Структура();
			СтруктураПодвала.Вставить("МОЛФИО",ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.МОЛ));
			СтруктураПодвала.Вставить("РуководительПодразделения",РуководительПодразделения);
			СтруктураПодвала.Вставить("ДатаДокумента",ВыборкаПоДокументам.ДатаДокумента);
			
			//АсТБ_Alexey_59867_********************************************************************
			СтруктураПодвала.Вставить("ДолжностьМОЛ",			ДолжностьМОЛ);
			СтруктураПодвала.Вставить("ДолжностьРуководителя",	ДолжностьРуководителя);
			//АсТБ_Alexey_59867_********************************************************************
			
			Область.Параметры.Заполнить(СтруктураПодвала);
			//было
			//Область.Параметры.МОЛФИО 					= ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.МОЛ);
			//Область.Параметры.РуководительПодразделения = РуководительПодразделения;
			//Область.Параметры.ДатаДокумента 			= ВыборкаПоДокументам.ДатаДокумента;
			//---АСТБ_Горюшин_Алексей_26226
			ТабДокумент.Вывести(Область);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Документ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		Если НЕ ЭлементМассива.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача Тогда
			Продолжить;
		КонецЕсли;
		
		//фиксируем завершение обслуживания
		НаборЗаписей = РегистрыСведений.ТочкиОбслуживанияСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументВыдачи.Установить(ЭлементМассива);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись 						= НаборЗаписей.Добавить();
			НоваяЗапись.ДокументВыдачи 			= ЭлементМассива;
			НоваяЗапись.ПринятВРаботу 			= ЭлементМассива.Дата;
			НоваяЗапись.ОбслуживаниеЗавершено	= ТекущаяДата();
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(НаборЗаписей[0].ОбслуживаниеЗавершено) Тогда
				НаборЗаписей[0].ОбслуживаниеЗавершено = ТекущаяДата();
			КонецЕсли;	
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуПроизвольнойВыдачиСИЗ(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ПроизвольнаяВыдачаСИЗ";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Заказчик.ФизическоеЛицо КАК Заказчик,
	|	Документы.МВЗ.Наименование КАК ПредставлениеМВЗ,
	|	Документы.Сотрудник.ФизическоеЛицо КАК Получатель,
	|	Документы.Ответственный.Наименование КАК Ответственный
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|	И Документы.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Товары.НоменклатураНормы.Наименование
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Товары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|					ТОГДА Товары.Номенклатура.Наименование
	|				ИНАЧЕ Товары.Номенклатура.Наименование + "" ("" + Товары.ХарактеристикаНоменклатуры.Наименование + "")""
	|			КОНЕЦ
	|	КОНЕЦ КАК НаименованиеТовара,
	|	ВЫБОР
	|		КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА Товары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА Товары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА Товары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	Товары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	Товары.НомерСтроки
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО Товары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И Товары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И Товары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И НЕ Товары.НеВыдано
	|	И Товары.Ссылка.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Товары.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ", 	Перечисления.ВидыВыдачиСИЗ.ПроизвольнаяВыдача);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПроизвольнаяВыдачаСИЗ");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ДанныеПечати = ПакетЗапросов[0].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(ДанныеПечати);
		
		Область.Параметры.ТекстЗаголовка 			= ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Произвольная выдача СИЗ");
		Область.Параметры.ПредставлениеЗаказчика 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Заказчик);
		
		ПредставлениеПолучатель 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Получатель);
		ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Ответственный);
		
		ТабличныйДокумент.Вывести(Область);
			
		СчетСтрок = 1;
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Параметры.Заполнить(ВыборкаПоТоварам);
			Область.Параметры.НомерСтроки = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
		Область.Параметры.ИтоговаяСтрока 				= ТекстИтоговойСтроки;
		Область.Параметры.ПредставлениеПолучатель 		= ПредставлениеПолучатель;
		Область.Параметры.ПредставлениеОтветственного 	= ПредставлениеОтветственного;
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуПроизвольнойВыдачиСИЗСИзносом(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ПроизвольнаяВыдачаСИЗСИзносом";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Заказчик.ФизическоеЛицо КАК Заказчик,
	|	Документы.МВЗ.Наименование КАК ПредставлениеМВЗ,
	|	Документы.Сотрудник.ФизическоеЛицо КАК Получатель,
	|	Документы.Ответственный.Наименование КАК Ответственный
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|	И Документы.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Товары.НоменклатураНормы.Наименование
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Товары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|					ТОГДА Товары.Номенклатура.Наименование
	|				ИНАЧЕ Товары.Номенклатура.Наименование + "" ("" + Товары.ХарактеристикаНоменклатуры.Наименование + "")""
	|			КОНЕЦ
	|	КОНЕЦ КАК НаименованиеТовара,
	|	ВЫБОР
	|		КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА Товары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА Товары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА Товары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	Товары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО Товары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И Товары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И Товары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И НЕ Товары.НеВыдано
	|	И Товары.Ссылка.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Товары.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ", 	Перечисления.ВидыВыдачиСИЗ.ПроизвольнаяВыдача);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ПроизвольнаяВыдачаСИЗСИзносом");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ДанныеПечати = ПакетЗапросов[0].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(ДанныеПечати);
		
		Область.Параметры.ТекстЗаголовка 			= ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Произвольная выдача СИЗ");
		Область.Параметры.ПредставлениеЗаказчика 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Заказчик);
		
		ПредставлениеПолучатель 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Получатель);
		ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Ответственный);
		
		ТабличныйДокумент.Вывести(Область);
			
		СчетСтрок = 1;
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Параметры.Заполнить(ВыборкаПоТоварам);
			Область.Параметры.НомерСтроки = СчетСтрок;
			ТабличныйДокумент.Вывести(Область);
			
			СчетСтрок = СчетСтрок + 1;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
		Область.Параметры.ИтоговаяСтрока 				= ТекстИтоговойСтроки;
		Область.Параметры.ПредставлениеПолучатель 		= ПредставлениеПолучатель;
		Область.Параметры.ПредставлениеОтветственного 	= ПредставлениеОтветственного;
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуМБ7ДляПланшета(ТекущийДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_МБ7_Планшет";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_МБ7_Планшет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(, ) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Документ,
	|	ВыдачаСредствЗащитыСотруднику.Номер КАК НомерДокумента,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК ДатаСоставления,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК ДатаДокумента,
	|	ВыдачаСредствЗащитыСотруднику.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	ВыдачаСредствЗащитыСотруднику.Склад.Наименование КАК ПредставлениеСклада,
	|	ВыдачаСредствЗащитыСотруднику.Организация.ОКПО КАК ОрганизацияПоОКПО,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтроки КАК НомерПП,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование + "" ("" + ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры.Наименование + "")""
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА 12 * ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов
	|	КОНЕЦ КАК СрокСлужбы,
	|	ВыдачаСредствЗащитыСотруднику.МОЛ.ФизическоеЛицо КАК МОЛ,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Не определено""
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Подразделение.Наименование
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	|				ИЛИ НЕ ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель.Наименование
	|	КОНЕЦ КАК РуководительПодразделения
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|			ПО ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|				И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|				И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|		ПО ВыдачаСредствЗащитыСотруднику.Ссылка = ВыдачаСредствЗащитыСотрудникуТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО (ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник)
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка = &ТекущийДокумент
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &ТекущийДокумент
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыдачаСредствЗащитыСотруднику.Ссылка,
	|	НомерПП
	|ИТОГИ ПО
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ПервыйДокумент = Истина;
		
		ВыборкаПоДокументам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			// заголовок
			Область = Макет.ПолучитьОбласть("Заголовок");
			Область.Параметры.Заполнить(ВыборкаПоДокументам);
			ТабДокумент.Вывести(Область);
			
			// подразделения
			ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			ТаблицаПодразделенийВШапке = Новый ТаблицаЗначений;
			ТаблицаПодразделенийВШапке.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("Строка"));
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Если НЕ ТаблицаПодразделенийВШапке.Найти(ВыборкаПоСтрокам.ПодразделениеПолучатель,"Подразделение") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("Подразделение");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				ТабДокумент.Вывести(Область);
				
				НоваяСтрока = ТаблицаПодразделенийВШапке.Добавить();
				НоваяСтрока.Подразделение = ВыборкаПоСтрокам.ПодразделениеПолучатель;
				
				РуководительПодразделения 	= ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоСтрокам.РуководительПодразделения);
				
			КонецЦикла;
			
			// шапка табличной части
			Область = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(Область);
			
			// Строки
			ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Сч = 1;
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				Область.Параметры.НомерПП = Сч;
				ТабДокумент.Вывести(Область);
				Сч = Сч + 1;
				
			КонецЦикла;
			
			// Подвал
			Область = Макет.ПолучитьОбласть("ПодписьРаботника");
			ТабДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Подписи");
			Область.Параметры.МОЛФИО 					= ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.МОЛ);
			Область.Параметры.РуководительПодразделения = РуководительПодразделения;
			ТабДокумент.Вывести(Область);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуЗаданияНаСборку(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_ЗаданиеНаСборку";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиНоменклатуры.Регистратор КАК Ссылка,
	|	ОстаткиНоменклатуры.Регистратор.Организация КАК Организация,
	|	ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатуры.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
	|ГДЕ
	|	ОстаткиНоменклатуры.Регистратор В(&МассивОбъектов)
	|	И ОстаткиНоменклатуры.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Организация.Наименование КАК ПредставлениеОрганизации,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.СкладОтправитель.Наименование КАК ПредставлениеСкладаОтправителя,
	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Ответственный.Наименование КАК Ответственный,
	|	Документы.МОЛ.ФизическоеЛицо КАК МОЛ,
	|	Документы.Склад КАК Склад
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Ссылка КАК Ссылка,
	|	ВТ_ДанныеРегистра.Количество КАК Количество,
	|	ВТ_ДанныеРегистра.Номенклатура.Наименование КАК НаименованиеТовара,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВТ_ДанныеРегистра.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВТ_ДанныеРегистра.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВТ_ДанныеРегистра.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_ДанныеРегистра.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВТ_ДанныеРегистра.ХарактеристикаНоменклатуры КАК Размер,
	|	ВТ_ДанныеРегистра.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|		ПО ВТ_ДанныеРегистра.Организация = НоменклатурныеНомераОрганизаций.Организация
	|			И ВТ_ДанныеРегистра.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|			И ВТ_ДанныеРегистра.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеРегистра.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра");
		
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыСотруднику.ПФ_MXL_ЗаданиеНаСборку");
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ДанныеПечати = ПакетЗапросов[1].Выбрать();
	ВыборкаПоДокументам = ПакетЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МассивНоменклатуры = ПакетЗапросов[3].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаТочекХранения = ПроцедурыРаботыСНормамиСервер.ПолучитьТочкиХраненияНоменклатуры(МассивНоменклатуры,ДанныеПечати.Склад);
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		Область = Макет.ПолучитьОбласть("Шапка");
		
		Область.Параметры.ТекстЗаголовка = "Задание на сборку №" + ДанныеПечати.Номер + " от " + Формат(ДанныеПечати.Дата,"ДЛФ=DD");
		
		ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.Ответственный);
		
		ТабличныйДокумент.Вывести(Область);
			
		СчетСтрок = 0;
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			Если ТаблицаТочекХранения = Неопределено Тогда
			    ТочкаХранения = "";
			Иначе
				НайденныеСтроки = ТаблицаТочекХранения.НайтиСтроки(Новый Структура("Номенклатура",ВыборкаПоТоварам.Номенклатура));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ТочкаХранения = "";
				Иначе
					ТочкаХранения = НайденныеСтроки[0].ТочкаХранения.Наименование;	
				КонецЕсли;
			КонецЕсли;
			
			СчетСтрок = СчетСтрок + 1;
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Параметры.Заполнить(ВыборкаПоТоварам);
			Область.Параметры.НомерСтроки = СчетСтрок;
			Область.Параметры.ТочкаХранения = ТочкаХранения;
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ВсегоНаименований 			= СчетСтрок;
		Область.Параметры.ПредставлениеОтветственного 	= ПредставлениеОтветственного;
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		Если НЕ ЭлементМассива.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача Тогда
			Продолжить;
		КонецЕсли;
		
		//фиксируем передачу в сборку
		НаборЗаписей = РегистрыСведений.ТочкиОбслуживанияСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументВыдачи.Установить(ЭлементМассива);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись 				= НаборЗаписей.Добавить();
			НоваяЗапись.ДокументВыдачи 	= ЭлементМассива;
			НоваяЗапись.ПринятВРаботу 	= ЭлементМассива.Дата;
			НоваяЗапись.ПереданНаСборку	= ТекущаяДата();
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(НаборЗаписей[0].ПереданНаСборку) Тогда
				НаборЗаписей[0].ПереданНаСборку	= ТекущаяДата();
			КонецЕсли;	
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//АсТБ_Alexey_78736_********************************************************************
Функция СформироватьПечатнуюФормуМБ7сИзносом(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыСотруднику_МБ7_Износ";
	
	Макет = ПолучитьМакет("ПФ_MXL_МБ7_Износ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(, ) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Документ,
	|	ВыдачаСредствЗащитыСотруднику.Номер КАК НомерДокумента,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК ДатаСоставления,
	|	ВыдачаСредствЗащитыСотруднику.Дата КАК ДатаДокумента,
	|	ВыдачаСредствЗащитыСотруднику.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	ВыдачаСредствЗащитыСотруднику.Склад.Наименование КАК ПредставлениеСклада,
	|	ВыдачаСредствЗащитыСотруднику.Организация.ОКПО КАК ОрганизацияПоОКПО,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтроки КАК НомерПП,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Наименование + "" ("" + ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры.Наименование + "")""
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Артикул
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	|					ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Код
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	|							ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.КодСинхронизации
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВыдачаСредствЗащитыСотруднику.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ЕСТЬNULL(ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА 12 * ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов
	|	КОНЕЦ, 0) КАК СрокСлужбы,
	|	ВыдачаСредствЗащитыСотруднику.МОЛ.ФизическоеЛицо КАК МОЛ,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Не определено""
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Подразделение.Наименование
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	|				ИЛИ НЕ ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель.Наименование
	|	КОНЕЦ КАК РуководительПодразделения,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL
	|				ИЛИ НЕ ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ОсновноеМестоРаботы1.Должность ЕСТЬ NULL
	|					ТОГДА """"
	|				ИНАЧЕ ВТ_ОсновноеМестоРаботы1.Должность.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ДолжностьРуководителя,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы2.Должность ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы2.Должность.Наименование
	|	КОНЕЦ КАК ДолжностьМОЛ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса.Код, 0) КАК ПроцентИзноса
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|			ПО ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	|				И ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	|				И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	|		ПО ВыдачаСредствЗащитыСотруднику.Ссылка = ВыдачаСредствЗащитыСотрудникуТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы1
	|			ПО ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель = ВТ_ОсновноеМестоРаботы1.Сотрудник
	|		ПО (ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы2
	|		ПО ВыдачаСредствЗащитыСотруднику.МОЛ = ВТ_ОсновноеМестоРаботы2.Сотрудник
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивОбъектов)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество = 0
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|	И НЕ ВыдачаСредствЗащитыСотруднику.ПредварительнаяСборка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыдачаСредствЗащитыСотруднику.Ссылка,
	|	НомерПП
	|ИТОГИ ПО
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ПервыйДокумент = Истина;
		
		ВыборкаПоДокументам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			// заголовок
			Область = Макет.ПолучитьОбласть("Заголовок");
			Область.Параметры.Заполнить(ВыборкаПоДокументам);
			ТабДокумент.Вывести(Область);
			
			// подразделения
			ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			ТаблицаПодразделенийВШапке = Новый ТаблицаЗначений;
			ТаблицаПодразделенийВШапке.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("Строка"));
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Если НЕ ТаблицаПодразделенийВШапке.Найти(ВыборкаПоСтрокам.ПодразделениеПолучатель,"Подразделение") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("Подразделение");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				ТабДокумент.Вывести(Область);
				
				НоваяСтрока = ТаблицаПодразделенийВШапке.Добавить();
				НоваяСтрока.Подразделение = ВыборкаПоСтрокам.ПодразделениеПолучатель;
				
				РуководительПодразделения = ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоСтрокам.РуководительПодразделения);
				
				//АсТБ_Alexey_59867_********************************************************************
				ДолжностьМОЛ 			= ВыборкаПоСтрокам.ДолжностьМОЛ;
				ДолжностьРуководителя 	= ВыборкаПоСтрокам.ДолжностьРуководителя;
				//АсТБ_Alexey_59867_********************************************************************
				
			КонецЦикла;
			
			// шапка табличной части
			Область = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(Область);
			
			// Строки
			ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Сч = 1;
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				Область.Параметры.НомерПП = Сч;
				//срок службы в месяцах - ((срок службы в месяцах / 100) *процент износа)
				Если ВыборкаПоСтрокам.ВидРасчета = Перечисления.ВидыРасчетаНорм.ДоИзноса Тогда
					Область.Параметры.СрокСлужбы = "До износа";
				Иначе 
					Область.Параметры.СрокСлужбы = Окр(ВыборкаПоСтрокам.СрокСлужбы - ((ВыборкаПоСтрокам.СрокСлужбы/100) * ВыборкаПоСтрокам.ПроцентИзноса)); 
				КонецЕсли;
				ТабДокумент.Вывести(Область);
				Сч = Сч + 1;
				
			КонецЦикла;
			
			// Подвал
			Область = Макет.ПолучитьОбласть("Подписи");
			//+++АСТБ_Горюшин_Алексей_26226
			СтруктураПодвала = Новый Структура();
			СтруктураПодвала.Вставить("МОЛФИО",ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.МОЛ));
			СтруктураПодвала.Вставить("РуководительПодразделения",РуководительПодразделения);
			СтруктураПодвала.Вставить("ДатаДокумента",ВыборкаПоДокументам.ДатаДокумента);
			
			//АсТБ_Alexey_59867_********************************************************************
			СтруктураПодвала.Вставить("ДолжностьМОЛ",			ДолжностьМОЛ);
			СтруктураПодвала.Вставить("ДолжностьРуководителя",	ДолжностьРуководителя);
			//АсТБ_Alexey_59867_********************************************************************
			
			Область.Параметры.Заполнить(СтруктураПодвала);
			//было
			//Область.Параметры.МОЛФИО 					= ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.МОЛ);
			//Область.Параметры.РуководительПодразделения = РуководительПодразделения;
			//Область.Параметры.ДатаДокумента 			= ВыборкаПоДокументам.ДатаДокумента;
			//---АСТБ_Горюшин_Алексей_26226
			ТабДокумент.Вывести(Область);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Документ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		Если НЕ ЭлементМассива.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача Тогда
			Продолжить;
		КонецЕсли;
		
		//фиксируем завершение обслуживания
		НаборЗаписей = РегистрыСведений.ТочкиОбслуживанияСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументВыдачи.Установить(ЭлементМассива);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись 						= НаборЗаписей.Добавить();
			НоваяЗапись.ДокументВыдачи 			= ЭлементМассива;
			НоваяЗапись.ПринятВРаботу 			= ЭлементМассива.Дата;
			НоваяЗапись.ОбслуживаниеЗавершено	= ТекущаяДата();
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(НаборЗаписей[0].ОбслуживаниеЗавершено) Тогда
				НаборЗаписей[0].ОбслуживаниеЗавершено = ТекущаяДата();
			КонецЕсли;	
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции
//АсТБ_Alexey_78736_********************************************************************

Процедура ЗаполнитьТаблицуДокумента(ТекущийОбъект,ВыбранныйСотрудник = Неопределено,ДСИЗ = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АлгоритмФормированияПотребности = ПроцедурыРаботыСНормамиСервер.ПолучитьАлгоритмФормированияПотребности(ТекущийОбъект.Организация);
	
	Если АлгоритмФормированияПотребности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Выполнить("Алгоритм_" + АлгоритмФормированияПотребности + "_Сервер.ВыдачаСИЗ_ЗаполнитьТаблицуДокумента(ТекущийОбъект,ВыбранныйСотрудник,ДСИЗ)");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДокументаПоЗаявке(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтроки КАК НомерСтроки,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано КАК НеВыдано,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыданоПоПричине КАК НеВыданоПоПричине,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект КАК Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте КАК КоличествоВКомплекте,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДобавленаКопированием КАК ДобавленаКопированием,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ВыдачаСверхНорм КАК ВыдачаСверхНорм
	|ПОМЕСТИТЬ ВТ_ЗаявкаНаПредварительнуюВыдачу
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &ЗаявкаНаПредварительнуюВыдачу
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтроки КАК НомерСтроки,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано КАК НеВыдано,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыданоПоПричине КАК НеВыданоПоПричине,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект КАК Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте КАК КоличествоВКомплекте,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДобавленаКопированием КАК ДобавленаКопированием,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ВыдачаСверхНорм КАК ВыдачаСверхНорм
	|ПОМЕСТИТЬ ВТ_ВыданоПоЗаявке
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Проведен
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ДокументОснование = &ЗаявкаНаПредварительнуюВыдачу
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &ТекущийДокументВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.НеВыдано КАК НеВыдано,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.НеВыданоПоПричине КАК НеВыданоПоПричине,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.Сотрудник КАК Сотрудник,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.Номенклатура КАК Номенклатура,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.Количество - ЕСТЬNULL(ВТ_ВыданоПоЗаявке.Количество, 0) КАК Количество,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.Цена КАК Цена,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.Сумма - ЕСТЬNULL(ВТ_ВыданоПоЗаявке.Сумма, 0) КАК Сумма,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.Комплект КАК Комплект,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.КоличествоВКомплекте КАК КоличествоВКомплекте,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.ДобавленаКопированием КАК ДобавленаКопированием,
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу.ВыдачаСверхНорм КАК ВыдачаСверхНорм
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ЗаявкаНаПредварительнуюВыдачу КАК ВТ_ЗаявкаНаПредварительнуюВыдачу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданоПоЗаявке КАК ВТ_ВыданоПоЗаявке
	|		ПО ВТ_ЗаявкаНаПредварительнуюВыдачу.Сотрудник = ВТ_ВыданоПоЗаявке.Сотрудник
	|			И ВТ_ЗаявкаНаПредварительнуюВыдачу.НормаВыдачи = ВТ_ВыданоПоЗаявке.НормаВыдачи
	|			И ВТ_ЗаявкаНаПредварительнуюВыдачу.НоменклатураНормы = ВТ_ВыданоПоЗаявке.НоменклатураНормы
	|			И ВТ_ЗаявкаНаПредварительнуюВыдачу.Номенклатура = ВТ_ВыданоПоЗаявке.Номенклатура
	|			И ВТ_ЗаявкаНаПредварительнуюВыдачу.ХарактеристикаНоменклатуры = ВТ_ВыданоПоЗаявке.ХарактеристикаНоменклатуры
	|ГДЕ
	|	НЕ ВТ_ЗаявкаНаПредварительнуюВыдачу.Количество - ЕСТЬNULL(ВТ_ВыданоПоЗаявке.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.НеВыдано КАК НеВыдано,
	|	ВТ_Результат.НеВыданоПоПричине КАК НеВыданоПоПричине,
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_Потребность.НормаВыдачи ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НормыВЫдачиСИЗ.ПустаяСсылка)
	|		ИНАЧЕ ВТ_Результат.НормаВыдачи
	|	КОНЕЦ КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.Цена КАК Цена,
	|	ВТ_Результат.Сумма КАК Сумма,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.Комплект КАК Комплект,
	|	ВТ_Результат.КоличествоВКомплекте КАК КоличествоВКомплекте,
	|	ВТ_Результат.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_Результат.ДобавленаКопированием КАК ДобавленаКопированием,
	|	ВТ_Результат.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ВТ_Результат.НормаВыдачи.Наименование КАК НормаВыдачиНаименование,
	|	ВТ_Результат.ВыдачаСверхНорм КАК ВыдачаСверхНорм
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
	|		ПО ВТ_Результат.Сотрудник = ВТ_Потребность.Сотрудник
	|			И ВТ_Результат.НормаВыдачи = ВТ_Потребность.НормаВыдачи
	|			И ВТ_Результат.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
	|			И (НАЧАЛОПЕРИОДА(ВТ_Результат.ДатаВыдачи, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(ВТ_Потребность.ДатаПотребности, МЕСЯЦ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	ВТ_Результат.НормаВыдачи.Наименование";
	
	Запрос.УстановитьПараметр("ЗаявкаНаПредварительнуюВыдачу",	ТекущийОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("ТекущийДокументВыдачи",			ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",					ТекущийОбъект.Организация);
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//МБ-7
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "МБ7";
	КомандаПечати.Представление = НСтр("ru = 'Форма МБ-7'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//приложение к личной карточке
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ПриложениеКЛичнойКарточке";
	КомандаПечати.Представление = НСтр("ru = 'Приложение к личной карточке'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//приложение к личной карточке (с % износа)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ПриложениеКЛичнойКарточкеСИзносом";
	КомандаПечати.Представление = НСтр("ru = 'Приложение к личной карточке (с % износа)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ФункциональныеОпции = "ИспользоватьПроцентИзноса";
	КомандаПечати.СписокФорм =   		"ФормаДокумента";
	
	//коллективная выдача
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ТоварнаяНакладная";
	КомандаПечати.Представление = НСтр("ru = 'Товарная накладная'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//коллективная выдача (с % износа)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ТоварнаяНакладнаяСИзносом";
	КомандаПечати.Представление = НСтр("ru = 'Товарная накладная (с % износа)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ФункциональныеОпции = "ИспользоватьПроцентИзноса";
	КомандаПечати.СписокФорм =   		"ФормаДокумента";
	
	//ведомость
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ВедомостьНаВыдачуСИЗ";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость на выдачу СИЗ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	//прозвольная выдача
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ПроизвольнаяВыдачаСИЗ";
	КомандаПечати.Представление = НСтр("ru = 'Произвольная выдача СИЗ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//прозвольная выдача (с % износа)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ПроизвольнаяВыдачаСИЗСИзносом";
	КомандаПечати.Представление = НСтр("ru = 'Произвольная выдача СИЗ (с % износа)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ФункциональныеОпции = "ИспользоватьПроцентИзноса";
	КомандаПечати.СписокФорм =   		"ФормаДокумента";
	
	//задание на сборку
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "ЗаданиеНаСборку";
	КомандаПечати.Представление = НСтр("ru = 'Задание на сборку'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//***НСК Трегубов А.А.*** -- АдресноеХранение --  03.09.2019 <<<
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланыСнятияАдресногоХранения";
	КомандаПечати.Представление = НСтр("ru = '(АХ) Планы снятия'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ФункциональныеОпции = "АХ_ИспользоватьАдресноеХранениеСкоробами";
	КомандаПечати.СписокФорм = "ФормаДокумента";
	КомандаПечати.Обработчик = "АХ_ОбменКлиент.СформироватьПечатныеФормыАдресногоХранения";
	//***НСК Трегубов А.А.*** -- АдресноеХранение --  03.09.2019 >>>
	
	//АсТБ_Alexey_78736_********************************************************************
	//МБ-7 с износом
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыСотруднику";
	КомандаПечати.Идентификатор = "МБ7_Износ";
	КомандаПечати.Представление = НСтр("ru = 'Форма МБ-7 (с износом)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//АсТБ_Alexey_78736_********************************************************************
	
КонецПроцедуры

Процедура ЗаполнитьДокумент(ДанныеЗаполнения,ЭтотОбъект) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			Основание = ДанныеЗаполнения.Сотрудник;
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Основание = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		ЭтотОбъект.Сотрудник 	= Основание;
		ЭтотОбъект.Организация 	= Основание.Владелец;
		ЭтотОбъект.Дата			= ТекущаяДата();
		ЭтотОбъект.ВидВыдачиСИЗ	= Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача;
		ЭтотОбъект.ВидОперации  = Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача;
		
		//АСТБ_ALEXEY_69654_**************************************************************
		
		//ТаблицаСкладовВыдачи 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуСкладовВыдачи(Основание);
		
		//НайденныеСтроки = ТаблицаСкладовВыдачи.НайтиСтроки(Новый Структура("ВидВыдачиСИЗ",ЭтотОбъект.ВидВыдачиСИЗ));
		//
		//Если НайденныеСтроки.Количество() = 0 Тогда
		//	ЭтотОбъект.Склад = Справочники.Склады.ПустаяСсылка();
		//Иначе
		//	НайденныеСтрокиПоСотруднику = ТаблицаСкладовВыдачи.НайтиСтроки(Новый Структура("ВидВыдачиСИЗ,Получатель",ЭтотОбъект.ВидВыдачиСИЗ,Основание));
		//	Если НайденныеСтрокиПоСотруднику.Количество() = 0 Тогда
		//		ТекущийСклад = Справочники.Склады.ПустаяСсылка();
		//		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		//			Если ЗначениеЗаполнено(НайденнаяСтрока.Получатель) Тогда
		//				ЭтотОбъект.Склад = НайденнаяСтрока.Склад;
		//				ТекущийСклад = НайденнаяСтрока.Склад;
		//				Прервать;
		//			Иначе
		//				ТекущийСклад = НайденнаяСтрока.Склад;
		//			КонецЕсли;
		//			Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
		//				ЭтотОбъект.Склад = ТекущийСклад;
		//			КонецЕсли;
		//		КонецЦикла;
		//	Иначе
		//		ЭтотОбъект.Склад = НайденныеСтрокиПоСотруднику[0].Склад;
		//	КонецЕсли;
		//КонецЕсли;
		
		//ЗаполнитьТаблицуДокумента(ЭтотОбъект);
		
		//АСТБ_ALEXEY_69654_**************************************************************
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаПроизвольнуюВыдачуСИЗ") Тогда
		
		ЭтотОбъект.Дата					= ТекущаяДата();
		ЭтотОбъект.ВидОперации          = Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача;
		ЭтотОбъект.ВидВыдачиСИЗ 		= Перечисления.ВидыВыдачиСИЗ.ПроизвольнаяВыдача;
		ЭтотОбъект.Организация 			= ДанныеЗаполнения.Организация;
		ЭтотОбъект.Склад 				= ДанныеЗаполнения.Склад;
		ЭтотОбъект.Заказчик 			= ДанныеЗаполнения.Заказчик;
		ЭтотОбъект.МВЗ 					= ДанныеЗаполнения.МВЗ;
		ЭтотОбъект.ДокументОснование 	= Основание;
		ЭтотОбъект.СуммаДокумента 		= ДанныеЗаполнения.СуммаДокумента;
		ЭтотОбъект.Сотрудник 			= ДанныеЗаполнения.Сотрудник;
		
		ЗаполнитьТаблицуДокумента(ЭтотОбъект);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОбращениеНаСклад") Тогда
		
		ЭтотОбъект.Дата					= ТекущаяДата();
		ЭтотОбъект.ВидОперации          = Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача;
		ЭтотОбъект.ВидВыдачиСИЗ 		= Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача;
		ЭтотОбъект.Организация 			= ДанныеЗаполнения.Организация;
		ЭтотОбъект.Склад 				= ДанныеЗаполнения.Склад;
		ЭтотОбъект.ДокументОснование 	= Основание;
		ЭтотОбъект.Сотрудник 			= ДанныеЗаполнения.Сотрудник;
		
		ЗаполнитьТаблицуДокумента(ЭтотОбъект);	
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
		
		ЭтотОбъект.ВидВыдачиСИЗ 		= Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача;
		ЭтотОбъект.ВидОперации          = Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача;
		ЭтотОбъект.Организация 			= ДанныеЗаполнения.Организация;
		ЭтотОбъект.Склад 				= ДанныеЗаполнения.Склад;
		ЭтотОбъект.СкладОтправитель		= ДанныеЗаполнения.СкладОтправитель;
		ЭтотОбъект.ДокументОснование 	= Основание;
		ЭтотОбъект.МОЛ					= ДанныеЗаполнения.МОЛ;
		ЭтотОбъект.МОЛСкладаОтправителя = ДанныеЗаполнения.МОЛСкладаОтправителя;
		ЗаполнитьТаблицуДокумента(ЭтотОбъект);
		
	КонецЕсли;
	
	//АСТБ_ALEXEY_70409**************************************************************
	//ЭтотОбъект.МОЛ = ПроцедурыРаботыСНормамиСервер.ПолучитьМОЛСклада(ЭтотОбъект.Склад,ЭтотОбъект.Организация);
	ЭтотОбъект.МОЛ = ПроцедурыРаботыСНормамиСервер.ПолучитьМОЛСклада(ЭтотОбъект.Склад,ЭтотОбъект.Организация,ПараметрыСеанса.ТекущийПользователь);
	//АСТБ_ALEXEY_70409**************************************************************
	
КонецПроцедуры

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище
//
Функция ПолучитьДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт
	
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 <<<
	
	ТекстСообщения = "Документы: ";
	
	ЕстьНепроведенные = Ложь;
	
	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		
		Если НЕ ТекущийДокумент.Проведен Тогда
			
			ЕстьНепроведенные = Истина;
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекущийДокумент;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "не проведены. Печать этикеток невозможна.";
	
	Если ЕстьНепроведенные Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Сообщить();
	КонецЕсли;	
	
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 >>>
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Комплект
	|			ТОГДА НоменклатураКомплектующие.Номенклатура
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация.ОтображатьДатуОкончанияСрокаНоскиНаЭтикетках
	|				ТОГДА ВЫБОР
	|						КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата, ДЕНЬ), МЕСЯЦ, ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|						ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата, ДЕНЬ), МЕСЯЦ, ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи.КоличествоПериодов)
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОНЕЦ) КАК ДатаОкончанияИспользования
	|ПОМЕСТИТЬ ВТ_ДатаОкончанияИспользования
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура = НоменклатураКомплектующие.Ссылка
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивДокументов)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 <<<
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Проведен
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 >>>
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура.Комплект
	|			ТОГДА НоменклатураКомплектующие.Номенклатура
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ВТ_ДатаОкончанияИспользования.ДатаОкончанияИспользования КАК ДатаОкончанияИспользования
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.ШтрихкодыНоменклатуры КАК ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаОкончанияИспользования КАК ВТ_ДатаОкончанияИспользования
	|		ПО ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Номенклатура = ВТ_ДатаОкончанияИспользования.Номенклатура
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка В(&МассивДокументов)
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 <<<
	|	И ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Проведен
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 >>>
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник.Наименование,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Номенклатура.Наименование,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры.КодSAP,
	|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ДатаВыдачи";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ИсходныеДанные", Запрос.Выполнить().Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции 

Процедура ЗаполнитьШтрихкоды(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВыдачи.Номенклатура КАК НоменклатураДокумента,
	|	ТаблицаВыдачи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыДокумента,
	|	ТаблицаВыдачи.Количество КАК Количество,
	|	ТаблицаВыдачи.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаВыдачи
	|ИЗ
	|	&ТаблицаВыдачи КАК ТаблицаВыдачи
	|ГДЕ
	|	НЕ ТаблицаВыдачи.НеВыдано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаВыдачи.Количество КАК Количество,
	|	ВТ_ТаблицаВыдачи.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаСНоменклатурой
	|ИЗ
	|	ВТ_ТаблицаВыдачи КАК ВТ_ТаблицаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ТаблицаВыдачи.НоменклатураДокумента = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_ТаблицаВыдачи.НоменклатураДокумента = ХарактеристикиНоменклатуры.Владелец
	|			И ВТ_ТаблицаВыдачи.ХарактеристикаНоменклатурыДокумента = ХарактеристикиНоменклатуры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка КАК Комплект,
	|	НоменклатураКомплектующие.Номенклатура КАК Номенклатура,
	|	НоменклатураКомплектующие.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Комплектующие
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|ГДЕ
	|	НоменклатураКомплектующие.Номенклатура.ИспользоватьШтрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСНоменклатурой.Номенклатура.Комплект
	|			ТОГДА ВТ_Комплектующие.Номенклатура
	|		ИНАЧЕ ВТ_ВыдачаСНоменклатурой.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВТ_ВыдачаСНоменклатурой.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСНоменклатурой.Номенклатура.Комплект
	|			ТОГДА ВТ_ВыдачаСНоменклатурой.Количество * ЕСТЬNULL(ВТ_Комплектующие.Количество, 0)
	|		ИНАЧЕ ВТ_ВыдачаСНоменклатурой.Количество
	|	КОНЕЦ КАК Количество,
	|	ВТ_ВыдачаСНоменклатурой.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаСКомплектующими
	|ИЗ
	|	ВТ_ВыдачаСНоменклатурой КАК ВТ_ВыдачаСНоменклатурой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
	|		ПО ВТ_ВыдачаСНоменклатурой.Номенклатура = ВТ_Комплектующие.Комплект
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВыдачаСНоменклатурой.Номенклатура.Комплект
	|				ТОГДА НЕ ВТ_Комплектующие.Номенклатура ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШтрихкодов.Штрихкод КАК Штрихкод,
	|	ТаблицаШтрихкодов.Номенклатура КАК Номенклатура,
	|	ТаблицаШтрихкодов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаШтрихкодов.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаШтрихкодов
	|ИЗ
	|	&ТаблицаШтрихкодов КАК ТаблицаШтрихкодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаШтрихкодов.Штрихкод КАК Штрихкод,
	|	ВТ_ТаблицаШтрихкодов.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаШтрихкодов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаШтрихкодов.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	ВТ_ТаблицаШтрихкодов КАК ВТ_ТаблицаШтрихкодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСКомплектующими.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСКомплектующими.Количество КАК Количество,
	|	ВТ_ВыдачаСКомплектующими.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	ВТ_ВыдачаСКомплектующими КАК ВТ_ВыдачаСКомплектующими
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_ВыдачаСКомплектующими.Номенклатура = ХарактеристикиНоменклатуры.Владелец
	|			И ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры.Метрика = ХарактеристикиНоменклатуры.Метрика
	|ГДЕ
	|	ВТ_ВыдачаСКомплектующими.Номенклатура.ИспользоватьШтрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|ГДЕ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Организация = &Организация
	|	И ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник = &Сотрудник
	|	И ШтрихкодыНоменклатурыДляУчетаЧистки.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод В (&МассивШтрихкодов)";
	
	Запрос.УстановитьПараметр("ТаблицаВыдачи",		ТекущийОбъект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаШтрихкодов",	ТекущийОбъект.ШтрихкодыНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Сотрудник",			ТекущийОбъект.Сотрудник);
	Запрос.УстановитьПараметр("МассивШтрихкодов",	ТекущийОбъект.ШтрихкодыНоменклатуры.ВыгрузитьКолонку("Штрихкод"));
	
	Результат = Запрос.ВыполнитьПакет();
		
	ТаблицаШтрихкодов 		= Результат[5].Выгрузить();
	ТаблицаВыдачи 			= Результат[6].Выгрузить();
	ТаблицаСтарыхШтрихКодов = Результат[7].Выгрузить();
	
	Для Каждого СтрокаТаблицыВыдачи Из ТаблицаВыдачи Цикл
		
		СтруктураПоискаШтрихкодов = Новый Структура("Номенклатура, ДатаВыдачи", СтрокаТаблицыВыдачи.Номенклатура, НачалоДня(ТекущийОбъект.Дата));
		СтруктураПоискаСтарыхШтрихкодов = Новый Структура("Регистратор, Номенклатура, ДатаВыдачи", ТекущийОбъект.Ссылка, СтрокаТаблицыВыдачи.Номенклатура, НачалоДня(ТекущийОбъект.Дата));
		
		НайденныеСтрокиТаблицаШтрихкодов 		= ТаблицаШтрихкодов.НайтиСтроки(СтруктураПоискаШтрихкодов);
		НайденныеСтрокиТаблицаСтарыхШтрихКодов 	= ТаблицаСтарыхШтрихКодов.НайтиСтроки(СтруктураПоискаСтарыхШтрихкодов);
		
		КоличествоШтрихкодов 		= НайденныеСтрокиТаблицаШтрихкодов.Количество();
		КоличествоСтарыхШтрихкодов 	= НайденныеСтрокиТаблицаСтарыхШтрихКодов.Количество();
		ВсегоШтрихкодов 			= КоличествоСтарыхШтрихкодов + КоличествоШтрихкодов;
		
		Если ВсегоШтрихкодов >= СтрокаТаблицыВыдачи.Количество Тогда
			Продолжить;
		КонецЕсли;	
		
		КоличествоЭкземпляровДляШтрихкодов = СтрокаТаблицыВыдачи.Количество - ВсегоШтрихкодов;
		
		Пока КоличествоЭкземпляровДляШтрихкодов > 0 Цикл
			
			НоваяСтрока = ТекущийОбъект.ШтрихкодыНоменклатуры.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыВыдачи);
			
			НоваяСтрока.ДатаВыдачи = НачалоДня(ТекущийОбъект.Дата);
			
			КоличествоЭкземпляровДляШтрихкодов = КоличествоЭкземпляровДляШтрихкодов - 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаполнитьПустыеШтрихкоды(ТекущийОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьПустыеШтрихкоды(ТекущийОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МаксимальноеЗначениеШтрихкода = ТекущийОбъект.Организация.МаксимальноеЗначениеШтрихкода;
	
	Для Каждого СтрокаТаблицыШтрихкодов Из ТекущийОбъект.ШтрихкодыНоменклатуры Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыШтрихкодов.Штрихкод) Тогда
			Продолжить;
		КонецЕсли;	
		
		МаксимальноеЗначениеШтрихкода = МаксимальноеЗначениеШтрихкода + 1;
		
		СтрокаТаблицыШтрихкодов.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатурыДляУчетаЧистки.ПолучитьШтрихкодПоКоду(МаксимальноеЗначениеШтрихкода,"2",ТекущийОбъект.Организация.ПрефиксШтрихкодаНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УточнитьПотребностьПоКоллективнойВыдаче(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано КАК НеВыдано,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыданоПоПричине КАК НеВыданоПоПричине,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_Потребность.НормаВыдачи ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НормыВЫдачиСИЗ.ПустаяСсылка)
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи
	|	КОНЕЦ КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сумма КАК Сумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект КАК Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте КАК КоличествоВКомплекте,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДобавленаКопированием КАК ДобавленаКопированием
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
	|		ПО ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = ВТ_Потребность.Сотрудник
	|			И ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи = ВТ_Потребность.НормаВыдачи
	|			И ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
	|			И (НАЧАЛОПЕРИОДА(ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВТ_Потребность.ДатаПотребности, МЕСЯЦ))
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &ТекущийДокументВыдачи
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано";
	
	Запрос.УстановитьПараметр("ТекущийДокументВыдачи",			ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",					ТекущийОбъект.Организация);
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");	
	
КонецПроцедуры	
	
#КонецЕсли