////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять.
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	//АсТБ_Alexey_********************************************************************
	Разделы.Добавить(Метаданные.Подсистемы.Выдача);
	Разделы.Добавить(Метаданные.Подсистемы.Кадры);
	Разделы.Добавить(Метаданные.Подсистемы.Нормы);
	Разделы.Добавить(Метаданные.Подсистемы.ОбеспечениеСотрудников);
	Разделы.Добавить(Метаданные.Подсистемы.Предприятие);
	Разделы.Добавить(Метаданные.Подсистемы.Склад);
	Разделы.Добавить(Метаданные.Подсистемы.Снабжение);
	Разделы.Добавить(Метаданные.Подсистемы.УчетИПланирование);
	Разделы.Добавить(Метаданные.Подсистемы.Обслуживание);
	//АсТБ_Alexey_********************************************************************
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных отчетов.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять.
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	//АсТБ_Alexey_********************************************************************
	Разделы.Добавить(Метаданные.Подсистемы.Выдача);
	Разделы.Добавить(Метаданные.Подсистемы.Кадры);
	Разделы.Добавить(Метаданные.Подсистемы.Нормы);
	Разделы.Добавить(Метаданные.Подсистемы.ОбеспечениеСотрудников);
	Разделы.Добавить(Метаданные.Подсистемы.Предприятие);
	Разделы.Добавить(Метаданные.Подсистемы.Склад);
	Разделы.Добавить(Метаданные.Подсистемы.Снабжение);
	Разделы.Добавить(Метаданные.Подсистемы.УчетИПланирование);
	Разделы.Добавить(Метаданные.Подсистемы.Обслуживание);
	//АсТБ_Alexey_********************************************************************
	
КонецПроцедуры

#КонецОбласти
