//+++АСТБ_Горюшин_Алексей_17125
Функция ЕстьПредварительнаяПередачаПравСобственности(ДокументВыдачи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализованныеСИЗОбороты.ДокументВыдачи КАК ДокументВыдачи
	|ИЗ
	|	РегистрНакопления.РеализованныеСИЗ.Обороты(, , Запись, ДокументВыдачи = &ДокументВыдачи) КАК РеализованныеСИЗОбороты";

	Запрос.УстановитьПараметр("ДокументВыдачи", ДокументВыдачи);

	Возврат Запрос.Выполнить().Выбрать().Следующий();
	
КонецФункции //---АСТБ_Горюшин_Алексей_17125