
&НаСервере
Функция ОКНаСервере()
	
	ТаблицаДляЗаписи = РеквизитФормыВЗначение("НормыВыдачи");
	
	НаборЗаписей = РегистрыСведений.ИсходныеНормыВыдачиСИЗ.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТаблицыДляЗаписи Из ТаблицаДляЗаписи Цикл
	
		НоваяЗапись 				= НаборЗаписей.Добавить();
		НоваяЗапись.Организация 	= Организация;
		НоваяЗапись.Подразделение	= Подразделение;
		НоваяЗапись.Должность		= Должность;
		НоваяЗапись.РабочееМесто	= РабочееМесто;
		НоваяЗапись.УсловиеНормы	= УсловиеНормы;
		НоваяЗапись.Использовать	= Использовать;
		НоваяЗапись.НормаВыдачи 	= СтрокаТаблицыДляЗаписи.НормаВыдачи;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(Ложь);
	    Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписьПрошлаУспешно = ОКНаСервере();
	
	Если ЗаписьПрошлаУспешно Тогда
		Закрыть(КодВозвратаДиалога.ОК);
	    ОповеститьОВыборе(ЗаписьПрошлаУспешно);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация 		= Параметры.Организация;
	Подразделение 		= Параметры.Подразделение;
	Должность 			= Параметры.Должность;
	РабочееМесто 		= Параметры.РабочееМесто;
	УсловиеНормы 		= Параметры.УсловиеНормы;
	Использовать 		= Параметры.Использовать;
	ТаблицаНормВыдачи 	= ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаТаблицы);
	
	ЗначениеВРеквизитФормы(ТаблицаНормВыдачи,"НормыВыдачи");
	
	ЭтаФорма.Элементы.РабочееМесто.Видимость = Организация.ИспользоватьРабочиеМеста;
	
КонецПроцедуры
