#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("Вес");
	РедактируемыеРеквизиты.Добавить("ВидАнтропометрическогоСвойства");
	РедактируемыеРеквизиты.Добавить("ВидМаркированнойНоменклатуры");
	РедактируемыеРеквизиты.Добавить("ВидСИЗ");
	РедактируемыеРеквизиты.Добавить("ВозможнаАвтоматизированнаяВыдача");
	РедактируемыеРеквизиты.Добавить("ДопустимоеКоличествоЦикловЧистки");
	РедактируемыеРеквизиты.Добавить("ЕдиницаИзмерения");
	РедактируемыеРеквизиты.Добавить("ИспользоватьРост");
	РедактируемыеРеквизиты.Добавить("ИспользоватьШтрихкод");
	РедактируемыеРеквизиты.Добавить("НеИспользоватьВидАнтропометрическогоСвойстваПриАнализе");
	РедактируемыеРеквизиты.Добавить("НеИспользоватьПриФормированииЗаказовПоставщику");
	РедактируемыеРеквизиты.Добавить("Объем");
	РедактируемыеРеквизиты.Добавить("Пол");
	РедактируемыеРеквизиты.Добавить("Поставщик");
	РедактируемыеРеквизиты.Добавить("ПриниматьНаХранение");
	РедактируемыеРеквизиты.Добавить("СтатусСбыта");
	РедактируемыеРеквизиты.Добавить("ПодлежитУтилизации");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//механизм изменен - используется обработка "Печать сертификатов"
	//КомандаПечати 					= КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати 	= "Справочник.СертификатыНоменклатуры";
	//КомандаПечати.Идентификатор 	= "ПечатьСертификата";
	//КомандаПечати.Представление 	= НСтр("ru = 'Печать файлов сертификата'");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("КодСинхронизации");
	Возврат Результат;
	
КонецФункции

Функция ОбязательнаяМаркировка(Номенклатура, ЗНАЧ ДатаАнализа) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура.ВидМаркированнойНоменклатуры) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура.ВидМаркированнойНоменклатуры.ДатаНачалаОбязательнойМаркировки) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаАнализа) Тогда
		ДатаАнализа = ТекущаяДата();
	КонецЕсли;
	
	Если Номенклатура.ВидМаркированнойНоменклатуры.ДатаНачалаОбязательнойМаркировки <= ДатаАнализа Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции	

#КонецЕсли