
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("НоменклатураНормы", ПараметрКоманды);
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		
		ОткрытьФорму("Справочник.НоменклатураНормОрганизации.Форма.УстановленныеНормы",Новый Структура("НоменклатураНормы", ПараметрКоманды),
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
				ПараметрыВыполненияКоманды.Окно);
		
	КонецЕсли;
	
КонецПроцедуры
