
&НаКлиенте
Процедура ОткрытьВидеокурс(Команда)
	
    ОткрытьФорму("ОбщаяФорма.Видеокурс",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеВТехподдержку(Команда)
	

	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеИзменений(Команда)
	
    СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение("https://astb.vostok.ru/news/");
	
КонецПроцедуры


&НаКлиенте
Процедура ПройтиОпрос(Команда)
	
    ОткрытьФорму("ОбщаяФорма.ФормаОпроса",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

