
&НаКлиенте
Процедура КоличествоВПериодеПриИзменении(Элемент)
	
	РассчитатьПриоритет();
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовПриИзменении(Элемент)
	
	РассчитатьПриоритет();
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПериодаПриИзменении(Элемент)
	
	РассчитатьПриоритет();
	СформироватьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПриоритет()
	
	Объект.Приоритет = Справочники.ПериодичностьВыдачиСИЗ.РассчитатьПриоритетПериодичности(Объект);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	
	Объект.Наименование = Справочники.ПериодичностьВыдачиСИЗ.СформироватьНаименованиеПериодичности(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//необходимо проверить приоритет
	Если Объект.Приоритет = 0 Тогда
		Отказ = Истина;
		Сообщить("Неверно заданы параметры периодичности выдачи!");
	Иначе
		НайденныйЭлемент = Справочники.ПериодичностьВыдачиСИЗ.НайтиПоРеквизиту("Приоритет",Объект.Приоритет);
		Если НЕ НайденныйЭлемент.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Уже существует элемент с такими параметрами периодичности выдачи!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РассчитатьПриоритет();
		СформироватьНаименование();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//если есть ссылки, блокируем форму
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		МассивДляПоискаСсылок = Новый Массив;
		МассивДляПоискаСсылок.Добавить(Объект.Ссылка);
		
		УстановитьПривилегированныйРежим(Истина);
		
		ТаблицаСсылок = НайтиПоСсылкам(МассивДляПоискаСсылок);
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ТаблицаСсылок.Количество() > 0 Тогда
			
			ЭтаФорма.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
