
Процедура ПолныйЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("Полный",   Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПолныйЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("Полный",   Источник, Отказ);
	
КонецПроцедуры

Процедура ПолныйЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("Полный",   Источник, Отказ, Замещение);	
	
КонецПроцедуры

Процедура ПолныйЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("Полный",   Источник, Отказ);
	
КонецПроцедуры

Процедура ПолныйЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("Полный",   Источник, Отказ);
	
КонецПроцедуры
