#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция РассчитатьПриоритетПериодичности(ТекущийОбъект) Экспорт
	
	Если ТекущийОбъект.ТипПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		ДополнительныйКоэффициент 	= 12;
		ПоказательТипаПериода 		= 0;
	Иначе
		ДополнительныйКоэффициент 	= 1;		
		ПоказательТипаПериода 		= 1;
	КонецЕсли;
	
	Если ТекущийОбъект.КоличествоПериодов = 0 Тогда
		ПоказательКоличестваПериодов 	= 0;
		ПоказательПериодичности 		= 0;
	Иначе
		ПоказательКоличестваПериодов 	= Окр(1000 / (ТекущийОбъект.КоличествоПериодов * ДополнительныйКоэффициент),0,РежимОкругления.Окр15как20); 
	    ПоказательПериодичности 		= Окр(100000000 * ТекущийОбъект.КоличествоВПериоде / ТекущийОбъект.КоличествоПериодов / ДополнительныйКоэффициент,0,РежимОкругления.Окр15как20);
	КонецЕсли;
	
	Возврат ПоказательПериодичности + ПоказательКоличестваПериодов + ПоказательТипаПериода; 
	
КонецФункции

Функция СформироватьНаименованиеПериодичности(ТекущийОбъект) Экспорт
	
	Возврат ПроцедурыРаботыСНормамиСервер.ПолучитьПредставлениеПериодичностиВыдачи(Перечисления.ВидыРасчетаНорм.Период,ТекущийОбъект.КоличествоВПериоде,ТекущийОбъект.ТипПериода,ТекущийОбъект.КоличествоПериодов);
	
КонецФункции
	
#КонецЕсли