
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Элементы.ДекорацияТОН.Заголовок = "ТОН: " + СтрЗаменить(Объект.Ссылка.ПолноеНаименование(),"/"," --> ");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСоставаНормы(ТекущееУсловие)
	
	//СоставНормы.Отбор.Элементы[0].ПравоеЗначение = ТекущееУсловие;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СоставНормы.Отбор, "Владелец", ТекущееУсловие,ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
	
КонецПроцедуры
