&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение("https://vostokservice.teachbase.ru/");
	
КонецПроцедуры

&НаКлиенте
Процедура НавигационнаяСсылкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение(НавигационнаяСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуферОбмена(Команда)
	
   	Объект = Новый COMОбъект("htmlfile");
   	Объект.ParentWindow.ClipboardData.Setdata("Text", "https://vostokservice.teachbase.ru/");
	
КонецПроцедуры
