
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 
	
	//УстановитьПривилегированныйРежим(Истина);
	
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();// Получаем настройки отчета
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 

	//инициализируем настройки параметров отчета
	//Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаАнализа"));
	//Если не Параметр = Неопределено Тогда
	//	ДатаАнализа = КонецДня(Параметр.Значение.Дата);
	//	Параметр.Использование = Истина;
	//Иначе
	//	Отказ = Истина;
	//КонецЕсли;
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если не Параметр = Неопределено Тогда
		Организация = Параметр.Значение;
		Параметр.Использование = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;

	ИспользованиеФильтраПоПодразделению = Ложь;
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
	Если не Параметр = Неопределено Тогда
		Подразделение = Параметр.Значение;
		ИспользованиеФильтраПоПодразделению = Параметр.Использование;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Поставщик"));
	Если не Параметр = Неопределено Тогда
		Поставщик = Параметр.Значение;
		Параметр.Использование = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Приоритет"));
	Если не Параметр = Неопределено Тогда
		Приоритет = Параметр.Значение;
		Параметр.Использование = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;	

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//инициализируем таблицу подразделений
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ разрешенные
	               |	Подразделения.Ссылка,
	               |	Подразделения.Родитель,
	               |	0 КАК Уровень
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |ГДЕ
	               |	"+?(ИспользованиеФильтраПоПодразделению ,"Подразделения.Ссылка В ИЕРАРХИИ(&СписокПодразделений) И ","")+"
	               |	 Подразделения.Владелец = &Организация
				   |	УПОРЯДОЧИТЬ ПО
				   |		Ссылка ИЕРАРХИЯ УБЫВ";
				   
	Запрос.УстановитьПараметр("СписокПодразделений",Подразделение);
	Запрос.УстановитьПараметр("Организация",Организация);
	ТаблицаПодразделений = Запрос.Выполнить().Выгрузить();
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//инициализируем таблицу норм
	
	ТаблицаНормНулевогоУровня = ПолучитьТаблицуНормПодразделения(ТекущаяДата(),Организация,Справочники.Подразделения.ПустаяСсылка());
	
	ТаблицаНормОрганизации = ПолучитьТаблицуНормПодразделения(ТекущаяДата(),Организация);
	
	ТаблицаНорм = ТаблицаНормНулевогоУровня.Скопировать();
	ТаблицаНорм.Очистить();
	
	Если ТаблицаНормНулевогоУровня.Количество() = 0 Тогда
		НетНормНулевогоУровня = Истина;
	Иначе
		НетНормНулевогоУровня = Ложь;
	КонецЕсли;	
	СтруктураПоиска = Новый Структура;
	
	
	Для каждого СтрокаТаблицыПодразделений Из ТаблицаПодразделений Цикл
		
		ТекущееПодразделение = СтрокаТаблицыПодразделений.Ссылка;
		
		//рекурсионный цикл
		Пока 1=1 Цикл
		
		СтруктураПоиска.Вставить("Подразделение",ТекущееПодразделение);	
		
		//смотрим установлены ли нормы конкретного подразделения
		
		МассивНайденыхНорм = ТаблицаНормОрганизации.НайтиСтроки(СтруктураПоиска);
		
		Если не МассивНайденыхНорм.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(МассивНайденыхНорм, ТаблицаНорм);
			//все заполнено - выход из цикла
			Прервать;
		Иначе
			//проверим, есть ли нормы у родителя
			СтруктураПоиска.Вставить("Подразделение",ТекущееПодразделение.Родитель);
			МассивНайденыхНорм = ТаблицаНорм.НайтиСтроки(СтруктураПоиска);
			Если не МассивНайденыхНорм.Количество() = 0 Тогда
				ДополнитьТаблицу(МассивНайденыхНорм, ТаблицаНорм, ТекущееПодразделение);
				//все заполнено - выход из цикла
				Прервать;
	        КонецЕсли;
		КонецЕсли;	
		
		ТекущееПодразделение = ТекущееПодразделение.Родитель;
		
		Если ЗначениеЗаполнено(ТекущееПодразделение) Тогда
			СтруктураПоиска.Очистить();
			СтруктураПоиска.Вставить("СлужебнаяКолонка",ТекущееПодразделение);
			МассивНайденыхНорм = ТаблицаНорм.НайтиСтроки(СтруктураПоиска);
			СтруктураПоиска.Очистить();
	        Если МассивНайденыхНорм.Количество() = 0 Тогда
				//родитель есть - прыгаем по иерархии вверх
				Продолжить;
			Иначе
				//у родителя норм нет, значит пробежка по иерархии ничего не даст
				НоваяСтрока = ТаблицаНорм.Добавить();
				НоваяСтрока.СлужебнаяКолонка = СтрокаТаблицыПодразделений.Ссылка;
				Прервать;
			КонецЕсли;	
		Иначе
			//Дотопали до корня. проверяем наличие НормНулевогоУровня
			Если НетНормНулевогоУровня Тогда
				//норм по подразделению нет - выход из цикла
				НоваяСтрока = ТаблицаНорм.Добавить();
				НоваяСтрока.СлужебнаяКолонка = СтрокаТаблицыПодразделений.Ссылка;
				Прервать;
			Иначе
				//пробрасываем нормы нулевого уровня
		        ДополнитьТаблицу(ТаблицаНормНулевогоУровня,ТаблицаНорм,СтрокаТаблицыПодразделений.Ссылка);
				Прервать;
			КонецЕсли;
		КонецЕсли;	
		
		КонецЦикла;
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	0 КАК Уровень,
	               |	Подразделения.Ссылка КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) КАК ИерархияПодразделения
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |ГДЕ
	               |	Подразделения.Владелец = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подразделение ИЕРАРХИЯ УБЫВ";
				   
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ТаблицаИерархииПодразделений = Новый ТаблицаЗначений;
	ТаблицаИерархииПодразделений.Колонки.Добавить("Уровень",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0)));
	ТаблицаИерархииПодразделений.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаИерархииПодразделений.Колонки.Добавить("ИерархияПодразделения",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	//СтруктураПоиска = Новый Структура;
	
	СпрПодразделения = Справочники.Подразделения;
	
	Для каждого СтрокаИсходнойТаблицы Из Таблица Цикл
		
		ТекущееПодразделение = СтрокаИсходнойТаблицы.Подразделение;
		УровеньТекущегоПодразделения = ТекущееПодразделение.Уровень();
		
		СтрокаТаблицы = ТаблицаИерархииПодразделений.Добавить();
		
		СтрокаТаблицы.Уровень 				= УровеньТекущегоПодразделения;
		СтрокаТаблицы.Подразделение 		= ТекущееПодразделение;
        СтрокаТаблицы.ИерархияПодразделения = ТекущееПодразделение;
		
		//алгоритм заполнения иерархии ПОДЧИНЕННЫХ подразделений
		ВыборкаПодчиненныхЭлементов = СпрПодразделения.ВыбратьИерархически(ТекущееПодразделение);
		Пока ВыборкаПодчиненныхЭлементов.Следующий() Цикл
			
			СтрокаТаблицы = ТаблицаИерархииПодразделений.Добавить();
			
			ПодчиненноеПодразделение = ВыборкаПодчиненныхЭлементов.Ссылка;
			
			СтрокаТаблицы.Уровень 				= УровеньТекущегоПодразделения;
			СтрокаТаблицы.Подразделение 		= ТекущееПодразделение;
	        СтрокаТаблицы.ИерархияПодразделения = ПодчиненноеПодразделение;
			
		КонецЦикла;	
		
		//алгоритм заполнения иерархии ВВЕРХ (можно определить вышестоящие подразделения)
		//пока не используется
		
		//
		//РодительТекущейСтроки = ТекущееПодразделение.Родитель;
		//
		//СтрокаТаблицы.ИерархияПодразделения = РодительТекущейСтроки;
		//
		//Если ЗначениеЗаполнено(РодительТекущейСтроки) тогда
		//	СтруктураПоиска.Вставить("Подразделение",РодительТекущейСтроки);
		//	МассивСтрок = ТаблицаИерархииПодразделений.НайтиСтроки(СтруктураПоиска);
		//	Для Каждого СтрокаМассива из МассивСтрок Цикл
		//		Если не ЗначениеЗаполнено(СтрокаМассива.ИерархияПодразделения) Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		НоваяСтрока = ТаблицаИерархииПодразделений.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаМассива,,"Уровень,Подразделение");
		//		НоваяСтрока.Уровень = СтрокаТаблицы.Уровень;
		//		НоваяСтрока.Подразделение = СтрокаТаблицы.Подразделение;
		//	КонецЦикла;
		//КонецЕсли		
	КонецЦикла;	
	
	//в общем случае ни 64-х ни 32-х разрядный сервер 1с, не способен переварить соединение более 1 400 000 строк в запросе
	//поэтому соединяем программно
	
	
	Запрос = Новый Запрос;       
	Запрос.УстановитьПараметр("Организация",Организация);
	//Запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Запрос.УстановитьПараметр("ТаблицаИерархииПодразделений",ТаблицаИерархииПодразделений);
	Запрос.УстановитьПараметр("ТаблицаНорм",ТаблицаНорм);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	Запрос.УстановитьПараметр("СписокПодразделений",Подразделение);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаИерархииПодразделений.Уровень,
	               |	ТаблицаИерархииПодразделений.Подразделение КАК Подразделение,
	               |	ТаблицаИерархииПодразделений.ИерархияПодразделения
	               |ПОМЕСТИТЬ ТаблицаИерархииПодразделений
	               |ИЗ
	               |	&ТаблицаИерархииПодразделений КАК ТаблицаИерархииПодразделений
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Подразделение
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ разрешенные
	               |	ТаблицаНорм.Организация,
				   |	ТаблицаНорм.Подразделение,
				   |	ТаблицаНорм.Должность,
				   |	ТаблицаНорм.РабочееМесто,
				   |	ТаблицаНорм.УсловиеНормы,
				   |	ТаблицаНорм.НормаВыдачи,
				   |	ТаблицаНорм.НоменклатураНормы,
				   |	ТаблицаНорм.ЕдиницаИзмерения,
				   |	ТаблицаНорм.ПериодичностьВыдачи,
				   |	ТаблицаНорм.ГОСТ
				  
	               |ПОМЕСТИТЬ "+?(Организация.СверткаПотребностиПоНоменклатуреНормы,"ТаблицаНорм","ТаблицаНорм_хх1х")+"
	               |ИЗ
	               |	&ТаблицаНорм КАК ТаблицаНорм
	               | где
	               |     не ТаблицаНорм.Организация = неопределено
				   |	"+?(ИспользованиеФильтраПоПодразделению ,"И ТаблицаНорм.Подразделение В ИЕРАРХИИ(&СписокПодразделений)","")+"
				   |;
	               |";
				   
				   Если Организация.СверткаПотребностиПоНоменклатуреНормы Тогда
					   
				   //текст запроса корректировки данных по варианту хх1х
				   Запрос.Текст = Запрос.Текст+"
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ 
	               |	ТаблицаНорм.Организация,
				   |	ТаблицаНорм.Подразделение,
				   |	ТаблицаНорм.Должность,
				   //|	ТаблицаНорм.РабочееМесто,
				   //|	ТаблицаНорм.УсловиеНормы,
				   |	ТаблицаНорм.НоменклатураНормы,
				   |	МАКСИМУМ(ТаблицаНорм.ПериодичностьВыдачи.Приоритет) как ПериодичностьВыдачиПриоритет,
				   |	Истина как НормаОптимизирована
				   |					  
	               |ПОМЕСТИТЬ КорректировкаПо_хх1х
	               |ИЗ
	               |	ТаблицаНорм КАК ТаблицаНорм
				   |
				   |	СГРУППИРОВАТЬ ПО
				   |
	               |	ТаблицаНорм.Организация,
				   |	ТаблицаНорм.Подразделение,
				   |	ТаблицаНорм.Должность,
				   //|	ТаблицаНорм.РабочееМесто,
				   //|	ТаблицаНорм.УсловиеНормы,
				   |	ТаблицаНорм.НоменклатураНормы
				   |;
				   |
					|///////////////////////////////////////////////////////////////////////////////
					|
				   |
				   |ВЫБРАТЬ 
	               |	ТаблицаНорм.Организация,
				   |	ТаблицаНорм.Подразделение,
				   |	ТаблицаНорм.Должность,
				   |	ТаблицаНорм.РабочееМесто,
				   |	ТаблицаНорм.УсловиеНормы,
				   |	ТаблицаНорм.НормаВыдачи,
				   |	ТаблицаНорм.НоменклатураНормы,
				   |	ТаблицаНорм.ЕдиницаИзмерения,
				   |	ТаблицаНорм.ПериодичностьВыдачи,
				   |	ТаблицаНорм.ГОСТ
				   |
				   |ПОМЕСТИТЬ ТаблицаНорм_хх1х
				   |ИЗ
				   |	ТаблицаНорм КАК ТаблицаНорм
				   |		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаПо_хх1х КАК КорректировкаПо_хх1х
				   |		ПО ТаблицаНорм.Организация = КорректировкаПо_хх1х.Организация
				   |		и ТаблицаНорм.Подразделение = КорректировкаПо_хх1х.Подразделение
				   |		и ТаблицаНорм.Должность = КорректировкаПо_хх1х.Должность
				   //|		и ТаблицаНорм.РабочееМесто = КорректировкаПо_хх1х.РабочееМесто
				   //|		и ТаблицаНорм.УсловиеНормы = КорректировкаПо_хх1х.УсловиеНормы
				   |		и ТаблицаНорм.НоменклатураНормы = КорректировкаПо_хх1х.НоменклатураНормы
				   |		и ТаблицаНорм.ПериодичностьВыдачи.Приоритет = КорректировкаПо_хх1х.ПериодичностьВыдачиПриоритет
				   |		
				   |		где 
				   |          ЕстьNull(КорректировкаПо_хх1х.НормаОптимизирована,Ложь)
				   |;
				   |";
				   
				   КонецЕсли;
				
				   Запрос.Текст = Запрос.Текст+ "
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНорм.Организация,
				   |	ТаблицаНорм.Подразделение,
				   |	ТаблицаНорм.Должность,
				   |	ТаблицаНорм.НоменклатураНормы как НоменклатураНормыОрганизации
				  
	               |ПОМЕСТИТЬ СокращеннаяТаблицаНорм
	               |ИЗ
	               |	ТаблицаНорм_хх1х КАК ТаблицаНорм
	               |;
	               |

				   
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МВЗПодразделений.Период,
	               |	МВЗПодразделений.Подразделение,
	               |	МВЗПодразделений.МВЗ
	               |ПОМЕСТИТЬ ПолнаяТаблицаМВЗ
	               |ИЗ
	               |	РегистрСведений.МВЗПодразделений КАК МВЗПодразделений
	               |ГДЕ
	               |	МВЗПодразделений.Использовать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолнаяТаблицаМВЗ.Подразделение,
	               |	ПолнаяТаблицаМВЗ.МВЗ
	               |ПОМЕСТИТЬ МВЗ_Подразделений
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(ПолнаяТаблицаМВЗ.Период) КАК Период,
	               |		ПолнаяТаблицаМВЗ.Подразделение КАК Подразделение
	               |	ИЗ
	               |		ПолнаяТаблицаМВЗ КАК ПолнаяТаблицаМВЗ
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПолнаяТаблицаМВЗ.Подразделение) КАК СрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПолнаяТаблицаМВЗ КАК ПолнаяТаблицаМВЗ
	               |		ПО СрезПоследних.Период = ПолнаяТаблицаМВЗ.Период
	               |			И СрезПоследних.Подразделение = ПолнаяТаблицаМВЗ.Подразделение
	               |;
	               |
				   //АСТБ_ALEXEY_71263_**************************************************************
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МВЗДолжностей.Период,
				   |	МВЗДолжностей.Организация,
	               |	МВЗДолжностей.Должность,
	               |	МВЗДолжностей.МВЗ
	               |ПОМЕСТИТЬ ПолнаяТаблицаМВЗДолжностей
	               |ИЗ
	               |	РегистрСведений.МВЗДолжностей КАК МВЗДолжностей
	               |ГДЕ
	               |	МВЗДолжностей.Использовать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ПолнаяТаблицаМВЗДолжностей.Организация,
	               |	ПолнаяТаблицаМВЗДолжностей.Должность,
	               |	ПолнаяТаблицаМВЗДолжностей.МВЗ
	               |ПОМЕСТИТЬ МВЗ_Должностей
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(ПолнаяТаблицаМВЗДолжностей.Период) КАК Период,
				   |		ПолнаяТаблицаМВЗДолжностей.Организация КАК Организация,
	               |		ПолнаяТаблицаМВЗДолжностей.Должность КАК Должность
	               |	ИЗ
	               |		ПолнаяТаблицаМВЗДолжностей КАК ПолнаяТаблицаМВЗДолжностей
	               |	
	               |	СГРУППИРОВАТЬ ПО
				   |		ПолнаяТаблицаМВЗДолжностей.Организация,
	               |		ПолнаяТаблицаМВЗДолжностей.Должность) КАК СрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПолнаяТаблицаМВЗДолжностей КАК ПолнаяТаблицаМВЗДолжностей
	               |		ПО СрезПоследних.Период = ПолнаяТаблицаМВЗДолжностей.Период
	               |			И СрезПоследних.Организация = ПолнаяТаблицаМВЗДолжностей.Организация
				   |			И СрезПоследних.Должность = ПолнаяТаблицаМВЗДолжностей.Должность
	               |;
	               |
				   //АСТБ_ALEXEY_71263_**************************************************************
				   |////////////////////////////////////////////////////////////////////////////////
	               
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |			ШтатноеРасписаниеСрезПоследних.Организация КАК Организация,
	               |			ШтатноеРасписаниеСрезПоследних.Подразделение КАК Подразделение,
	               |			ШтатноеРасписаниеСрезПоследних.Должность КАК Должность,
	               |			ШтатноеРасписаниеСрезПоследних.КоличествоСтавок КАК КоличествоСтавок,
				   //АСТБ_ALEXEY_71263_**************************************************************
	               |			ЕстьNULL(МВЗ_Подразделений.МВЗ,МВЗ_Должностей.МВЗ) КАК МВЗ 
				   //АСТБ_ALEXEY_71263_**************************************************************
				   |ПОМЕСТИТЬ ШтатноеРасписание
	               |		ИЗ
	               |			РегистрСведений.ШтатноеРасписание.СрезПоследних(, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	               |				ЛЕВОЕ СОЕДИНЕНИЕ МВЗ_Подразделений КАК МВЗ_Подразделений
	               |				ПО ШтатноеРасписаниеСрезПоследних.Подразделение = МВЗ_Подразделений.Подразделение
				   //АСТБ_ALEXEY_71263_**************************************************************
				   |				ЛЕВОЕ СОЕДИНЕНИЕ МВЗ_Должностей КАК МВЗ_Должностей
				   |				ПО ШтатноеРасписаниеСрезПоследних.Организация = МВЗ_Должностей.Организация
	               |					И ШтатноеРасписаниеСрезПоследних.Должность = МВЗ_Должностей.Должность
				   //АСТБ_ALEXEY_71263_**************************************************************
	               |		ГДЕ
	               |			ШтатноеРасписаниеСрезПоследних.КоличествоСтавок > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ПолнаяТаблицаМВЗ
	               |;
				   //АСТБ_ALEXEY_71263_**************************************************************
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ПолнаяТаблицаМВЗДолжностей
	               |;
				   //АСТБ_ALEXEY_71263_**************************************************************
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
				   |	ЦеныНоменклатурыСрезПоследних.Цена как Цена
	               |ПОМЕСТИТЬ ТаблицаЦен
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				   |		,
				   |			Поставщик = &Поставщик
				   |			И Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	               |;
				   
				   //формируем таблицу норм, полную с количеством ставок и МВЗ
				   
				   //удаляем таблицу норм, и штатное
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение,
	               |	УровниПодразделений.Уровень,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Должность,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет,
				   |	ЦеныНоменклатуры.Цена
	               |ПОМЕСТИТЬ СоответствияНоменклатурыВыдачи
				   //|ПОМЕСТИТЬ СоответствияНоменклатурыВыдачи_Полная
	               |ИЗ
	               |	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ТаблицаИерархииПодразделений.Уровень КАК Уровень,
	               |			ТаблицаИерархииПодразделений.Подразделение КАК Подразделение
	               |		ИЗ
	               |			ТаблицаИерархииПодразделений КАК ТаблицаИерархииПодразделений) КАК УровниПодразделений
	               |		ПО СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = УровниПодразделений.Подразделение
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ЦеныНоменклатуры
				   |		ПО СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура = ЦеныНоменклатуры.Номенклатура

	               |ГДЕ
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Использовать = ИСТИНА
	               |	И СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |	И СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец = &Организация
	               |;
				   
				   ////собственно СрезПоследних по таблице ПОКА НЕ НУЖЕН!
				   //|
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ
				   //|	СрезПоследних.Подразделение,
				   //|	СоответствияНоменклатурыВыдачи_Полная.Уровень,
				   //|	СрезПоследних.Должность,
				   //|	СрезПоследних.НоменклатураНормыОрганизации,
				   //|	СрезПоследних.Номенклатура,
				   //|	СоответствияНоменклатурыВыдачи_Полная.Приоритет
				   //|ПОМЕСТИТЬ СоответствияНоменклатурыВыдачи
				   //|ИЗ
				   //|	(ВЫБРАТЬ
				   //|		МАКСИМУМ(СоответствияНоменклатурыВыдачи_Полная.Период) КАК Период,
				   //|		СоответствияНоменклатурыВыдачи_Полная.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
				   //|		СоответствияНоменклатурыВыдачи_Полная.Номенклатура КАК Номенклатура,
				   //|		СоответствияНоменклатурыВыдачи_Полная.Подразделение КАК Подразделение,
				   //|		СоответствияНоменклатурыВыдачи_Полная.Должность КАК Должность
				   //|	ИЗ
				   //|		СоответствияНоменклатурыВыдачи_Полная КАК СоответствияНоменклатурыВыдачи_Полная
				   //|	
				   //|	СГРУППИРОВАТЬ ПО
				   //|		СоответствияНоменклатурыВыдачи_Полная.НоменклатураНормыОрганизации,
				   //|		СоответствияНоменклатурыВыдачи_Полная.Номенклатура,
				   //|		СоответствияНоменклатурыВыдачи_Полная.Подразделение,
				   //|		СоответствияНоменклатурыВыдачи_Полная.Должность) КАК СрезПоследних
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствияНоменклатурыВыдачи_Полная КАК СоответствияНоменклатурыВыдачи_Полная
				   //|		ПО СрезПоследних.Период = СоответствияНоменклатурыВыдачи_Полная.Период
				   //|			И СрезПоследних.НоменклатураНормыОрганизации = СоответствияНоменклатурыВыдачи_Полная.НоменклатураНормыОрганизации
				   //|			И СрезПоследних.Номенклатура = СоответствияНоменклатурыВыдачи_Полная.Номенклатура
				   //|			И СрезПоследних.Подразделение = СоответствияНоменклатурыВыдачи_Полная.Подразделение
				   //|			И СрезПоследних.Должность = СоответствияНоменклатурыВыдачи_Полная.Должность	               
				   //|
				   //|;
				   //|
				   //
				   //  |////////////////////////////////////////////////////////////////////////////////
				   //|УНИЧТОЖИТЬ СоответствияНоменклатурыВыдачи_Полная
				   //|;

				   
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновнаяТаблица.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |	ОсновнаяТаблица.Подразделение КАК Подразделение,
	               |	ОсновнаяТаблица.Уровень КАК Уровень,
	               |	ОсновнаяТаблица.Должность КАК Должность,
	               |	ОсновнаяТаблица.Номенклатура КАК Номенклатура,
	               |	ОсновнаяТаблица.Приоритет КАК Приоритет,
				   |	ОсновнаяТаблица.Цена КАК Цена
	               |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_1_Полная
	               |ИЗ
	               |	СоответствияНоменклатурыВыдачи КАК ОсновнаяТаблица
	               |ГДЕ
	               |	НЕ ОсновнаяТаблица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	И НЕ ОсновнаяТаблица.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	               |;
	               |";
				   
				   Если Приоритет = "main" Тогда
					   //вариант запроса если приоритет - основной!
					   Запрос.Текст = Запрос.Текст+"
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВложенныйЗапрос.НоменклатураНормыОрганизации,
					   |	ВложенныйЗапрос.Подразделение,
					   |	ИсходнаяТаблица.Уровень,
					   |	ВложенныйЗапрос.Должность,
					   |	ВложенныйЗапрос.Приоритет,
					   //|	ИсходнаяТаблица.Цена,
					   |	ИсходнаяТаблица.Номенклатура
					   |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_1
					   |ИЗ
					   |	(ВЫБРАТЬ
					   |		ИсходнаяТаблица.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
					   |		ИсходнаяТаблица.Подразделение КАК Подразделение,
					   |		ИсходнаяТаблица.Должность КАК Должность,
					   |		МИНИМУМ(ИсходнаяТаблица.Приоритет) КАК Приоритет
					   |	ИЗ
					   |		ИсходнаяТаблица_Приоритет_1_Полная КАК ИсходнаяТаблица
					   |	
					   |	СГРУППИРОВАТЬ ПО
					   |		ИсходнаяТаблица.НоменклатураНормыОрганизации,
					   |		ИсходнаяТаблица.Должность,
					   |		ИсходнаяТаблица.Подразделение) КАК ВложенныйЗапрос
					   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_1_Полная КАК ИсходнаяТаблица
					   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = ИсходнаяТаблица.НоменклатураНормыОрганизации
					   |			И ВложенныйЗапрос.Подразделение = ИсходнаяТаблица.Подразделение
					   |			И ВложенныйЗапрос.Должность = ИсходнаяТаблица.Должность
					   |			И ВложенныйЗапрос.Приоритет = ИсходнаяТаблица.Приоритет
					   |;
					   |";
					   
				   Иначе
					//вариант запроса если приоритет min или max
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |ВЫБРАТЬ
						   |	СоответствиеЦена.НоменклатураНормыОрганизации,
						   |	СоответствиеЦена.Номенклатура,
						   |	СоответствиеЦена.Подразделение,
						   |	СоответствиеЦена.Должность,
						   |	СоответствиеЦена.Приоритет,
						   |	СоответствиеЦена.Уровень
						   |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_1
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		СоответствиеЦена.Подразделение КАК Подразделение,
						   |		СоответствиеЦена.Должность КАК Должность,
						   |		МИНИМУМ(СоответствиеЦена.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		(ВЫБРАТЬ
						   |			СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |			СоответствиеЦена.Подразделение КАК Подразделение,
						   |			СоответствиеЦена.Должность КАК Должность,
						   |			"+?(Приоритет = "min_","МИНИМУМ(СоответствиеЦена.Цена)","Максимум(СоответствиеЦена.Цена)")+" КАК Цена
						   |		ИЗ
						   |			ИсходнаяТаблица_Приоритет_1_Полная КАК СоответствиеЦена
						   |		
						   |		СГРУППИРОВАТЬ ПО
						   |			СоответствиеЦена.НоменклатураНормыОрганизации,
						   |			СоответствиеЦена.Подразделение,
						   |			СоответствиеЦена.Должность) КАК ВложенныйЗапрос
						   |			ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_1_Полная КАК СоответствиеЦена
						   |			ПО (СоответствиеЦена.НоменклатураНормыОрганизации = ВложенныйЗапрос.НоменклатураНормыОрганизации)
						   |				И (СоответствиеЦена.Подразделение = ВложенныйЗапрос.Подразделение)
						   |				И (СоответствиеЦена.Должность = ВложенныйЗапрос.Должность)
						   |				И (СоответствиеЦена.Цена = ВложенныйЗапрос.Цена)
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		СоответствиеЦена.НоменклатураНормыОрганизации,
						   |		СоответствиеЦена.Подразделение,
						   |		СоответствиеЦена.Должность) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_1_Полная КАК СоответствиеЦена
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = СоответствиеЦена.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Подразделение = СоответствиеЦена.Подразделение
						   |			И ВложенныйЗапрос.Должность = СоответствиеЦена.Должность
						   |			И ВложенныйЗапрос.Приоритет = СоответствиеЦена.Приоритет
						   |
						   |;
						   |";
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст+"					   
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |УНИЧТОЖИТЬ ИсходнаяТаблица_Приоритет_1_Полная
				   |;
				   |
				   
				   |
				   //запрос проброса иерархии подразделений 2 следующих запроса
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.Подразделение,
	               |	ВложенныйЗапрос.Должность,
	               |	ВложенныйЗапрос.НоменклатураНормыОрганизации,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.ДействующийУровеньНормы,
	               |	ВложенныйЗапрос.Приоритет
				   //|	, ВложенныйЗапрос.Цена
	               |ПОМЕСТИТЬ Приоритет_1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаИерархииПодразделений.ИерархияПодразделения КАК Подразделение,
	               |		ИсходнаяТаблица_Приоритет.Должность КАК Должность,
	               |		ИсходнаяТаблица_Приоритет.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |		ИсходнаяТаблица_Приоритет.Номенклатура КАК Номенклатура,
	               |		ИсходнаяТаблица_Приоритет.Уровень КАК ДействующийУровеньНормы,
	               |		ИсходнаяТаблица_Приоритет.Приоритет КАК Приоритет
				   //|		,ИсходнаяТаблица_Приоритет.Цена КАК Цена
	               |	ИЗ
	               |		ТаблицаИерархииПодразделений КАК ТаблицаИерархииПодразделений
	               |			ПОЛНОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_1 КАК ИсходнаяТаблица_Приоритет
	               |			ПО ТаблицаИерархииПодразделений.Подразделение = ИсходнаяТаблица_Приоритет.Подразделение
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ИсходнаяТаблица_Приоритет.Должность,
	               |		ИсходнаяТаблица_Приоритет.НоменклатураНормыОрганизации,
	               |		ИсходнаяТаблица_Приоритет.Номенклатура,
	               |		ИсходнаяТаблица_Приоритет.Уровень,
	               |		ИсходнаяТаблица_Приоритет.Приоритет,
				   //|		ИсходнаяТаблица_Приоритет.Цена,
	               |		ТаблицаИерархииПодразделений.ИерархияПодразделения) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	НЕ ВложенныйЗапрос.НоменклатураНормыОрганизации ЕСТЬ NULL 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИсходнаяТаблица_Приоритет_1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Приоритет_1.Подразделение,
	               |	Приоритет_1.Должность,
	               |	Приоритет_1.НоменклатураНормыОрганизации,
	               |	Приоритет_1.Номенклатура,
	               |	Приоритет_1.Приоритет
				   //|	,Приоритет_1.Цена
	               |ПОМЕСТИТЬ Финальная_Приоритет_1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Приоритет_1.Подразделение КАК Подразделение,
	               |		Приоритет_1.Должность КАК Должность,
	               |		Приоритет_1.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |		МАКСИМУМ(Приоритет_1.ДействующийУровеньНормы) КАК ДействующийУровеньНормы
	               |	ИЗ
	               |		Приоритет_1 КАК Приоритет_1
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Приоритет_1.Подразделение,
	               |		Приоритет_1.Должность,
	               |		Приоритет_1.НоменклатураНормыОрганизации) КАК ТаблицаСвязи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Приоритет_1 КАК Приоритет_1
	               |		ПО ТаблицаСвязи.Подразделение = Приоритет_1.Подразделение
	               |			И ТаблицаСвязи.Должность = Приоритет_1.Должность
	               |			И ТаблицаСвязи.НоменклатураНормыОрганизации = Приоритет_1.НоменклатураНормыОрганизации
	               |			И ТаблицаСвязи.ДействующийУровеньНормы = Приоритет_1.ДействующийУровеньНормы
	               |;
	               |
				   
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Приоритет_1
	               |;
	               |
				   //здесь соединяем с сокращенной таблицей норм!
				   //количество ставок пока не нужно!
				   
				   //это промежуточная таблица с приоритетом 1
				   |////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СокращеннаяТаблицаНорм.Организация,
					|	СокращеннаяТаблицаНорм.Подразделение,
					|	СокращеннаяТаблицаНорм.Должность,
					|	СокращеннаяТаблицаНорм.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
					|	Финальная_Приоритет.Номенклатура,
					|	Финальная_Приоритет.Приоритет
					|ПОМЕСТИТЬ Приоритет_1_Штатное
					|ИЗ
					|	СокращеннаяТаблицаНорм КАК СокращеннаяТаблицаНорм
					|		ЛЕВОЕ СОЕДИНЕНИЕ Финальная_Приоритет_1 КАК Финальная_Приоритет
					|		ПО СокращеннаяТаблицаНорм.НоменклатураНормыОрганизации = Финальная_Приоритет.НоменклатураНормыОрганизации
					|			И СокращеннаяТаблицаНорм.Подразделение = Финальная_Приоритет.Подразделение
					|			И СокращеннаяТаблицаНорм.Должность = Финальная_Приоритет.Должность	               
					|;
					//
					|
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Финальная_Приоритет_1
	               |;
	               |
                   //исходная таблица приоритета 2
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновнаяТаблица.НоменклатураНормыОрганизации,
	               |	ОсновнаяТаблица.Номенклатура,
	               |	ОсновнаяТаблица.Подразделение,
	               |	ОсновнаяТаблица.Уровень,
	               |	ОсновнаяТаблица.Приоритет,
				   |	ОсновнаяТаблица.Цена
	               |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_2_Полная
	               |ИЗ
	               |	СоответствияНоменклатурыВыдачи КАК ОсновнаяТаблица
	               |ГДЕ
	               |	НЕ ОсновнаяТаблица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	И ОсновнаяТаблица.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	               |; ";
				   
				   Если Приоритет = "main" Тогда
					   //вариант запроса если приоритет - основной!
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |////////////////////////////////////////////////////////////////////////////////
						   |ВЫБРАТЬ
						   |	ВложенныйЗапрос.НоменклатураНормыОрганизации,
						   |	ВложенныйЗапрос.Подразделение,
						   |	ВложенныйЗапрос.Уровень,
						   |	ВложенныйЗапрос.Приоритет,
						   |	ИсходнаяТаблица.Номенклатура
						   |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_2
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		ИсходнаяТаблица.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		ИсходнаяТаблица.Подразделение КАК Подразделение,
						   |		ИсходнаяТаблица.Уровень КАК Уровень,
						   |		МИНИМУМ(ИсходнаяТаблица.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		ИсходнаяТаблица_Приоритет_2_Полная КАК ИсходнаяТаблица
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		ИсходнаяТаблица.НоменклатураНормыОрганизации,
						   |		ИсходнаяТаблица.Уровень,
						   |		ИсходнаяТаблица.Подразделение) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_2_Полная КАК ИсходнаяТаблица
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = ИсходнаяТаблица.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Подразделение = ИсходнаяТаблица.Подразделение
						   |			И ВложенныйЗапрос.Приоритет = ИсходнаяТаблица.Приоритет
						   |;
						   |";
				   Иначе
					//вариант запроса если приоритет min или max
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |ВЫБРАТЬ
						   |	СоответствиеЦена.НоменклатураНормыОрганизации,
						   |	СоответствиеЦена.Номенклатура,
						   |	СоответствиеЦена.Подразделение,
						   |    СоответствиеЦена.Уровень,
						   |	СоответствиеЦена.Приоритет
						   //|	СоответствиеЦена.Цена
						   |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_2
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		СоответствиеЦена.Подразделение КАК Подразделение,
						   |		МИНИМУМ(СоответствиеЦена.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		(ВЫБРАТЬ
						   |			СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |			СоответствиеЦена.Подразделение КАК Подразделение,
						   |			"+?(Приоритет = "min_","МИНИМУМ(СоответствиеЦена.Цена)","Максимум(СоответствиеЦена.Цена)")+" КАК Цена
						   |		ИЗ
						   |			ИсходнаяТаблица_Приоритет_2_Полная КАК СоответствиеЦена
						   |		
						   |		СГРУППИРОВАТЬ ПО
						   |			СоответствиеЦена.НоменклатураНормыОрганизации,
						   |			СоответствиеЦена.Подразделение) КАК ВложенныйЗапрос
						   |			ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_2_Полная КАК СоответствиеЦена
						   |			ПО (СоответствиеЦена.НоменклатураНормыОрганизации = ВложенныйЗапрос.НоменклатураНормыОрганизации)
						   |				И (СоответствиеЦена.Подразделение = ВложенныйЗапрос.Подразделение)
						   |				И (СоответствиеЦена.Цена = ВложенныйЗапрос.Цена)
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		СоответствиеЦена.НоменклатураНормыОрганизации,
						   |		СоответствиеЦена.Подразделение) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_2_Полная КАК СоответствиеЦена
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = СоответствиеЦена.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Подразделение = СоответствиеЦена.Подразделение
						   |			И ВложенныйЗапрос.Приоритет = СоответствиеЦена.Приоритет
						   |
						   |;
						   |";
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст+"					   
				   |
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИсходнаяТаблица_Приоритет_2_Полная
	               |;
	               |
				   
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.Подразделение,
	               |	ВложенныйЗапрос.НоменклатураНормыОрганизации,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.ДействующийУровеньНормы,
	               |	ВложенныйЗапрос.Приоритет
	               |ПОМЕСТИТЬ Приоритет_2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаИерархииПодразделений.ИерархияПодразделения КАК Подразделение,
	               |		ИсходнаяТаблица_Приоритет_2.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |		ИсходнаяТаблица_Приоритет_2.Номенклатура КАК Номенклатура,
	               |		ИсходнаяТаблица_Приоритет_2.Уровень КАК ДействующийУровеньНормы,
	               |		ИсходнаяТаблица_Приоритет_2.Приоритет КАК Приоритет
	               |	ИЗ
	               |		ТаблицаИерархииПодразделений КАК ТаблицаИерархииПодразделений
	               |			ПОЛНОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_2 КАК ИсходнаяТаблица_Приоритет_2
	               |			ПО ТаблицаИерархииПодразделений.Подразделение = ИсходнаяТаблица_Приоритет_2.Подразделение
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ИсходнаяТаблица_Приоритет_2.НоменклатураНормыОрганизации,
	               |		ИсходнаяТаблица_Приоритет_2.Номенклатура,
	               |		ИсходнаяТаблица_Приоритет_2.Уровень,
	               |		ИсходнаяТаблица_Приоритет_2.Приоритет,
	               |		ТаблицаИерархииПодразделений.ИерархияПодразделения) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	НЕ ВложенныйЗапрос.НоменклатураНормыОрганизации ЕСТЬ NULL 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИсходнаяТаблица_Приоритет_2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Приоритет_2.Подразделение,
	               |	Приоритет_2.НоменклатураНормыОрганизации,
	               |	Приоритет_2.Номенклатура,
	               |	Приоритет_2.Приоритет
	               |ПОМЕСТИТЬ Финальная_Приоритет_2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Приоритет_2.Подразделение КАК Подразделение,
	               |		Приоритет_2.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |		МАКСИМУМ(Приоритет_2.ДействующийУровеньНормы) КАК ДействующийУровеньНормы
	               |	ИЗ
	               |		Приоритет_2 КАК Приоритет_2
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Приоритет_2.Подразделение,
	               |		Приоритет_2.НоменклатураНормыОрганизации) КАК ТаблицаСвязи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Приоритет_2 КАК Приоритет_2
	               |		ПО ТаблицаСвязи.Подразделение = Приоритет_2.Подразделение
	               |			И ТаблицаСвязи.НоменклатураНормыОрганизации = Приоритет_2.НоменклатураНормыОрганизации
	               |			И ТаблицаСвязи.ДействующийУровеньНормы = Приоритет_2.ДействующийУровеньНормы
	               |;
	               |
				   
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Приоритет_2
	               |;
	               |
				   
				   
				   //это промежуточная таблица с приоритетом 2
				   |////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СокращеннаяТаблицаНорм.Организация,
					|	СокращеннаяТаблицаНорм.Подразделение,
					|	СокращеннаяТаблицаНорм.Должность,
					|	СокращеннаяТаблицаНорм.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
					|	Финальная_Приоритет.Номенклатура,
					|	Финальная_Приоритет.Приоритет
					|ПОМЕСТИТЬ Приоритет_2_Штатное
					|ИЗ
					|	СокращеннаяТаблицаНорм КАК СокращеннаяТаблицаНорм
					|		ЛЕВОЕ СОЕДИНЕНИЕ Финальная_Приоритет_2 КАК Финальная_Приоритет
					|		ПО СокращеннаяТаблицаНорм.НоменклатураНормыОрганизации = Финальная_Приоритет.НоменклатураНормыОрганизации
					|			И СокращеннаяТаблицаНорм.Подразделение = Финальная_Приоритет.Подразделение
					|				               
					|;
					//
					|
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Финальная_Приоритет_2
	               |;
	               |
				   
				   //исходная таблица с приоритетом 1 и 2				   
				   
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ различные
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Организация, Приоритет_2_Штатное.Организация) КАК Организация,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Подразделение, Приоритет_2_Штатное.Подразделение) КАК Подразделение,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Должность, Приоритет_2_Штатное.Должность) КАК Должность,
	               //|	0 КАК КоличествоСтавок,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.НоменклатураНормыОрганизации, Приоритет_2_Штатное.НоменклатураНормыОрганизации) КАК НоменклатураНормыОрганизации,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Номенклатура, Приоритет_2_Штатное.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Приоритет, Приоритет_2_Штатное.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ Приоритет_2_Приоритет_1
	               |ИЗ
	               |	Приоритет_1_Штатное КАК ТаблицаОбщегоПриоритета
	               |		Левое СОЕДИНЕНИЕ Приоритет_2_Штатное КАК Приоритет_2_Штатное
	               |		ПО ТаблицаОбщегоПриоритета.Подразделение = Приоритет_2_Штатное.Подразделение
	               |			И ТаблицаОбщегоПриоритета.Должность = Приоритет_2_Штатное.Должность
	               |			И ТаблицаОбщегоПриоритета.НоменклатураНормыОрганизации = Приоритет_2_Штатное.НоменклатураНормыОрганизации
	               |			И ТаблицаОбщегоПриоритета.Номенклатура ЕСТЬ NULL 
	               |;
	               |
				   
				   //таблица приоритета 3
				   
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновнаяТаблица.НоменклатураНормыОрганизации,
	               |	ОсновнаяТаблица.Номенклатура,
	               |	ОсновнаяТаблица.Должность,
	               |	ОсновнаяТаблица.Приоритет,
				   |	ОсновнаяТаблица.Цена
	               |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_3_Полная
	               |ИЗ
	               |	СоответствияНоменклатурыВыдачи КАК ОсновнаяТаблица
	               |ГДЕ
	               |	ОсновнаяТаблица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	И НЕ ОсновнаяТаблица.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	               |;
	               |
				   |";
				   
				   Если Приоритет = "main" Тогда
					   //вариант запроса если приоритет - основной!
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |////////////////////////////////////////////////////////////////////////////////
						   |ВЫБРАТЬ
						   |	ВложенныйЗапрос.НоменклатураНормыОрганизации,
						   |	ВложенныйЗапрос.Должность,
						   |	ВложенныйЗапрос.Приоритет,
						   |	ИсходнаяТаблица.Номенклатура
						   |ПОМЕСТИТЬ Финальная_Приоритет_3
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		ИсходнаяТаблица.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		ИсходнаяТаблица.Должность КАК Должность,
						   |		МИНИМУМ(ИсходнаяТаблица.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		ИсходнаяТаблица_Приоритет_3_Полная КАК ИсходнаяТаблица
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		ИсходнаяТаблица.НоменклатураНормыОрганизации,
						   |		ИсходнаяТаблица.Должность
						   |		) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_3_Полная КАК ИсходнаяТаблица
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = ИсходнаяТаблица.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Должность = ИсходнаяТаблица.Должность
						   |			И ВложенныйЗапрос.Приоритет = ИсходнаяТаблица.Приоритет
						   |;
						   |";
				   Иначе
					//вариант запроса если приоритет min или max
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |ВЫБРАТЬ
						   |	СоответствиеЦена.НоменклатураНормыОрганизации,
						   |	СоответствиеЦена.Номенклатура,
						   |	СоответствиеЦена.Должность,
						   //|    СоответствиеЦена.Уровень,
						   |	СоответствиеЦена.Приоритет
						   //|	СоответствиеЦена.Цена
						   |ПОМЕСТИТЬ Финальная_Приоритет_3
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		СоответствиеЦена.Должность КАК Должность,
						   |		МИНИМУМ(СоответствиеЦена.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		(ВЫБРАТЬ
						   |			СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |			СоответствиеЦена.Должность КАК Должность,
						   |			"+?(Приоритет = "min","МИНИМУМ(СоответствиеЦена.Цена)","Максимум(СоответствиеЦена.Цена)")+" КАК Цена
						   |		ИЗ
						   |			ИсходнаяТаблица_Приоритет_3_Полная КАК СоответствиеЦена
						   |		
						   |		СГРУППИРОВАТЬ ПО
						   |			СоответствиеЦена.НоменклатураНормыОрганизации,
						   |			СоответствиеЦена.Должность) КАК ВложенныйЗапрос
						   |			ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_3_Полная КАК СоответствиеЦена
						   |			ПО (СоответствиеЦена.НоменклатураНормыОрганизации = ВложенныйЗапрос.НоменклатураНормыОрганизации)
						   |				И (СоответствиеЦена.Должность = ВложенныйЗапрос.Должность)
						   |				И (СоответствиеЦена.Цена = ВложенныйЗапрос.Цена)
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		СоответствиеЦена.НоменклатураНормыОрганизации,
						   |		СоответствиеЦена.Должность) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_3_Полная КАК СоответствиеЦена
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = СоответствиеЦена.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Должность = СоответствиеЦена.Должность
						   |			И ВложенныйЗапрос.Приоритет = СоответствиеЦена.Приоритет
						   |
						   |;
						   |";
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст+"					   
				   |
				   
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИсходнаяТаблица_Приоритет_3_Полная
	               |;
	               |
				   
				   //исходная таблица с приоритетом 1, 2, 3				   
				   
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ различные
	               |	ТаблицаОбщегоПриоритета.Организация КАК Организация,
	               |	ТаблицаОбщегоПриоритета.Подразделение КАК Подразделение,
	               |	ТаблицаОбщегоПриоритета.Должность КАК Должность,
	               //|	0 КАК КоличествоСтавок,
	               |	ТаблицаОбщегоПриоритета.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Номенклатура, Приоритет_3.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Приоритет, Приоритет_3.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ Приоритет_3_Приоритет_2_Приоритет_1
	               |ИЗ
	               |	Приоритет_2_Приоритет_1 КАК ТаблицаОбщегоПриоритета
	               |		Левое СОЕДИНЕНИЕ Финальная_Приоритет_3 КАК Приоритет_3
	               |		ПО  ТаблицаОбщегоПриоритета.Должность = Приоритет_3.Должность
	               |			И ТаблицаОбщегоПриоритета.НоменклатураНормыОрганизации = Приоритет_3.НоменклатураНормыОрганизации
	               |			И ТаблицаОбщегоПриоритета.Номенклатура ЕСТЬ NULL 
	               |;
	               |
				   
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Приоритет_2_Приоритет_1
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Финальная_Приоритет_3
	               |;
	               |
				   
				   
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               //;

				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновнаяТаблица.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |	ОсновнаяТаблица.Номенклатура КАК Номенклатура,
	               |	ОсновнаяТаблица.Приоритет КАК Приоритет,
				   |	ОсновнаяТаблица.Цена КАК Цена
	               |ПОМЕСТИТЬ ИсходнаяТаблица_Приоритет_4_Полная
	               |ИЗ
	               |	СоответствияНоменклатурыВыдачи КАК ОсновнаяТаблица
	               |ГДЕ
	               |	ОсновнаяТаблица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	И ОсновнаяТаблица.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	               |;
	               |
				   |";
				   
				   Если Приоритет = "main" Тогда
					   //вариант запроса если приоритет - основной!
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |////////////////////////////////////////////////////////////////////////////////
		 				   |ВЫБРАТЬ
						   |	ВложенныйЗапрос.НоменклатураНормыОрганизации,
						   |	ВложенныйЗапрос.Приоритет,
						   |	ИсходнаяТаблица.Номенклатура
						   |ПОМЕСТИТЬ Финальная_Приоритет_4
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		ИсходнаяТаблица.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		МИНИМУМ(ИсходнаяТаблица.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		ИсходнаяТаблица_Приоритет_4_Полная КАК ИсходнаяТаблица
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		ИсходнаяТаблица.НоменклатураНормыОрганизации
						   |		) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_4_Полная КАК ИсходнаяТаблица
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = ИсходнаяТаблица.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Приоритет = ИсходнаяТаблица.Приоритет
						   |;
						   |
						   |";
				   Иначе
					//вариант запроса если приоритет min или max
					   Запрос.Текст = Запрос.Текст+"
						   |
						   |ВЫБРАТЬ
						   |	СоответствиеЦена.НоменклатураНормыОрганизации,
						   |	СоответствиеЦена.Номенклатура,
						   |	СоответствиеЦена.Приоритет
						   //|	СоответствиеЦена.Цена
						   |ПОМЕСТИТЬ Финальная_Приоритет_4
						   |ИЗ
						   |	(ВЫБРАТЬ
						   |		СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |		МИНИМУМ(СоответствиеЦена.Приоритет) КАК Приоритет
						   |	ИЗ
						   |		(ВЫБРАТЬ
						   |			СоответствиеЦена.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
						   |			"+?(Приоритет = "min_","МИНИМУМ(СоответствиеЦена.Цена)","Максимум(СоответствиеЦена.Цена)")+" КАК Цена
						   |		ИЗ
						   |			ИсходнаяТаблица_Приоритет_4_Полная КАК СоответствиеЦена
						   |		
						   |		СГРУППИРОВАТЬ ПО
						   |			СоответствиеЦена.НоменклатураНормыОрганизации) КАК ВложенныйЗапрос
						   |			ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_4_Полная КАК СоответствиеЦена
						   |			ПО (СоответствиеЦена.НоменклатураНормыОрганизации = ВложенныйЗапрос.НоменклатураНормыОрганизации)
						   |				И (СоответствиеЦена.Цена = ВложенныйЗапрос.Цена)
						   |	
						   |	СГРУППИРОВАТЬ ПО
						   |		СоответствиеЦена.НоменклатураНормыОрганизации) КАК ВложенныйЗапрос
						   |		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица_Приоритет_4_Полная КАК СоответствиеЦена
						   |		ПО ВложенныйЗапрос.НоменклатураНормыОрганизации = СоответствиеЦена.НоменклатураНормыОрганизации
						   |			И ВложенныйЗапрос.Приоритет = СоответствиеЦена.Приоритет
						   |
						   |;
						   |";
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст+"					   
				   |
			   
				   
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИсходнаяТаблица_Приоритет_4_Полная
	               |;
	               |
				   
				   //исходная таблица с приоритетом 1, 2, 3, 4				   
				   
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ различные
	               |	ТаблицаОбщегоПриоритета.Организация КАК Организация,
	               |	ТаблицаОбщегоПриоритета.Подразделение КАК Подразделение,
	               |	ТаблицаОбщегоПриоритета.Должность КАК Должность,
	               |	ТаблицаОбщегоПриоритета.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Номенклатура, Приоритет_4.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ТаблицаОбщегоПриоритета.Приоритет, Приоритет_4.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ Приоритет_4_Приоритет_3_Приоритет_2_Приоритет_1
	               |ИЗ
	               |	Приоритет_3_Приоритет_2_Приоритет_1 КАК ТаблицаОбщегоПриоритета
	               |		Левое СОЕДИНЕНИЕ Финальная_Приоритет_4 КАК Приоритет_4
	               |		ПО  ТаблицаОбщегоПриоритета.Номенклатура ЕСТЬ NULL
	               |			И ТаблицаОбщегоПриоритета.НоменклатураНормыОрганизации = Приоритет_4.НоменклатураНормыОрганизации
	               |			  
	               |;
	               |
				   
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Приоритет_3_Приоритет_2_Приоритет_1
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Финальная_Приоритет_4
				   |;
				   |
				   
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	НормыПриоритет.Организация,
				   |	НормыПриоритет.Подразделение,
				   |	МВЗ_Подразделений.МВЗ,
				   |	НормыПриоритет.Должность,
				   |	НормыПриоритет.НоменклатураНормыОрганизации,
				   |	НормыПриоритет.Номенклатура,
				   |	НормыПриоритет.Приоритет,
				   |	ЕстьNull(ЦеныНоменклатуры.Цена,0) как Цена,
				   |	ТаблицаНорм.НормаВыдачи,
				   |	ТаблицаНорм.УсловиеНормы,
				   |	ТаблицаНорм.ЕдиницаИзмерения,
				   |	ТаблицаНорм.ПериодичностьВыдачи,
				   |	ТаблицаНорм.ГОСТ,
				   |	Штатное.КоличествоСтавок как КоличествоСтавок,
				   |    Периодичность.КоличествоНаМесяц как КоличествоНаМесяц
				   |
				   |ИЗ
				   |	Приоритет_4_Приоритет_3_Приоритет_2_Приоритет_1 КАК НормыПриоритет
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНорм_хх1х КАК ТаблицаНорм
				   |		ПО НормыПриоритет.Подразделение = ТаблицаНорм.Подразделение
				   |			И НормыПриоритет.Должность = ТаблицаНорм.Должность
				   |			И НормыПриоритет.НоменклатураНормыОрганизации = ТаблицаНорм.НоменклатураНормы
				   |		ЛЕВОЕ СОЕДИНЕНИЕ МВЗ_Подразделений КАК МВЗ_Подразделений
				   |		ПО НормыПриоритет.Подразделение = МВЗ_Подразделений.Подразделение				   
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ЦеныНоменклатуры
				   |		ПО НормыПриоритет.Номенклатура = ЦеныНоменклатуры.Номенклатура
				   |	Левое Соединение ШтатноеРасписание как Штатное
				   |		ПО НормыПриоритет.Подразделение = Штатное.Подразделение
				   |			И НормыПриоритет.Должность = Штатное.Должность
				   | Левое Соединение
				   |(ВЫБРАТЬ
				   |	ПериодичностьВыдачиСИЗ.Ссылка КАК ПериодичностьВыдачи,
				   |	ВЫБОР
				   //+++АСТБ_Горюшин_Алексей_54520
				   |        КОГДА ПериодичностьВыдачиСИЗ.КоличествоПериодов ЕСТЬ NULL ИЛИ ПериодичностьВыдачиСИЗ.КоличествоПериодов = 0
				   |     	  	ТОГДА -1
				   //---АСТБ_Горюшин_Алексей_54520
				   |		КОГДА ПериодичностьВыдачиСИЗ.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
				   |			ТОГДА ПериодичностьВыдачиСИЗ.КоличествоВПериоде / (ПериодичностьВыдачиСИЗ.КоличествоПериодов * 12)
				   |		КОГДА ПериодичностьВыдачиСИЗ.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Месяц)
				   |			ТОГДА ПериодичностьВыдачиСИЗ.КоличествоВПериоде / ПериодичностьВыдачиСИЗ.КоличествоПериодов
				   |		ИНАЧЕ -1
				   |	КОНЕЦ КАК КоличествоНаМесяц
				   |
				   |ИЗ
				   |	Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ) как Периодичность
				   |по 	ТаблицаНорм.ПериодичностьВыдачи = Периодичность.ПериодичностьВыдачи			   
				   |
				   |;
				   |";

					
	СлужебнаяТаблица = Запрос.Выполнить().Выгрузить();				
	
	//+++АСТБ_Горюшин_Алексей_54520
	ДобавлениеУточненныхОснованийНорм(СлужебнаяТаблица);
	//---АСТБ_Горюшин_Алексей_54520
	
	НаборыВнешнихДанных = Новый Структура;
	НаборыВнешнихДанных.Вставить("ТаблицаЦен",СлужебнаяТаблица);
	
	//Инициализировать(<Макет>, <ВнешниеНаборыДанных>, <ДанныеРасшифровки>, <ВозможностьИспользованияВнешнихФункций>) 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,НаборыВнешнихДанных , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	
КонецПроцедуры

Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник, Подразделение) 
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточник);
		СтрокаТаблицыПриемника.Подразделение = Подразделение;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуНормПодразделения(ДатаАнализа,Организация,Подразделение = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ разрешенные
				   |	ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) как СлужебнаяКолонка,
	               |	УстановленныеНормыВыдачиСИЗСрезПоследних.Организация,
	               |	УстановленныеНормыВыдачиСИЗСрезПоследних.Подразделение,
	               |	УстановленныеНормыВыдачиСИЗСрезПоследних.Должность,
	               |	УстановленныеНормыВыдачиСИЗСрезПоследних.РабочееМесто,
	               |	УстановленныеНормыВыдачиСИЗСрезПоследних.УсловиеНормы,
	               |	УстановленныеНормыВыдачиСИЗСрезПоследних.НормаВыдачи,
	               |	НормыВыдачиСИЗСоставНормы.НоменклатураНормы,
	               |	НормыВыдачиСИЗСоставНормы.ЕдиницаИзмерения,
	               |	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи,
	               |	НормыВыдачиСИЗСоставНормы.ГОСТ
	               |ИЗ
	               |	РегистрСведений.УстановленныеНормыВыдачиСИЗ.СрезПоследних( ,
//	               |			,&ДатаАнализа
	               |			Организация = &Организация
	               |				"+?(не Подразделение = Неопределено,"И Подразделение = &Подразделение","")+") КАК УстановленныеНормыВыдачиСИЗСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	               |		ПО УстановленныеНормыВыдачиСИЗСрезПоследних.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
				   |	ГДЕ
				   |		УстановленныеНормыВыдачиСИЗСрезПоследних.Использовать = ИСТИНА";
				   
//	Запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	


//небольшой хелп
//приоритет записей регистра СоответствияНоменклатурыВыдачи
//	приоритет	подразделение	должность
//		4			н				н
//		3			н				з
//		2			з				н
//		1			з				з
//	4 - низкий; 1 - высокий
//	н - значение не задано
//	з - значение установлено
//дополнительно функция возвращает 5-й вариант таблицы где
// который соответствует варианту НЕ 4 в одной таблице

Функция ПолучитьТаблицуСоответствийНоменклатуры(ДатаАнализа,Организация,Приоритет)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ различные
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Должность,
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет
	               |ПОМЕСТИТЬ ТаблицаСоответствий
	               |ИЗ
	               |	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(&ДатаАнализа,";
		   Если Приоритет = 4 Тогда
				Запрос.Текст = Запрос.Текст +"
				   |	Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка) и Должность = Значение(Справочник.ДолжностиИПрофессии.ПустаяСсылка)";
		   ИначеЕсли Приоритет = 1 Тогда
				Запрос.Текст = Запрос.Текст +"
				   |	не Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка) и не Должность = Значение(Справочник.ДолжностиИПрофессии.ПустаяСсылка)";
		   ИначеЕсли Приоритет = 2 Тогда
				Запрос.Текст = Запрос.Текст +"
				   |	не Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка) и Должность = Значение(Справочник.ДолжностиИПрофессии.ПустаяСсылка)";
		   ИначеЕсли Приоритет = 1 Тогда
				Запрос.Текст = Запрос.Текст +"
				   |	Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка) и не Должность = Значение(Справочник.ДолжностиИПрофессии.ПустаяСсылка)";
		   ИначеЕсли Приоритет = 5 Тогда
				Запрос.Текст = Запрос.Текст +"
				   |	не (Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка) и Должность = Значение(Справочник.ДолжностиИПрофессии.ПустаяСсылка))"; 
		   Иначе
				Возврат Новый ТаблицаЗначений;   
		   КонецЕсли;	   
				Запрос.Текст = Запрос.Текст +"
				   |	 ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	               |ГДЕ
	               |	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец = &Организация
	               |	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСоответствий.НоменклатураНормыОрганизации,
	               |	ТаблицаСоответствий.Номенклатура,
	               |	ТаблицаСоответствий.Подразделение,
	               |	ТаблицаСоответствий.Должность,
	               |	ТаблицаСоответствий.Приоритет как ПриоритетСоответствия,
	               |	СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
				   |	0 как приоритет
	               |ИЗ
	               |	ТаблицаСоответствий КАК ТаблицаСоответствий,
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаАнализа, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСоответствий.НоменклатураНормыОрганизации,
	               |	ТаблицаСоответствий.Номенклатура,
	               |	ТаблицаСоответствий.Подразделение,
	               |	ТаблицаСоответствий.Должность,
	               |	ТаблицаСоответствий.ПриоритетСоответствия,
				   |	ТаблицаСоответствий.Приоритет";
				   
				  // 
	Запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//+++АСТБ_Горюшин_Алексей_54520
Процедура ДобавлениеУточненныхОснованийНорм(ТаблицаНорм)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНорм.Организация КАК Организация,
	|	ТаблицаНорм.Подразделение КАК Подразделение,
	|	ТаблицаНорм.МВЗ КАК МВЗ,
	|	ТаблицаНорм.Должность КАК Должность,
	|	ТаблицаНорм.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ТаблицаНорм.Номенклатура КАК Номенклатура,
	|	ТаблицаНорм.Приоритет КАК Приоритет,
	|	ТаблицаНорм.Цена КАК Цена,
	|	ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	|	ТаблицаНорм.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаНорм.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ТаблицаНорм.ГОСТ КАК ГОСТ,
	|	ТаблицаНорм.КоличествоСтавок КАК КоличествоСтавок,
	|	ТаблицаНорм.КоличествоНаМесяц КАК КоличествоНаМесяц
	|ПОМЕСТИТЬ ВТ_ТаблицаНорм
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	НЕ УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	НЕ УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНорм.Организация КАК Организация,
	|	ВТ_ТаблицаНорм.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаНорм.МВЗ КАК МВЗ,
	|	ВТ_ТаблицаНорм.Должность КАК Должность,
	|	ВТ_ТаблицаНорм.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ТаблицаНорм.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаНорм.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаНорм.Цена КАК Цена,
	|	ВТ_ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	|	ВТ_ТаблицаНорм.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ТаблицаНорм.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаНорм.ГОСТ КАК ГОСТ,
	|	ВТ_ТаблицаНорм.КоличествоСтавок КАК КоличествоСтавок,
	|	ВТ_ТаблицаНорм.КоличествоНаМесяц КАК КоличествоНаМесяц,
	|	ВЫБОР
	|		КОГДА ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА """"
	|											ИНАЧЕ ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Основание
	|	КОНЕЦ КАК Основание
	|ИЗ
	|	ВТ_ТаблицаНорм КАК ВТ_ТаблицаНорм
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Организация
	|			И ВТ_ТаблицаНорм.Подразделение = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Должность = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Организация
	|			И ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Должность = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Организация
	|			И ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Подразделение = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Организация
	|			И ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи";
	
	Запрос.УстановитьПараметр("ТаблицаНорм", ТаблицаНорм);
	
	ТаблицаНорм = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_54520
