

//Процедура выводит оповещение пользователю об ошибках
//в активное окно
Процедура ВывестиОповещениеТекущемуПользователю() Экспорт
	
	МассивСообщений = Интеграция_САП_Сервер.ПолучитьСообщенияНаСервере();
	
	Для Каждого СообщениеПользователю Из МассивСообщений Цикл
		
		СообщениеПользователю.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры	

//рабочая. точка входа
Процедура ПроверкаНаличияОповещенийПользователю() Экспорт
	
	СтруктураДанныхСообщения = Интеграция_САП_Сервер.ПолучитьСообщенияНаСервере();
	
	Если СтруктураДанныхСообщения = Неопределено Тогда
		//Сообщений Нет - однократно вызываем проверку сообщений
		ПодключитьОбработчикОжидания("ПроверкаНаличияОповещенийПользователю",600,Истина);
				
	Иначе
		//Сообщение есть - выводим
		ПоказатьОповещениеПользователя(СтруктураДанныхСообщения.Заголовок,СтруктураДанныхСообщения.НавигационнаяСсылка,СтруктураДанныхСообщения.ТекстСообщения,БиблиотекаКартинок[СтруктураДанныхСообщения.ИдентификаторИконки]);

		//Подключаем обработчик проверки новых сообщений
		ПодключитьОбработчикОжидания("ПроверкаНаличияОповещенийПользователю",10,Истина);
		
	КонецЕсли;
	
КонецПроцедуры	