&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
КонецПроцедуры

&НаСервере
Процедура ПоТекущимДаннымНаСервере()
	
	Документы.УстановкаФККОНоменклатуры.ЗаполнитьТаблицуДокумента(Истина,Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоТекущимДанным(Команда)
	
	ПоТекущимДаннымНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоОтсутствующимДаннымНаСервере()
	
	Документы.УстановкаФККОНоменклатуры.ЗаполнитьТаблицуДокумента(Ложь,Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоОтсутствующимДанным(Команда)
	
	ПоОтсутствующимДаннымНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",Новый Структура("СписокНоменклатуры, ПодлежитУтилизации", ПолучитьМассивНоменклатурыНаСервере(), Истина),Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивНоменклатурыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ПодлежитУтилизации";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапроса.ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ИзменитьИспользование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ИзменитьИспользование(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИспользование(Значение)
	
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		
		СтрокаТаблицы.Использовать = Значение;
		
	КонецЦикла;	
	
	Модифицированность = Истина;
	
КонецПроцедуры