#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ПереходПраваСобственности.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ЗапасыСерверПереопределяемый.ОтразитьСобственныеСИЗ(ДополнительныеСвойства, Движения, Отказ);
	//+++АСТБ_Горюшин_Алексей_17125
	Если Ссылка.Организация.ПереходПраваСобственностиПоПредварительнойЗаявкеППС
		И ЗначениеЗаполнено(Ссылка.ДокументОснование)
		Тогда 
		ЗапасыСерверПереопределяемый.ОтразитьРеализованныеСИЗ(ДополнительныеСвойства, Движения, Отказ);
	ИначеЕсли Ссылка.Организация.ПереходПраваСобственностиПоПредварительнойЗаявкеППС
		И НЕ ЗначениеЗаполнено(Ссылка.ДокументОснование)	
		Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено проведение документа без заполненного документа-основания. Документ должен быть создан на основании документа ""Предварительный переход права собственности"".");
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_17125	
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры
	
Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	// Контроль выполняется при проведении\отмене проведения не нового документа.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Если НЕ Склад.РазрешитьОтрицательныеОстатки Тогда 
		//	Массив.Добавить(Движения.ОстаткиНоменклатуры);
		//КонецЕсли;
		
		//+++АСТБ_Горюшин_Алексей_17125
		Массив.Добавить(Движения.РеализованныеСИЗ);
		//---АСТБ_Горюшин_Алексей_17125

	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли