
&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	
	ОбменДаннымиВендинг.ВендингВыполнитьПервоначальнуюРегистрацию(Узел);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	
	ЗарегистрироватьИзмененияНаСервере(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредопределенныйУзел(Узел)
	
	Возврат Узел = ПланыОбмена.Вендинг.ЭтотУзел();	
	
КонецФункции	

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ПредопределенныйУзел(Элемент.ТекущаяСтрока) Тогда
		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Ложь;
	Иначе
		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

