
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Документы.ВыполненныеРаботыПоРемонту.ЗаполнитьТаблицуДокумента(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.НачалоПериода 	= НачалоМесяца(НачалоМесяца(ТекущаяДата()) - 1);
	    Объект.КонецПериода 	= КонецМесяца(Объект.НачалоПериода);
	КонецЕсли;
	
	ПериодВыдачи.ДатаНачала 	= Объект.НачалоПериода;
	ПериодВыдачи.ДатаОкончания 	= Объект.КонецПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыдачиПриИзменении(Элемент)
	
	Объект.Документы.Очистить();
	
	Объект.НачалоПериода	= ПериодВыдачи.ДатаНачала;
	Объект.КонецПериода 	= ПериодВыдачи.ДатаОкончания;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Документы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.Документы.Очистить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "ПЕЧАТЬ"

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
  	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
  
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать
