#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	// Вызывается непосредственно до записи объекта в базу данных.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПунктыТОН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПунктыТОН КАК ПунктыТОН
	|ГДЕ
	|	ПунктыТОН.Владелец = &Владелец
	|	И ПунктыТОН.Наименование = &Наименование
	|	И НЕ ПунктыТОН.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", 		Владелец);
	Запрос.УстановитьПараметр("Наименование",	Наименование); 
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Пункт ТОН с таким наименованием уже существует.";
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры	
	
#КонецЕсли