
&НаКлиенте
Процедура ВыполнитьСписание(Команда)
	
	ВыполнитьСписаниеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСписаниеНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.СформироватьДокументыСписанияСИЗ(ТекущийОбъект);
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьСписокСотрудников(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСотрудников(Команда)
	
	ЗаполнитьСписокСотрудниковНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСотрудниковНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьСписокСотрудников(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Объект.СписокСотрудников.Очистить();
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАнализаПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВыдачиСИЗПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаАнализа 		= ТекущаяДата();
	Объект.ВидВыдачиСИЗ 	= Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача;
	Объект.ПричинаСписания 	= Перечисления.ПричиныСписания.ОкончаниеСрокаНоски;
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	ЗаполнитьТаблицуНоменклатурыНаСервере();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаСписанияПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
	Если НЕ Объект.ПричинаСписания = ПредопределенноеЗначение("Перечисление.ПричиныСписания.Увольнение")
		И Объект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача") Тогда
		Объект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача");
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ПричинаСписания = Перечисления.ПричиныСписания.Увольнение ИЛИ Объект.ПричинаСписания = Перечисления.ПричиныСписания.ТехническоеСписание Тогда
		Элементы.ВидВыдачиСИЗ1.Видимость 	= Истина;
		Элементы.ВидВыдачиСИЗ.Видимость 	= Ложь;
	Иначе
		Элементы.ВидВыдачиСИЗ1.Видимость 	= Ложь;
		Элементы.ВидВыдачиСИЗ.Видимость 	= Истина;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьТаблицуНормВыдачи(ТекущийОбъект); 
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьТаблицуНоменклатурыНорм(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");  
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьТаблицуНоменклатуры(ТекущийОбъект); 
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");  
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлажкиНаСервере(ЗначениеФлажка,ИмяТаблицы)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Таблица = ТекущийОбъект[ИмяТаблицы].ВЫгрузить();
	Таблица.ЗаполнитьЗначения(ЗначениеФлажка,"Использовать");
	ТекущийОбъект[ИмяТаблицы].Загрузить(Таблица);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"СписокСотрудников");
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"СписокСотрудников");
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"ТаблицаНормВыдачи");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"ТаблицаНормВыдачи");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНормУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"ТаблицаНоменклатурыНорм");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНормСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"ТаблицаНоменклатурыНорм");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"ТаблицаНоменклатуры");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"ТаблицаНоменклатуры");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры
