////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Виды доступа Пользователи и ВнешниеПользователи уже заполнены.
// Их можно удалить, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	//АСТБ_ALEX_**************************************************************
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Склады";
	ВидДоступа.Представление = НСтр("ru = 'Склады'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Склады");
	//АСТБ_ALEX_**************************************************************
	
	//АСТБ_ALEXEY_**************************************************************
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	//АСТБ_ALEXEY_**************************************************************
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - массив структур, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - структура со свойствами:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	//АСТБ_ALEX_**************************************************************	
	
	// Описание для заполнения профиля "Полные права".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 	= "a627ff7d-bd3a-11e2-8e54-e0699515036f";
	ОписаниеПрофиля.Наименование  	= "Полные права доступа";
	ОписаниеПрофиля.Описание 		= НСтр("ru = 'Полные права доступа.'");
	ОписаниеПрофиля.Роли.Добавить("ПолныеПрава");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Работа с торговым оборудованием".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 	= "a627ff7d-bd3a-14e2-8e54-e0699515036f";
	ОписаниеПрофиля.Наименование  	= "Работа с торговым оборудованием";
	ОписаниеПрофиля.Описание 		= НСтр("ru = 'Работа с торговым оборудованием.'");
	ОписаниеПрофиля.Роли.Добавить("РаботаСТорговымОборудованием");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Менеджер сбыта".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 	= "a627ff7d-bd5a-14e2-8e54-e0699515036f";
	ОписаниеПрофиля.Наименование  	= "Менеджер сбыта";
	ОписаниеПрофиля.Описание 		= НСтр("ru = 'Менеджер сбыта.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаСоответствийНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЦеновоеСоглашение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Номенклатура");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_НоменклатурныеНомераОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаИзображенийНоменклатурыВостокСервис");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаСертификатовНоменклатурыВостокСервис");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_УстановкаСоответствийНоменклатуры");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	//Профиль "Внешние пользователи (физические лица)"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "a627ff7d-bdfa-17e2-8e54-e0699515036f";
	ОписаниеПрофиля.Наименование  = "Внешние пользователи (физические лица)";
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение,
		Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
	ОписаниеПрофиля.Описание = НСтр("ru = 'Профиль предназначен для правильной работы внешних пользователей.
									|Данный профиль необходимо включать всем внешним пользователям.'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИспользоватьРабочийСтолВнешнегоПользователя");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Для всех пользователей (Обязательный профиль)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "0aa827d7-b292-11e4-a891-00505682712d";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Для всех пользователей (Обязательный профиль)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Данный профиль необходимо включать всем пользователям.'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользоватьРабочийСтолПользователя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РежимВсеФункции");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаВозникновенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");  
	
	//***НСК Трегубов А.А.*** -- Адресное хранение --  04.09.2019 <<<
	ОписаниеПрофиля.Роли.Добавить("АХ_ДобавлениеИзменениеПодсистемы");  	
	//***НСК Трегубов А.А.*** -- Адресное хранение --  04.09.2019 >>>	
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Кладовщик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "356a810e-ce1b-11e4-b8c5-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кладовщик'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль предназначен для сотрудников, которые занимаются учетом складских остатков.
					|Пользователям БД с данным профилем доступны документы приема, перемещения и прочие документы, учивающие движение товара на складе организации.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратНоменклатурыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратСредствЗащитыОтСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратСредствЗащитыСХранения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ИнвентаризацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_КомплектацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ОприходованиеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПеремещениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПеремещениеСредствЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПоступлениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриемСредствЗащитыНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СписаниеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ТранспортнаяПоставка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Склады");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СкладыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_НоменклатурныеНомераОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамНоменклатурыОрганизацииСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыОрганизацииСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНоменклатуреВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоСертификатам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыСотрудникаНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_СписаниеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_СписаниеСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ОстаткиНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Контрагенты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ОбращениеНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_КатегорииОбращенияНаСклад");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Куратор по организации".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "356a8111-ce1b-11e4-b8c5-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Куратор по организации'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль предназначен для сотрудника организации, который может корректировать все справочники организации, изменять нормы своей организации, создавать списание СИЗ с сотрудников. 
					|Документы выдачи доступны только для просмотра. Так же пользователям с данным профилем доступны все отчеты необходимые для контроля выдачи СИЗ, отчеты по нормам, по потребности и прочие.
					|Данный профиль подойдет для сотрудника организации, который полностью планирует вести блок данных (кадры, нормы и т.д.) по своей организации, а выдачу СИЗ осуществляет аутсорсер. '");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗачетВыданныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗаявкаНаПроизвольнуюВыдачуСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПереносЗимнейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриказПоНормамВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПродлениеСрокаЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СписаниеСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаОсновногоМестаРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаУсловийРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДок_КадровоеПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДок_ПриемНаРаботу");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДок_Увольнение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_НормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_ПериодичностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_УсловияНорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_ДолжностиИПрофессии");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_РабочиеМестаАСТБ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_ИсходныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_УточненныеОснованияНормВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_НоменклатурныеНомераОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СкладыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ДанныеПоСотрудникуИзРегистров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ОтменаВременногоТрудоустройства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборСотрудниковОрганизации");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СкладыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СозданиеНормВыдачиСИЗ");
	//***НСК Трегубов А.А.*** -- №90515 --  02.08.2021 <<<
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_МассоваяУстановкаУсловий");	     
	//***НСК Трегубов А.А.*** -- №90515 --  02.08.2021 >>>	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоЗаявкамНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗ");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗПоВидуУчета");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыдачаПоТабличнымЧастямДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикВыдачиСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗПоСкладам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикУпрощеннойВыдачи");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДанныеПоСотрудникам");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДоступныеУсловияРаботыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НормыВыдачиПоДежурнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НормыВыдачиСИЗДоИзноса");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НеУволенныеВременноТрудоустроенныеСотрудники");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_Обеспечение");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоВсейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоКоллективнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоПерсональнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетОСписанииСИЗсСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗБезЗакрытыхВыдач");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствиямНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствующимНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПланВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПлановаяПотребность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПроцентнаяОбеспеченность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_РаспределениеСотрудниковПоСкладамВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СИЗПереданныеВСобственность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыСотрудникаНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УстановленныеНормыСНоменклатуройВыдачи");
	ОписаниеПрофиля.Роли.Добавить("Разрешение_МаппингНормОрганизации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ИсходныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_МВЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ПериодыЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СкладыВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СоответствияНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СрокиНоскиПоУпрощеннойВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УстановленныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ЦеныНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаДежурныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаСредствЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаСредствЗащитыСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗачетУпрощеннойВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗаявкаНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОбменСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПереходПраваСобственности");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаМВЗДолжностей");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаМВЗПодразделений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаПериодаЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыдачаПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаявкиНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ОстаткиНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ПотребностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СобственныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаВозникновенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Склады");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Контрагенты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаХраненияСИЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОбращениеНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_КатегорииОбращенияНаСклад");
	//+++АСТБ_Горюшин_Алексей_17125
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_РеализованныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПредварительныйПереходПраваСобственности");
	//---АСТБ_Горюшин_Алексей_17125
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Менеджер проекта".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "356a8115-ce1b-11e4-b8c5-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер проекта'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль предназначен для менеджера проекта со стороны сбыта. 
				|Этот профиль необходим сотруднику, который занимается внедрением ПО АСТБ на предприятии.
				|Данным профилем предусмотрены все права необходимые для ведения проекта, доступны все справочники клиента и справочники необходимые для сбыта. Так же доступны для просмотра все документы и отчеты, которые ведутся в организации.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратНоменклатурыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗаказПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗакрытиеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_КомплектацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПереходПраваСобственности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПоступлениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СогласиеНаИнформирование");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СписаниеСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ТранспортнаяПоставка");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаМВЗДолжностей");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаМВЗПодразделений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаПериодаЗимы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПереносЗимнейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_МестаВозникновенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Контрагенты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_МестаХраненияСИЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Склады");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_КраснаяЛиния");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_МВЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СкладыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СогласияНаИнформирование");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СрокиДоставкиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСпр_Организации");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСпр_Сотрудники_Антропометрия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ВыгрузкаДанныхВТСД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ВводИнформацииПоВыданнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ВыгрузкаДокументовППСвСАП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ДанныеПоЗанятымРабочимМестам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ДанныеПоСотрудникуИзРегистров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаКадровойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаСертификатовНоменклатурыВостокСервис");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаСтатистикиРаспределенияРазмеров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПечатьЭтикеток");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СкладыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СотрудникиПодразделения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ШтрихкодыНоменклатурыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СписаниеВыданныхСИЗПоОкончаниюСрокаНоски");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ФормированиеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_УправлениеЗапасами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамНоменклатурыОрганизацииСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыОрганизацииСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоЗаявкамНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗ");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗПоВидуУчета");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыдачаПоТабличнымЧастямДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикВыдачиСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗПоСкладам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикУпрощеннойВыдачи");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДанныеПоСотрудникам");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДвиженияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДоступныеУсловияРаботыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ЗаказыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПланВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НормыВыдачиПоДежурнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НормыВыдачиСИЗДоИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_КонтрольЦикловЧистки");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НеУволенныеВременноТрудоустроенныеСотрудники");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_Обеспечение");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоВсейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоКоллективнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоПерсональнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОборотыСИЗвЧистке");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыВыдачиБезСоответствия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыСЦенами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетДляЗагрузкиВСАП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетОСписанииСИЗсСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоАнтропометрииСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗБезЗакрытыхВыдач");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствиямНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствующимНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНоменклатуреВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоСертификатам");      
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоТочкамОбслуживания");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПлановаяПотребность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПроцентнаяОбеспеченность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_РаспределениеСотрудниковПоСкладамВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СИЗПереданныеВСобственность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СИЗСотрудникаВЧистке");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СоответствияНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыВЧистке");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыСотрудникаНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УстановленныеНормыСНоменклатуройВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УтилизированныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурн_ДокументыПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурн_ДокументыПоСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурн_КадровыеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("Разрешение_МаппингНормОрганизации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ИсходныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_КоэффициентыПоставкиДляГруппИЛИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УточненныеОснованияНормВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_КраснаяЛиния");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ПериодыЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СкладыВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СоответствияНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СрокиНоскиПоУпрощеннойВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УстановленныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ФККОНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ЦеныНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтрихкодыНоменклатурыДляУчетаЧистки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВозвратИзЧистки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВозвратСредствЗащитыОтСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВозвратСредствЗащитыСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаДежурныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаСредствЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаСредствЗащитыСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗачетВыданныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗачетУпрощеннойВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗаявкаНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗаявкаНаПроизвольнуюВыдачуСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ИнвентаризацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_КадровоеПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_КомплектацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОбменСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОприходованиеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПередачаВЧистку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПередачаСИЗвУтилизацию");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПеремещениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПеремещениеСредствЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриемНаРаботу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриемСредствЗащитыНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриказПоНормамВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_СписаниеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_Увольнение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаОсновногоМестаРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаУсловийРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаФККОНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыдачаПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаказыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаявкиНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ОстаткиНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ПотребностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СобственныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыВЧистке");
	//АсТБ_Alexey_79639_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыКПолучению");
	//АсТБ_Alexey_79639_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_УтилизированныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОбращениеНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_КатегорииОбращенияНаСклад");
	//+++АСТБ_Горюшин_Алексей_17125
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_РеализованныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПредварительныйПереходПраваСобственности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ФормированиеППСпоПредварительномуППС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамПредварительногоППС");
	//---АСТБ_Горюшин_Алексей_17125
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Оператор выдачи".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "7671e404-d122-11e4-9c3d-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор выдачи'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль предназначен для сотрудников, которые совершают выдачу СИЗ через программу АСТБ. 
					|В нем разрешено создание документов выдачи и списания, доступны необходимые для работы пользователя справочники.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратСредствЗащитыСХранения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВыдачаДежурныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВыдачаСредствЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВыдачаСредствЗащитыСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗачетУпрощеннойВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗаявкаНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ОбменСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПеремещениеСредствЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриемСредствЗащитыНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПродлениеСрокаЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СогласиеНаИнформирование");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СписаниеСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_ПричиныНевыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СогласияНаИнформирование");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСпр_Сотрудники_Антропометрия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ВводИнформацииПоВыданнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ДанныеПоСотрудникуИзРегистров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПечатьЭтикеток");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СкладыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СотрудникиПодразделения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ШтрихкодыНоменклатурыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоЗаявкамНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗ");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗПоВидуУчета");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыдачаПоТабличнымЧастямДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикВыдачиСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗПоСкладам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикУпрощеннойВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_Обеспечение");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоВсейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоКоллективнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоПерсональнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПроцентнаяОбеспеченность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_РаспределениеСотрудниковПоСкладамВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыСотрудникаНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ПериодыЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СкладыВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СоответствияНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СрокиНоскиПоУпрощеннойВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УстановленныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ЦеныНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтрихкодыНоменклатурыДляУчетаЧистки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗаявкаНаПроизвольнуюВыдачуСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыдачаПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаявкиНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ОстаткиНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ПотребностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаХраненияСИЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Склады");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ОбращениеНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратСредствЗащитыОтСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_КатегорииОбращенияНаСклад");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Оператор чистки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "7671e401-d122-11e4-9c3d-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор чистки'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль обеспечивает полный доступ к подсистеме ""Учет чистки СИЗ"".'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратИзЧистки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПередачаВЧистку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПередачаСИЗвУтилизацию");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаФККОНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_МестаХраненияСИЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСпр_Сотрудники_Антропометрия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ВыгрузкаДанныхВТСД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПечатьЭтикеток");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ШтрихкодыНоменклатурыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_КонтрольЦикловЧистки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОборотыСИЗвЧистке");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СИЗСотрудникаВЧистке");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыВЧистке");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УтилизированныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("РаботаСТорговымОборудованием");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_МВЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ФККОНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтрихкодыНоменклатурыДляУчетаЧистки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыдачаПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаявкиНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ПотребностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыВЧистке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_УтилизированныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Контрагенты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Работник кадров".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "15215cd3-d140-11e4-9c3d-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Работник кадров'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль предназначен для сотрудников организации, которые будут заниматься ведением кадровой информации в ПО АСТБ. 
					|Пользователям профиля доступно создание документов кадрового учета, предусмотренных программой, и использование отчетов, связанных с кадровым учетом.'");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ОтсутствиеНаРабочемМесте");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаМВЗДолжностей");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаМВЗПодразделений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаОсновногоМестаРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаУсловийРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДок_КадровоеПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДок_ПриемНаРаботу");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДок_Увольнение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_ДолжностиИПрофессии");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_РабочиеМестаАСТБ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_МВЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СкладыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборСотрудниковОрганизации");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ОтменаВременногоТрудоустройства");
	//***НСК Трегубов А.А.*** -- №90515 --  02.08.2021 <<<
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_МассоваяУстановкаУсловий");	     
	//***НСК Трегубов А.А.*** -- №90515 --  02.08.2021 >>>	
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДанныеПоСотрудникам");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДоступныеУсловияРаботыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ЗанятыеРабочиеМеста");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НеУволенныеВременноТрудоустроенныеСотрудники");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоАнтропометрииСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствиямНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурн_КадровыеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаВозникновенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Склады");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Снабженец".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "15215cd7-d140-11e4-9c3d-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Снабженец'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Профиль предназначен для сотрудников, занимающихся закупкой СИЗ. 
					|Настроен доступ к документам и обработкам необходимым для анализа потребности в СИЗ организации и последующего пополнения складских запасов. 
					|Имеется возможность изменения документа установки соответствия номенклатуры выдачи.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВозвратНоменклатурыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗаказПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗакрытиеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПоступлениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПереносЗимнейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ТранспортнаяПоставка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Номенклатура");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_КраснаяЛиния");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СкладыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_СрокиДоставкиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСпр_Сотрудники_Антропометрия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ЗагрузкаСертификатовНоменклатурыВостокСервис");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ФормированиеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_УправлениеЗапасами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамНоменклатурыОрганизацииСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыОрганизацииСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоОстаткамНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоЗаявкамНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗ");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗПоВидуУчета");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыдачаПоТабличнымЧастямДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикВыдачиСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗПоСкладам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикУпрощеннойВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ЗаказыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПланВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НормыВыдачиПоДежурнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НормыВыдачиСИЗДоИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_Обеспечение");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоВсейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоКоллективнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоПерсональнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиНоменклатурыВыдачиБезСоответствия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗБезЗакрытыхВыдач");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНоменклатуреВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоСертификатам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПлановаяПотребность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПроцентнаяОбеспеченность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СоответствияНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ПериодыЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УстановленныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ЦеныНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыдачаПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаказыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаявкиНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ОстаткиНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ПотребностьВыдачиСИЗ");
	//АсТБ_Alexey_79639_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыКПолучению");
	//АсТБ_Alexey_79639_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Контрагенты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаВозникновенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Склады");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Сотрудник ТБ и ОТ (изменение норм предприятия)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "6a821da3-d167-11e4-9c3d-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Сотрудник ТБ и ОТ (изменение норм предприятия)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Данный профиль необходим сотрудникам, которые непосредственно занимаются изменением норм в организации.
					|В профиле настроен доступ ко всем справочникам и отчетам, которые могут понадобится при создании или изменении норм предприятия.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗачетВыданныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриказПоНормамВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаОсновногоМестаРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_УстановкаУсловийРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ИнструктажСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_МедицинскийОсмотр");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_НаправлениеНаМецицинскийОсмотр");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриказНаПроведениеИнструктажей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриказНаПроведениеМедицинскихОсмотров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПриказНаПроведениеПроверкиЗнаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ПроверкаЗнанийСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_СпециальнаяОценкаРабочихМест");
	//АсТБ_Alexey_72252_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_РемонтСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ВыполненныеРаботыПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_РемонтСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЦеновоеСоглашениеПоРемонту");
	//АсТБ_Alexey_72252_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_НормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_ПериодичностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_УсловияНорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_ДолжностиИПрофессии");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеСпр_РабочиеМестаАСТБ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_ИсходныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанных_УточненныеОснованияНормВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборПодразделений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СозданиеНормВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СотрудникиПодразделения");
	//***НСК Трегубов А.А.*** -- №90515 --  02.08.2021 <<<
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_МассоваяУстановкаУсловий");	     
	//***НСК Трегубов А.А.*** -- №90515 --  02.08.2021 >>>	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствующимНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УстановленныеНормыСНоменклатуройВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикПрохожденияМедицинскихОсмотров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПрохождениеМедосмотров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СпециальнаяОценкаРабочихМест");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ПериодыЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УстановленныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаПериодаЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Сотрудник ТБ и ОТ (чтение документов)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "f0000504-d15b-11e4-9c3d-0050568278ab";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Сотрудник ТБ и ОТ (чтение документов)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'В частых случаях, профиль необходим клиенту, использующему услугу аутсорсинга, для контроля всех процессов предостовляемых аутсорсером.
					|Профиль позволяет просматривать все необходимые документы, сделанные аутсорсером. Документы доступны только на просмотр без права редактирования. Доступны все возможные отчеты, необходимые для контролирующей организации.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеДок_ЗаявкаНаПроизвольнуюВыдачуСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ДанныеПоСотрудникуИзРегистров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_ПодборНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_СотрудникиПодразделения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОстаткиПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоВыдачеСУчетомИзноса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВедомостьПоЗаявкамНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗ");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗПоВидуУчета");
	//АсТБ_Alexey_70793_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыданныеСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ВыдачаПоТабличнымЧастямДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикВыдачиСИЗСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикОбеспеченияСИЗПоСкладам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикУпрощеннойВыдачи");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДанныеПоСотрудникам");
	//АсТБ_Ruslan_99083_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ДоступныеУсловияРаботыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_Обеспечение");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_НеУволенныеВременноТрудоустроенныеСотрудники");
	//АсТБ_Ruslan_109831_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоВсейПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоКоллективнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПоПерсональнойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОбеспеченностьСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетОСписанииСИЗсСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоНевыданнымСИЗБезЗакрытыхВыдач");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствиямНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетПоОтсутствующимНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоНормам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ОтчетыПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПланВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПлановаяПотребность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПроцентнаяОбеспеченность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_РаспределениеСотрудниковПоСкладамВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СИЗПереданныеВСобственность");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СредстваЗащитыСотрудникаНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УстановленныеНормыСНоменклатуройВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ГрафикПрохожденияМедицинскихОсмотров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ПрохождениеМедосмотров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_СпециальнаяОценкаРабочихМест");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурн_КадровыеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ДоступныеУсловияРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ИсходныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_КоэффициентыПоставкиДляГруппИЛИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_МВЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УточненныеОснованияНормВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОсновноеМестоРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ПериодыЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СкладыВыдачиСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СоответствияНоменклатурыВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_СрокиНоскиПоУпрощеннойВыдаче");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_УстановленныеНормыВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ЦеныНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ШтатноеРасписание");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаДежурныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаСредствЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыдачаСредствЗащитыСотруднику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗачетВыданныхСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗачетУпрощеннойВыдачи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЗаявкаНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_КадровоеПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОбменСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОтсутствиеНаРабочемМесте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПереходПраваСобственности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриемНаРаботу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриказПоНормамВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_СписаниеСредствЗащитыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_Увольнение");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаМВЗДолжностей");
	//АсТБ_Alexey_71263_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаМВЗПодразделений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаОсновногоМестаРаботыСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаПериодаЗимы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_УстановкаУсловийРаботыСотрудника");
	//АсТБ_Alexey_72252_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_РемонтСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ВыполненныеРаботыПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_РемонтСредствЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ЦеновоеСоглашениеПоРемонту");
	//АсТБ_Alexey_72252_********************************************************************
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ИнструктажСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_МедицинскийОсмотр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_НаправлениеНаМецицинскийОсмотр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриказНаПроведениеМедицинскихОсмотров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_СпециальнаяОценкаРабочихМест");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриказНаПроведениеИнструктажей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПриказНаПроведениеПроверкиЗнаний");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПроверкаЗнанийСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащиты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыданныеСредстваЗащитыПоВедомости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ВыдачаПоПотребности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗанятыеРабочиеМеста");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ЗаявкиНаВыдачу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ОстаткиНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_ПотребностьВыдачиСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СобственныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_СредстваЗащитыНаХранении");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаВозникновенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_МестаХраненияСИЗСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Склады");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Сотрудники");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_Контрагенты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ОбращениеНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанных_ИсторияОбращенийНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпр_КатегорииОбращенияНаСклад");
	//+++АСТБ_Горюшин_Алексей_17125
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_РеализованныеСИЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДок_ПредварительныйПереходПраваСобственности");
	//---АСТБ_Горюшин_Алексей_17125
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Доступ к уточненным причинам списания".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "09e56dbf-90a0-11de-862c-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = "Доступ к уточненным причинам списания";
	ОписаниеПрофиля.Описание 	  = НСтр("ru = 'Профиль предназначен для доступа к функционалу учета уточненных причин списания СИЗ.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпр_УточненныеПричиныСписания");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчета_УточненныеПричиныСписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатков_УточненныеПричиныСписания");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	//АСТБ_ALEX_**************************************************************	
	
	//+++АСТБ_Горюшин_Алексей_24602
	// Описание для заполнения профиля "Расширенные права".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "371a6b34-27c3-430b-ae75-cbe9b67700ac";
	ОписаниеПрофиля.Наименование  = "Расширенные права";
	ОписаниеПрофиля.Описание 	  =  НСтр("ru = 'Профиль предназначен для расширения прав на доступ к специальным объектам.'");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработки_АСТБ_КадроваяСверка");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//---АСТБ_Горюшин_Алексей_24602
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным:
// в пункте "2)" вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например, Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например, Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов, указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками, описание которых см. в комментарии
//                   к функции РегистрыСведений.НастройкиПравОбъектов.ВозможныеПрава().
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	//АСТБ_ALEX_**************************************************************
	Описание = Описание +"
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.МестаХраненияСИЗСотрудников.Чтение.Организации
	|Справочник.МестаХраненияСИЗСотрудников.Изменение.Организации
	|Справочник.НоменклатураНормОрганизации.Чтение.Организации
	|Справочник.НоменклатураНормОрганизации.Изменение.Организации
	|Справочник.НормыВыдачиСИЗ.Чтение.Организации
	|Справочник.НормыВыдачиСИЗ.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.Подразделения.Чтение.Организации
	|Справочник.Подразделения.Изменение.Организации
	|Справочник.РабочиеМестаАСТБ.Чтение.Организации
	|Справочник.Склады.Чтение.Склады
	|Справочник.Склады.Изменение.Склады
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.Организации
	|Документ.ВозвратИзЧистки.Чтение.Организации
	|Документ.ВозвратИзЧистки.Изменение.Организации
	|Документ.ВозвратНоменклатурыПоставщику.Чтение.Организации
	|Документ.ВозвратНоменклатурыПоставщику.Чтение.Склады
	|Документ.ВозвратНоменклатурыПоставщику.Изменение.Организации
	|Документ.ВозвратНоменклатурыПоставщику.Изменение.Склады
	|Документ.ВозвратСредствЗащитыОтСотрудника.Чтение.Организации
	|Документ.ВозвратСредствЗащитыОтСотрудника.Чтение.Склады
	|Документ.ВозвратСредствЗащитыОтСотрудника.Изменение.Организации
	|Документ.ВозвратСредствЗащитыОтСотрудника.Изменение.Склады
	|Документ.ВозвратСредствЗащитыСХранения.Чтение.Организации
	|Документ.ВозвратСредствЗащитыСХранения.Чтение.Склады
	|Документ.ВозвратСредствЗащитыСХранения.Изменение.Организации
	|Документ.ВозвратСредствЗащитыСХранения.Изменение.Склады
	|Документ.ВыдачаДежурныхСредствЗащиты.Чтение.Организации
	|Документ.ВыдачаДежурныхСредствЗащиты.Чтение.Склады
	|Документ.ВыдачаДежурныхСредствЗащиты.Изменение.Организации
	|Документ.ВыдачаДежурныхСредствЗащиты.Изменение.Склады
	|Документ.ВыдачаСредствЗащитыСотруднику.Чтение.Организации
	|Документ.ВыдачаСредствЗащитыСотруднику.Чтение.Склады
	|Документ.ВыдачаСредствЗащитыСотруднику.Изменение.Организации
	|Документ.ВыдачаСредствЗащитыСотруднику.Изменение.Склады
	|Документ.ВыдачаСредствЗащитыПоВедомости.Чтение.Организации
	|Документ.ВыдачаСредствЗащитыПоВедомости.Изменение.Организации
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.Склады
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.Склады
	|Документ.ЗакрытиеЗаказовПоставщику.Чтение.Объект.Документ.ЗакрытиеЗаказовПоставщику
	|Документ.ЗакрытиеЗаказовПоставщику.Изменение.Объект.Документ.ЗакрытиеЗаказовПоставщику
	|Документ.ЗачетВыданныхСредствЗащиты.Чтение.Организации
	|Документ.ЗачетВыданныхСредствЗащиты.Изменение.Организации
	|Документ.ЗаявкаНаВыдачу.Чтение.Организации
	|Документ.ЗаявкаНаВыдачу.Чтение.Склады
	|Документ.ЗаявкаНаВыдачу.Изменение.Организации
	|Документ.ЗаявкаНаВыдачу.Изменение.Склады
	|Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ.Чтение.Организации
	|Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ.Чтение.Склады
	|Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ.Изменение.Организации
	|Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ.Изменение.Склады
	|Документ.ИнвентаризацияНоменклатуры.Чтение.Организации
	|Документ.ИнвентаризацияНоменклатуры.Чтение.Склады
	|Документ.ИнвентаризацияНоменклатуры.Изменение.Организации
	|Документ.ИнвентаризацияНоменклатуры.Изменение.Склады
	|Документ.ИнструктажСотрудников.Чтение.Организации
	|Документ.ИнструктажСотрудников.Изменение.Организации
	|Документ.КадровоеПеремещение.Чтение.Организации
	|Документ.КадровоеПеремещение.Изменение.Организации
	|Документ.ОбменСредствЗащитыСотрудника.Чтение.Организации
	|Документ.ОбменСредствЗащитыСотрудника.Чтение.Склады
	|Документ.ОбменСредствЗащитыСотрудника.Изменение.Организации
	|Документ.ОбменСредствЗащитыСотрудника.Изменение.Склады
	|Документ.ОприходованиеНоменклатуры.Чтение.Организации
	|Документ.ОприходованиеНоменклатуры.Чтение.Склады
	|Документ.ОприходованиеНоменклатуры.Изменение.Организации
	|Документ.ОприходованиеНоменклатуры.Изменение.Склады
	|Документ.ОбращениеНаСклад.Чтение.Организации
	|Документ.ОбращениеНаСклад.Чтение.Склады
	|Документ.ОбращениеНаСклад.Изменение.Организации
	|Документ.ОбращениеНаСклад.Изменение.Склады
	|Документ.ОтсутствиеНаРабочемМесте.Чтение.Организации
	|Документ.ОтсутствиеНаРабочемМесте.Изменение.Организации
	|Документ.ПередачаВЧистку.Чтение.Организации
	|Документ.ПередачаВЧистку.Изменение.Организации
	|Документ.ПередачаСИЗвУтилизацию.Чтение.Организации
	|Документ.ПередачаСИЗвУтилизацию.Чтение.Склады
	|Документ.ПередачаСИЗвУтилизацию.Изменение.Организации
	|Документ.ПередачаСИЗвУтилизацию.Изменение.Склады
	|Документ.ПеремещениеНоменклатуры.Чтение.Организации
	|Документ.ПеремещениеНоменклатуры.Чтение.Склады
	|Документ.ПеремещениеНоменклатуры.Изменение.Организации
	|Документ.ПеремещениеНоменклатуры.Изменение.Склады
	|Документ.ПеремещениеСредствЗащитыНаХранении.Чтение.Организации
	|Документ.ПеремещениеСредствЗащитыНаХранении.Чтение.Склады
	|Документ.ПеремещениеСредствЗащитыНаХранении.Изменение.Организации
	|Документ.ПеремещениеСредствЗащитыНаХранении.Изменение.Склады
	|Документ.ПереходПраваСобственности.Чтение.Организации
	|Документ.ПереходПраваСобственности.Изменение.Организации
	|Документ.ПоступлениеНоменклатуры.Чтение.Организации
	|Документ.ПоступлениеНоменклатуры.Чтение.Склады
	|Документ.ПоступлениеНоменклатуры.Изменение.Организации
	|Документ.ПоступлениеНоменклатуры.Изменение.Склады
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПриемСредствЗащитыНаХранение.Чтение.Организации
	|Документ.ПриемСредствЗащитыНаХранение.Чтение.Склады
	|Документ.ПриемСредствЗащитыНаХранение.Изменение.Организации
	|Документ.ПриемСредствЗащитыНаХранение.Изменение.Склады
	|Документ.ПриказПоНормамВыдачиСИЗ.Чтение.Организации
	|Документ.ПриказПоНормамВыдачиСИЗ.Изменение.Организации
	|Документ.ПродлениеСрокаЭксплуатации.Чтение.Организации
	|Документ.ПродлениеСрокаЭксплуатации.Изменение.Организации
	|Документ.СогласиеНаИнформирование.Чтение.Организации
	|Документ.СогласиеНаИнформирование.Изменение.Организации
	|Документ.СписаниеНоменклатуры.Чтение.Организации
	|Документ.СписаниеНоменклатуры.Чтение.Склады
	|Документ.СписаниеНоменклатуры.Изменение.Организации
	|Документ.СписаниеНоменклатуры.Изменение.Склады
	|Документ.СписаниеСредствЗащитыСотрудника.Чтение.Организации
	|Документ.СписаниеСредствЗащитыСотрудника.Изменение.Организации
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.Организации
	//АсТБ_Alexey_71263_********************************************************************
	|Документ.УстановкаМВЗДолжностей.Чтение.Организации
	|Документ.УстановкаМВЗДолжностей.Изменение.Организации
	//АсТБ_Alexey_71263_********************************************************************
	|Документ.УстановкаМВЗПодразделений.Чтение.Организации
	|Документ.УстановкаМВЗПодразделений.Изменение.Организации
	|Документ.УстановкаОсновногоМестаРаботыСотрудника.Чтение.Организации
	|Документ.УстановкаОсновногоМестаРаботыСотрудника.Изменение.Организации
	|Документ.УстановкаПериодаЗимы.Чтение.Организации
	|Документ.УстановкаПериодаЗимы.Изменение.Организации
	|Документ.УстановкаСоответствийНоменклатурыВыдачи.Чтение.Организации
	|Документ.УстановкаСоответствийНоменклатурыВыдачи.Изменение.Организации
	|Документ.УстановкаУсловийРаботыСотрудника.Чтение.Организации
	|Документ.УстановкаУсловийРаботыСотрудника.Изменение.Организации
	|Документ.УстановкаФККОНоменклатуры.Чтение.Организации
	|Документ.УстановкаФККОНоменклатуры.Изменение.Организации
	|Документ.ЦеновоеСоглашение.Чтение.Организации
	|Документ.ЦеновоеСоглашение.Изменение.Организации
	//АсТБ_Alexey_72252_********************************************************************
	|Документ.ВыполненныеРаботыПоРемонту.Чтение.Организации
	|Документ.ВыполненныеРаботыПоРемонту.Изменение.Организации
	|Документ.РемонтСредствЗащиты.Чтение.Организации
	|Документ.РемонтСредствЗащиты.Изменение.Организации
	|Документ.ЦеновоеСоглашениеПоРемонту.Чтение.Организации
	|Документ.ЦеновоеСоглашениеПоРемонту.Изменение.Организации
	//АсТБ_Alexey_72252_********************************************************************
	|Документ.ПереносЗимнейПотребности.Чтение.Организации
	|Документ.ПереносЗимнейПотребности.Изменение.Организации
	|Документ.ПриказНаПроведениеИнструктажей.Чтение.Организации
	|Документ.ПриказНаПроведениеИнструктажей.Изменение.Организации
	|Документ.ПроверкаЗнанийСотрудника.Чтение.Организации
	|Документ.ПроверкаЗнанийСотрудника.Изменение.Организации
	|Документ.ПриказНаПроведениеПроверкиЗнаний.Чтение.Организации
	|Документ.ПриказНаПроведениеПроверкиЗнаний.Изменение.Организации
	|Документ.СпециальнаяОценкаРабочихМест.Чтение.Организации
	|Документ.СпециальнаяОценкаРабочихМест.Изменение.Организации
	|Документ.ПриказНаПроведениеМедицинскихОсмотров.Чтение.Организации
	|Документ.ПриказНаПроведениеМедицинскихОсмотров.Изменение.Организации
	|Документ.НаправлениеНаМедицинскийОсмотр.Чтение.Организации
	|Документ.НаправлениеНаМедицинскийОсмотр.Изменение.Организации
	|Документ.МедицинскийОсмотр.Чтение.Организации
	|Документ.МедицинскийОсмотр.Изменение.Организации
	|ЖурналДокументов.ЖурналДокументовПоПотребности.Чтение.Организации
	|Документ.ПриказНаПроведениеПроверкиЗнаний.Чтение.Организации
	|Документ.ПриказНаПроведениеПроверкиЗнаний.Изменение.Организации
	|ЖурналДокументов.КадровыеДокументы.Чтение.Организации
	|РегистрСведений.ДоступныеУсловияРаботыСотрудника.Чтение.Организации
	|РегистрСведений.ЗначенияАнтропометрическихСвойств.Чтение.Организации
	|РегистрСведений.ЗначенияАнтропометрическихСвойств.Изменение.Организации
	|РегистрСведений.ЗначенияЗащитныхСвойствРабочихМест.Чтение.Организации
	|РегистрСведений.ИсходныеНормыВыдачиСИЗ.Чтение.Организации
	|РегистрСведений.ИсходныеНормыВыдачиСИЗ.Изменение.Организации
	|РегистрСведений.КраснаяЛиния.Чтение.Организации
	//АсТБ_Alexey_71263_********************************************************************
	|РегистрСведений.МВЗДолжностей.Чтение.Организации
	//АсТБ_Alexey_71263_********************************************************************
	|РегистрСведений.МВЗПодразделений.Чтение.Организации
	|РегистрСведений.МВЗСотрудников.Чтение.Организации
	|РегистрСведений.МВЗСотрудников.Изменение.Организации
	|РегистрСведений.НастройкиШаблонаАдресацииМестХраненияСИЗ.Чтение.Организации
	|РегистрСведений.НоменклатурныеНомераОрганизаций.Чтение.Организации
	|РегистрСведений.НоменклатурныеНомераОрганизаций.Изменение.Организации
	|РегистрСведений.ОсновноеМестоРаботыСотрудника.Чтение.Организации
	|РегистрСведений.ОтсутствиеНаРабочемМесте.Чтение.Организации
	|РегистрСведений.СкладыВыдачиСредствЗащиты.Чтение.Организации
	|РегистрСведений.СкладыВыдачиСредствЗащиты.Чтение.Склады
	|РегистрСведений.СоответствияНоменклатурыВыдачи.Чтение.Организации
	|РегистрСведений.ЦеныНоменклатуры.Чтение.Организации
	|РегистрСведений.ШтатноеРасписание.Чтение.Организации
	|РегистрСведений.ШтатноеРасписание.Изменение.Организации
	|РегистрНакопления.ВыданныеСредстваЗащиты.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщику.Чтение.Организации
	|РегистрНакопления.ЗанятыеРабочиеМеста.Чтение.Организации
	|РегистрНакопления.ЗаявкиНаВыдачу.Чтение.Организации
	|РегистрНакопления.ОстаткиНоменклатуры.Чтение.Организации
	|РегистрНакопления.ПотребностьВыдачиСИЗ.Чтение.Организации
	|РегистрНакопления.СобственныеСИЗ.Чтение.Организации
	|РегистрНакопления.ВыданныеСредстваЗащитыПоВедомости.Чтение.Организации
	|РегистрНакопления.СредстваЗащитыВЧистке.Чтение.Организации
	|РегистрНакопления.ВыдачаПоПотребности.Чтение.Организации
	|РегистрНакопления.УточненныеПричиныСписания.Чтение.Организации";	
	//АСТБ_ALEX_**************************************************************
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
