//АСТБ_Горюшин_Алексей_17125

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать	
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		Объект.НачалоПериода = НачалоМесяца(ТекущаяДата());
		Объект.КонецПериода = КонецМесяца(ТекущаяДата());
		Модифицированность = Истина;
	КонецЕсли;
	
	ПериодВыдачи.ДатаНачала 	= Объект.НачалоПериода;
	ПериодВыдачи.ДатаОкончания 	= Объект.КонецПериода;
	
	ИспользованиеДокументаРазрешено();
	
	ЭтаФорма.ТолькоПросмотр = Объект.Проведен;
	
	Если Объект.Проведен Тогда
		ЭтаФорма.Элементы.ПолеТекстПредупреждения.Заголовок = "Проведенный документ доступен только на просмотр.";
		ЭтаФорма.Элементы.ГруппаПредупреждение.Видимость = Истина;
	Иначе	
		ЭтаФорма.Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоДокументамВыдачи(Команда)
	
	ЗаполнитьТабличнуюЧастьВыдачи();
	
	//АсТБ_Alexey_56458_********************************************************************
	Модифицированность = Истина;
	//АсТБ_Alexey_56458_********************************************************************
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьВыдачи()
	
	Если НЕ ИспользованиеДокументаРазрешено() Тогда
		Возврат;
	КонецЕсли;
		
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Объект.КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Документы.ПредварительныйПереходПраваСобственности.ЗаполнитьПоДокументамВыдачиНаСервере(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");	
	
КонецПроцедуры 

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ИспользованиеДокументаРазрешено();	
	
КонецПроцедуры 

&НаСервере
Функция ИспользованиеДокументаРазрешено()

	Если ЗначениеЗаполнено(Объект.Организация) И Объект.Организация.ПереходПраваСобственностиПоПредварительнойЗаявкеППС = Ложь Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У данной организации не включена настройка использования документа ""Предварительный переход права собственности"". Выберите другую организацию.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции 

&НаКлиенте
Процедура ПериодВыдачиПриИзменении(Элемент)
	
	Если Объект.Товары.Количество()>0 Тогда
		
		Текст = НСтр("ru = 'Табличная часть будет очищена. Продолжить?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		
		ПоказатьВопрос(Оповещение,Текст,РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		Объект.НачалоПериода = ПериодВыдачи.ДатаНачала;
		Объект.КонецПериода  = ПериодВыдачи.ДатаОкончания;
	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ПериодВыдачи.ДатаНачала 	= Объект.НачалоПериода;
		ПериодВыдачи.ДатаОкончания 	= Объект.КонецПериода;
        Возврат;
    КонецЕсли;

    Объект.Товары.Очистить();
	
	Объект.НачалоПериода = ПериодВыдачи.ДатаНачала;
	Объект.КонецПериода  = ПериодВыдачи.ДатаОкончания;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументВыдачи) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументВыдачи);
	
	Если ТипЗнч(Элемент.ТекущиеДанные.ДокументВыдачи) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
		ОткрытьФорму("Документ.ВыдачаСредствЗащитыСотруднику.Форма.ФормаДокумента", ПараметрыФормы);
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.ДокументВыдачи) = Тип("ДокументСсылка.ВыдачаДежурныхСредствЗащиты") Тогда
		ОткрытьФорму("Документ.ВыдачаДежурныхСредствЗащиты.Форма.ФормаДокумента", ПараметрыФормы);		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры