&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СписокНорм) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНорм,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНорм,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НормаВыдачи) Тогда
		
		Элементы.Список.ТекущаяСтрока = Параметры.НормаВыдачи;
		
	КонецЕсли;
	
КонецПроцедуры