
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Параметры.Отбор.Организация));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Должность") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Должность", Параметры.Отбор.Должность));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("НормаВыдачи") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("НормаВыдачи", Параметры.Отбор.НормаВыдачи));
	КонецЕсли;
	
КонецПроцедуры
