Процедура ВозвратСредствЗащитыОтСотрудника_ЗаполнитьТаблицуДокумента(ТекущийОбъект,Основание) Экспорт
	
	// Заполнение шапки
	ТекущийОбъект.Организация 			= Основание.Организация;
	ТекущийОбъект.Сотрудник 			= Основание.Сотрудник;
	ТекущийОбъект.ДокументОснование 	= Основание.Ссылка;
	
	Запрос = Новый Запрос;
	
	Если ТекущийОбъект.Организация.ИспользоватьПроцентИзноса Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСредствЗащитыСотрудникаТовары.НормаВыдачи КАК НормаВыдачи,
		|	СписаниеСредствЗащитыСотрудникаТовары.НоменклатураНормы КАК НоменклатураНормы,
		|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура КАК Номенклатура,
		|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СписаниеСредствЗащитыСотрудникаТовары.ДатаВыдачи КАК ДатаВыдачи,
		|	СписаниеСредствЗащитыСотрудникаТовары.Количество КАК Количество,
		|	СписаниеСредствЗащитыСотрудникаТовары.Цена КАК Цена,
		|	СписаниеСредствЗащитыСотрудникаТовары.Сумма КАК Сумма,
		|	СписаниеСредствЗащитыСотрудникаТовары.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СписаниеСИзносом
		|ИЗ
		|	Документ.СписаниеСредствЗащитыСотрудника.Товары КАК СписаниеСредствЗащитыСотрудникаТовары
		|ГДЕ
		|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписаниеСИзносом.Номенклатура КАК Номенклатура,
		|	ВТ_СписаниеСИзносом.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ВТ_СписаниеСИзносом.Количество) КАК Количество,
		|	СРЕДНЕЕ(ВТ_СписаниеСИзносом.Цена) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_СписаниеСИзносом.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|				ТОГДА ВТ_СписаниеСИзносом.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ВТ_СписаниеСИзносом.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_СписаниеСИзносом КАК ВТ_СписаниеСИзносом
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписаниеСИзносом.Номенклатура,
		|	ВТ_СписаниеСИзносом.ХарактеристикаНоменклатуры,
		|	ВТ_СписаниеСИзносом.ПроцентИзноса";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура,
		|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры,
		|	СУММА(СписаниеСредствЗащитыСотрудникаТовары.Количество) КАК Количество,
		|	СРЕДНЕЕ(СписаниеСредствЗащитыСотрудникаТовары.Цена) КАК Цена,
		|	СУММА(СписаниеСредствЗащитыСотрудникаТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.СписаниеСредствЗащитыСотрудника.Товары КАК СписаниеСредствЗащитыСотрудникаТовары
		|ГДЕ
		|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка = &ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура,
		|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование",	ТекущийОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.ДокументОснование.Организация);
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущийОбъект.ДокументОснование.Дата);
	Запрос.УстановитьПараметр("ДатаАнализа",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.ДокументОснование));
	Запрос.УстановитьПараметр("Сотрудник",			ТекущийОбъект.ДокументОснование.Сотрудник);
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры	

Процедура ЗаявкаНаВыдачу_ЗаполнитьТаблицуДокумента(ТекущийОбъект, УтивыватьПросроченнуюПотребность) Экспорт

	ТекущийОбъект.Товары.Очистить();
	
	МассивСотрудников 		= ПроцедурыРаботыСНормамиСервер.ПолучитьМассивСотрудниковПодразделений(Истина,Новый Массив,?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущаяДата()));
	ТаблицаСкладовВыдачи 	= ПроцедурыРаботыСНормамиСервер.ПолучитьСкладыВыдачиСотрудников(МассивСотрудников,Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача,ТекущийОбъект.Организация);
	ТаблицаСкладовВыдачи 	= ТаблицаСкладовВыдачи.Скопировать(Новый Структура("Склад",ТекущийОбъект.Склад));
	МассивСотрудников 		= ТаблицаСкладовВыдачи.ВыгрузитьКолонку("Сотрудник");
	
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(ТекущийОбъект.Склад);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ПотребностьВыдачиСИЗОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаВыдачи,
	|	ВТ_Потребность.КоличествоОстаток КАК Количество,
	|	ВТ_Потребность.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_СоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_Потребность.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ЕжемесячнаяПотребность
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Месяц)
	|	И ВТ_Результат.ПериодичностьВыдачи.КоличествоПериодов = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_АктуальнаяПотребность
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_Результат.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Месяц)
	|				ТОГДА НЕ ВТ_Результат.ПериодичностьВыдачи.КоличествоПериодов = 1
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВТ_Результат.ДатаВыдачи МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ПросроченнаяПотребность
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_Результат.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Месяц)
	|				ТОГДА НЕ ВТ_Результат.ПериодичностьВыдачи.КоличествоПериодов = 1
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НАЧАЛОПЕРИОДА(ВТ_Результат.ДатаВыдачи, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|	И &УтивыватьПросроченнуюПотребность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЕжемесячнаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_ЕжемесячнаяПотребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ЕжемесячнаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ЕжемесячнаяПотребность.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ЕжемесячнаяПотребность.Количество КАК Количество,
	|	ВТ_ЕжемесячнаяПотребность.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ЕжемесячнаяПотребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_ЕжемесячнаяПотребность КАК ВТ_ЕжемесячнаяПотребность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальнаяПотребность.Сотрудник,
	|	ВТ_АктуальнаяПотребность.НормаВыдачи,
	|	ВТ_АктуальнаяПотребность.НоменклатураНормы,
	|	ВТ_АктуальнаяПотребность.ДатаВыдачи,
	|	ВТ_АктуальнаяПотребность.Количество,
	|	ВТ_АктуальнаяПотребность.КоличествоПотребность,
	|	ВТ_АктуальнаяПотребность.ПериодичностьВыдачи
	|ИЗ
	|	ВТ_АктуальнаяПотребность КАК ВТ_АктуальнаяПотребность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПросроченнаяПотребность.Сотрудник,
	|	ВТ_ПросроченнаяПотребность.НормаВыдачи,
	|	ВТ_ПросроченнаяПотребность.НоменклатураНормы,
	|	ВТ_ПросроченнаяПотребность.ДатаВыдачи,
	|	ВТ_ПросроченнаяПотребность.Количество,
	|	ВТ_ПросроченнаяПотребность.КоличествоПотребность,
	|	ВТ_ПросроченнаяПотребность.ПериодичностьВыдачи
	|ИЗ
	|	ВТ_ПросроченнаяПотребность КАК ВТ_ПросроченнаяПотребность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|ГДЕ
	|	МВЗСотрудников.Сотрудник В(&МассивСотрудников)
	|	И МВЗСотрудников.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботыСотрудника
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	МВЗПодразделенийСрезПоследних.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений.СрезПоследних(&ПериодРасчета, Подразделение.Владелец = &Организация) КАК МВЗПодразделенийСрезПоследних
	|ГДЕ
	|	МВЗПодразделенийСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗДолжностейСрезПоследних.Организация КАК Организация,
	|	МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|	МВЗДолжностейСрезПоследних.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗДолжностей
	|ИЗ
	|	РегистрСведений.МВЗДолжностей.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК МВЗДолжностейСрезПоследних
	|ГДЕ
	|	МВЗДолжностейСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновноеМестоРаботыСотрудника.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|										ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|									ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|					КОНЕЦ
	|			ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|		КОНЕЦ) КАК МВЗ
	|ИЗ
	|	ВТ_ОсновноеМестоРаботыСотрудника КАК ВТ_ОсновноеМестоРаботыСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВТ_ОсновноеМестоРаботыСотрудника.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВТ_ОсновноеМестоРаботыСотрудника.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|		ПО ВТ_ОсновноеМестоРаботыСотрудника.Организация = ВТ_МВЗДолжностей.Организация
	|			И ВТ_ОсновноеМестоРаботыСотрудника.Должность = ВТ_МВЗДолжностей.Должность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновноеМестоРаботыСотрудника.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОсновноеМестоРаботыСотрудника.Сотрудник.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяПотребность.Сотрудник.ФизическоеЛицо.Пол КАК ПолСотрудника,
	|	ВТ_СобраннаяПотребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_СобраннаяПотребность.Количество КАК Количество,
	|	ВТ_СобраннаяПотребность.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_СобраннаяПотребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_СобраннаяПотребность.Сотрудник.Наименование,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("Период",								?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("ПериодРасчета",						ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",						ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",						Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача);
	Запрос.УстановитьПараметр("УтивыватьПросроченнуюПотребность",	УтивыватьПросроченнуюПотребность);
	Запрос.УстановитьПараметр("НачалоПериода",						НачалоДня(ТекущийОбъект.НачалоПериодаВыдачи));
	Запрос.УстановитьПараметр("КонецПериода",						КонецДня(ТекущийОбъект.КонецПериодаВыдачи));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаМВЗ 							= Результат[11].Выгрузить();
	ТаблицаПотребности 					= Результат[12].Выгрузить();
	ТаблицаНоменклатурыНормСотрудников 	= Результат[13].Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущийОбъект.Организация);
	
	Если ТекущийОбъект.УчитыватьОстаткиНаСкладе Тогда //считаем остатки и учитываем комплектующие
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
		|	ТаблицаПотребности.ПолСотрудника КАК ПолСотрудника,
		|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ТаблицаПотребности.Количество КАК Количество,
		|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
		|ИЗ
		|	&ТаблицаПотребности КАК ТаблицаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
		|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
		|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
		|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
		|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
		|	ТаблицаРазмеров.Приоритет КАК Приоритет,
		|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
		|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
		|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
		|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
		|	ТаблицаРазмеров.Рост КАК Рост,
		|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
		|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
		|	ТаблицаРазмеров.Комплект КАК Комплект,
		|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
		|ИЗ
		|	&ТаблицаРазмеров КАК ТаблицаРазмеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаМВЗ.Сотрудник КАК Сотрудник,
		|	ТаблицаМВЗ.МВЗ КАК МВЗ
		|ПОМЕСТИТЬ ВТ_ТаблицаМВЗ
		|ИЗ
		|	&ТаблицаМВЗ КАК ТаблицаМВЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ПериодРасчета,
		|			Организация = &ОрганизацияДляОстатков
		|				И Склад В (&МассивСкладов)) КАК ОстаткиНоменклатурыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ТаблицаПотребности.Количество КАК Количество,
		|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
		|	ВТ_ТаблицаРазмеров.Приоритет КАК Приоритет,
		|	ВТ_ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ЕСТЬNULL(ВТ_ТаблицаМВЗ.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ
		|ПОМЕСТИТЬ ВТ_ПотребностьБезКомплектующих
		|ИЗ
		|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
		|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаРазмеров.Сотрудник
		|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы,
		|	ВТ_ТаблицаМВЗ КАК ВТ_ТаблицаМВЗ
		|ГДЕ
		|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаРазмеров.Сотрудник КАК Сотрудник,
		|	ВТ_ТаблицаРазмеров.Комплект КАК Комплект,
		|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаРазмеров.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0) КАК Остаток
		|ПОМЕСТИТЬ ВТ_КомплектующиеДляСотрудников
		|ИЗ
		|	ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
		|		ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_ОстаткиНоменклатуры.Номенклатура
		|			И ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры = ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
		|ГДЕ
		|	НЕ ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКомплектующие.Ссылка КАК Комплект,
		|	МАКСИМУМ(НоменклатураКомплектующие.НомерСтроки) КАК КоличествоКомплектующих
		|ПОМЕСТИТЬ ВТ_КоличествоКомплектующих
		|ИЗ
		|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураКомплектующие.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотребностьБезКомплектующих.Сотрудник КАК Сотрудник,
		|	ВТ_ПотребностьБезКомплектующих.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ПотребностьБезКомплектующих.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ПотребностьБезКомплектующих.Номенклатура КАК Номенклатура,
		|	ВТ_ПотребностьБезКомплектующих.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи КАК ДатаПотребности,
		|	ВТ_ПотребностьБезКомплектующих.Количество КАК Количество,
		|	ВТ_ПотребностьБезКомплектующих.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_ПотребностьБезКомплектующих.ПриоритетСоответствия КАК ПриоритетСоответствия,
		|	ВТ_ПотребностьБезКомплектующих.Приоритет КАК Приоритет,
		|	ВТ_ПотребностьБезКомплектующих.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_ПотребностьБезКомплектующих.МВЗ КАК МВЗ,
		|	ЛОЖЬ КАК ВведенаВручную
		|ИЗ
		|	ВТ_ПотребностьБезКомплектующих КАК ВТ_ПотребностьБезКомплектующих
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	НормаВыдачи,
		|	НоменклатураНормы,
		|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи,
		|	ПриоритетСоответствия,
		|	Приоритет
		|ИТОГИ ПО
		|	Сотрудник,
		|	НормаВыдачи,
		|	НоменклатураНормы,
		|	ДатаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КомплектующиеДляСотрудников.Сотрудник КАК Сотрудник,
		|	ВТ_КомплектующиеДляСотрудников.Комплект КАК Комплект,
		|	ВТ_КомплектующиеДляСотрудников.Номенклатура КАК Номенклатура,
		|	ВТ_КомплектующиеДляСотрудников.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_КомплектующиеДляСотрудников.Количество КАК КоличествоВКомплекте,
		|	СУММА(ВТ_КомплектующиеДляСотрудников.Остаток) КАК Остаток,
		|	ВТ_КоличествоКомплектующих.КоличествоКомплектующих КАК КоличествоКомплектующих
		|ИЗ
		|	ВТ_КомплектующиеДляСотрудников КАК ВТ_КомплектующиеДляСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоКомплектующих КАК ВТ_КоличествоКомплектующих
		|		ПО ВТ_КомплектующиеДляСотрудников.Комплект = ВТ_КоличествоКомплектующих.Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КомплектующиеДляСотрудников.Сотрудник,
		|	ВТ_КомплектующиеДляСотрудников.Комплект,
		|	ВТ_КомплектующиеДляСотрудников.Номенклатура,
		|	ВТ_КомплектующиеДляСотрудников.ХарактеристикаНоменклатуры,
		|	ВТ_КоличествоКомплектующих.КоличествоКомплектующих,
		|	ВТ_КомплектующиеДляСотрудников.Количество
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Комплект,
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиНоменклатуры.Номенклатура,
		|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры";
		
		Запрос.УстановитьПараметр("ТаблицаПотребности", 	ТаблицаПотребности);
		Запрос.УстановитьПараметр("ТаблицаРазмеров", 		ТаблицаРазмеров);
		Запрос.УстановитьПараметр("ТаблицаМВЗ", 			ТаблицаМВЗ);
		Запрос.УстановитьПараметр("ПериодРасчета",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",					?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивСкладов",			МассивСкладов);
		Запрос.УстановитьПараметр("ОрганизацияДляОстатков",	?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),ТекущийОбъект.Организация));
		
		ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
		
		Результат = Запрос.ВыполнитьПакет();
		
		ТаблицаКомплектующих 	= Результат[8].Выгрузить();
		ТаблицаОстатков 		= Результат[9].Выгрузить();
		
		ВыборкаПоСотруднику = Результат[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСотруднику.Следующий() Цикл
			
			ВыборкаПоНормеВыдачи = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
				
				ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				СтрокаДобавлена = Ложь;
				
				Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
					
					ВыборкаПоДате = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоДате.Следующий() Цикл
						
						СтрокаДобавлена = Ложь;
						
						ВыборкаПоНоменклатуре = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаПоНоменклатуре.Следующий() Цикл
							
							СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоНоменклатуре.ХарактеристикаНоменклатуры);
							
							НайденныеСтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
							
							Если НайденныеСтрокиОстатков.Количество() = 0 ИЛИ НайденныеСтрокиОстатков[0].КоличествоОстаток < ВыборкаПоНоменклатуре.Количество Тогда
								СтруктураПоиска = Новый Структура("Сотрудник, Комплект", ВыборкаПоНоменклатуре.Сотрудник, ВыборкаПоНоменклатуре.Номенклатура);
								НайденныеСтроки = ТаблицаКомплектующих.НайтиСтроки(СтруктураПоиска);
								Если НайденныеСтроки.Количество() = 0 Тогда
									ДобавлятьКомплектующие = Ложь;
								Иначе
									Если НайденныеСтроки[0].КоличествоКомплектующих = НайденныеСтроки.Количество() Тогда
										ДобавлятьКомплектующие = Истина;
										Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
											Если НайденнаяСтрока.Остаток < НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуре.Количество Тогда
												ДобавлятьКомплектующие = Ложь;
											КонецЕсли;
										КонецЦикла;
									Иначе
										ДобавлятьКомплектующие = Ложь;
									КонецЕсли;
								КонецЕсли;
								Если ДобавлятьКомплектующие Тогда
									Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
										НоваяСтрока = ТаблицаДокумента.Добавить();
										ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
										//НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы = 1;
										ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
										НайденнаяСтрока.Остаток = НайденнаяСтрока.Остаток - НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуре.Количество;
									КонецЦикла;
									СтрокаДобавлена = Истина;
									Прервать;
								КонецЕсли;
							Иначе
								НоваяСтрока = ТаблицаДокумента.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
								//НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы = 1;
								НайденныеСтрокиОстатков[0].КоличествоОстаток = НайденныеСтрокиОстатков[0].КоличествоОстаток - ВыборкаПоНоменклатуре.Количество;
								СтрокаДобавлена = Истина;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если НЕ СтрокаДобавлена Тогда
							
							ВыборкаПоНоменклатуре.Сбросить();
							Пока ВыборкаПоНоменклатуре.Следующий() Цикл
								НоваяСтрока = ТаблицаДокумента.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
								//НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы 	= 1;  
								НоваяСтрока.Номенклатура 							= Справочники.Номенклатура.ПустаяСсылка();
								НоваяСтрока.ХарактеристикаНоменклатуры 				= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
								Прервать;
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе //берем максимальный приоритет по размерам и маппингу
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
		|	ТаблицаПотребности.ПолСотрудника КАК ПолСотрудника,
		|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ТаблицаПотребности.Количество КАК Количество,
		|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
		|ИЗ
		|	&ТаблицаПотребности КАК ТаблицаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
		|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
		|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
		|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
		|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
		|	ТаблицаРазмеров.Приоритет КАК Приоритет,
		|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
		|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
		|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
		|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
		|	ТаблицаРазмеров.Рост КАК Рост,
		|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
		|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
		|	ТаблицаРазмеров.Комплект КАК Комплект,
		|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
		|ИЗ
		|	&ТаблицаРазмеров КАК ТаблицаРазмеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаМВЗ.Сотрудник КАК Сотрудник,
		|	ТаблицаМВЗ.МВЗ КАК МВЗ
		|ПОМЕСТИТЬ ВТ_ТаблицаМВЗ
		|ИЗ
		|	&ТаблицаМВЗ КАК ТаблицаМВЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаПотребности.ДатаВыдачи КАК ДатаПотребности,
		|	ВТ_ТаблицаПотребности.Количество КАК Количество,
		|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
		|	ВТ_ТаблицаРазмеров.Приоритет КАК Приоритет,
		|	ВТ_ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ЕСТЬNULL(ВТ_ТаблицаМВЗ.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
		|	ЛОЖЬ КАК ВведенаВручную
		|ИЗ
		|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
		|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаРазмеров.Сотрудник
		|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаМВЗ КАК ВТ_ТаблицаМВЗ
		|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаМВЗ.Сотрудник
		|ГДЕ
		|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	НормаВыдачи,
		|	НоменклатураНормы,
		|	ВТ_ТаблицаПотребности.ДатаВыдачи,
		|	ПриоритетСоответствия,
		|	Приоритет
		|ИТОГИ ПО
		|	Сотрудник,
		|	НормаВыдачи,
		|	НоменклатураНормы,
		|	ДатаПотребности";
		
		Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаПотребности);
		Запрос.УстановитьПараметр("ТаблицаРазмеров", 	ТаблицаРазмеров);
		Запрос.УстановитьПараметр("ТаблицаМВЗ", 		ТаблицаМВЗ);
		
		ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
		
		ВыборкаПоСотруднику = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСотруднику.Следующий() Цикл
			
			ВыборкаПоНормеВыдачи = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
				
				ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				СтрокаДобавлена = Ложь;
				
				Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
					
					ВыборкаПоДате = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоДате.Следующий() Цикл
						
						СтрокаДобавлена = Ложь;
						
						ВыборкаПоНоменклатуре = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаПоНоменклатуре.Следующий() Цикл
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							Прервать;
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;	
	
	ТекущийОбъект.Товары.Загрузить(ТаблицаДокумента);
	ТекущийОбъект.Товары.Сортировать("Сотрудник Возр, НормаВыдачи Возр, НоменклатураНормы Возр");
	
КонецПроцедуры

Процедура ОбращениеНаСклад_ЗаполнитьТаблицуДокумента(ТекущийОбъект) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(ТекущийОбъект.Сотрудник);
	
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(ТекущийОбъект.Склад);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ПотребностьВыдачиСИЗОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
	|				И НАЧАЛОПЕРИОДА(ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаВыдачи,
	|	ВТ_Потребность.КоличествоОстаток КАК Количество,
	|	ВТ_Потребность.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_СоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_Потребность.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Сотрудник.ФизическоеЛицо.Пол КАК ПолСотрудника,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаПотребности 					= Результат[3].Выгрузить();
	ТаблицаНоменклатурыНормСотрудников 	= Результат[4].Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущийОбъект.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.ПолСотрудника КАК ПолСотрудника,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ТаблицаПотребности.Количество КАК Количество,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
	|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
	|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
	|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
	|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаРазмеров.Рост КАК Рост,
	|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
	|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
	|	ТаблицаРазмеров.Комплект КАК Комплект,
	|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
	|ИЗ
	|	&ТаблицаРазмеров КАК ТаблицаРазмеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ПериодРасчета,
	|			Организация = &ОрганизацияДляОстатков
	|				И Склад В (&МассивСкладов)) КАК ОстаткиНоменклатурыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаПотребности.Количество КАК Количество,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ПотребностьБезКомплектующих
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаРазмеров.Сотрудник
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбращениеНаСкладТовары.Номенклатура КАК Номенклатура,
	|	ОбращениеНаСкладТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбращениеНаСкладТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_РезервПодЗаявки
	|ИЗ
	|	Документ.ОбращениеНаСклад.Товары КАК ОбращениеНаСкладТовары
	|ГДЕ
	|	ОбращениеНаСкладТовары.Ссылка.Дата < &Период
	|	И НЕ ОбращениеНаСкладТовары.Отказ
	|	И ОбращениеНаСкладТовары.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА &ОрганизацияДляОстатков = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОбращениеНаСкладТовары.Ссылка.Организация = &ОрганизацияДляОстатков
	|		КОНЕЦ
	|	И ОбращениеНаСкладТовары.Ссылка.СтатусОбращения = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращенийНаСклад.Открыто)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбращениеНаСкладТовары.Номенклатура,
	|	ОбращениеНаСкладТовары.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьБезКомплектующих.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьБезКомплектующих.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.Номенклатура КАК Номенклатура,
	|	ВТ_ПотребностьБезКомплектующих.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.Количество КАК Количество,
	|	ВТ_ПотребностьБезКомплектующих.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьБезКомплектующих.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ПотребностьБезКомплектующих.Приоритет КАК Приоритет,
	|	ВТ_ПотребностьБезКомплектующих.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_ПотребностьБезКомплектующих КАК ВТ_ПотребностьБезКомплектующих
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи,
	|	ПриоритетСоответствия,
	|	Приоритет
	|ИТОГИ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток - ЕСТЬNULL(ВТ_РезервПодЗаявки.Количество, 0)) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервПодЗаявки КАК ВТ_РезервПодЗаявки
	|		ПО ВТ_ОстаткиНоменклатуры.Номенклатура = ВТ_РезервПодЗаявки.Номенклатура
	|			И ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры = ВТ_РезервПодЗаявки.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиНоменклатуры.Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток - ЕСТЬNULL(ВТ_РезервПодЗаявки.Количество, 0)) > 0";
	
	Запрос.УстановитьПараметр("ТаблицаПотребности", 	ТаблицаПотребности);
	Запрос.УстановитьПараметр("ТаблицаРазмеров", 		ТаблицаРазмеров);
	Запрос.УстановитьПараметр("ПериодРасчета",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Период",					?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСкладов",			МассивСкладов);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",	?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),ТекущийОбъект.Организация));
	
	ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаОстатков = Результат[6].Выгрузить();
	
	ВыборкаПоСотруднику = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСотруднику.Следующий() Цикл
		
		ВыборкаПоНормеВыдачи = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
			
			ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			СтрокаДобавлена = Ложь;
			
			Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
				
				ВыборкаПоДате = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоДате.Следующий() Цикл
					
					СтрокаДобавлена = Ложь;
					
					ВыборкаПоНоменклатуре = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоНоменклатуре.Следующий() Цикл
						
						СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоНоменклатуре.ХарактеристикаНоменклатуры);
						
						НайденныеСтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
						
						Если НЕ (НайденныеСтрокиОстатков.Количество() = 0 ИЛИ НайденныеСтрокиОстатков[0].КоличествоОстаток < ВыборкаПоНоменклатуре.Количество) Тогда
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							НайденныеСтрокиОстатков[0].КоличествоОстаток = НайденныеСтрокиОстатков[0].КоличествоОстаток - ВыборкаПоНоменклатуре.Количество;
							СтрокаДобавлена = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					Если НЕ СтрокаДобавлена Тогда
						
						ВыборкаПоНоменклатуре.Сбросить();
						Пока ВыборкаПоНоменклатуре.Следующий() Цикл
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							НоваяСтрока.Отказ 						= Истина;
							НоваяСтрока.ПричинаОтказа  				= Справочники.ПричиныНевыдачиСИЗ.НетНаСкладе;
							НоваяСтрока.Номенклатура 				= Справочники.Номенклатура.ПустаяСсылка();
							НоваяСтрока.ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
							Прервать;
						КонецЦикла;
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекущийОбъект.Товары.Загрузить(ТаблицаДокумента);
	ТекущийОбъект.Товары.Сортировать("НормаВыдачи Возр, НоменклатураНормы Возр");
	
КонецПроцедуры

Процедура ВыдачаСИЗ_ЗаполнитьТаблицуДокумента(ТекущийОбъект, ВыбранныйСотрудник = Неопределено, ДСИЗ = Неопределено) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	//АСТБ_ALEXEY_72838_**************************************************************
	ТекущийОбъект.ШтрихкодыНоменклатуры.Очистить();
	ТекущийОбъект.КодыМаркировки.Очистить();
	//АСТБ_ALEXEY_72838_**************************************************************
	
	Если ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ТекущийОбъект.Сотрудник);
		
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(ТекущийОбъект.Склад);
		
	ИначеЕсли ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
		
		Если ВыбранныйСотрудник = Неопределено Тогда
			
			//определяем режим заполнения
			Если ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка Тогда
				
				МассивСотрудников 		= ПроцедурыРаботыСНормамиСервер.ПолучитьМассивСотрудниковПодразделений(Истина,Новый Массив,?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущаяДата()));
				ТаблицаСкладовВыдачи 	= ПроцедурыРаботыСНормамиСервер.ПолучитьСкладыВыдачиСотрудников(МассивСотрудников,ТекущийОбъект.ВидВыдачиСИЗ,ТекущийОбъект.Организация);
				ТаблицаСкладовВыдачи 	= ТаблицаСкладовВыдачи.Скопировать(Новый Структура("Склад",ТекущийОбъект.Склад));
				МассивСотрудников 		= ТаблицаСкладовВыдачи.ВыгрузитьКолонку("Сотрудник");
				
				МассивСкладов = Новый Массив;
				МассивСкладов.Добавить(ТекущийОбъект.Склад);
				МассивСкладов.Добавить(ТекущийОбъект.СкладОтправитель);
				
			Иначе
				
				Если ТекущийОбъект.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда //фактическая выдача по предварительной заявке
					
					Документы.ВыдачаСредствЗащитыСотруднику.ЗаполнитьТаблицуДокументаПоЗаявке(ТекущийОбъект);
					Возврат;
					
				Иначе //фактическая выдача без предварительной заявки
					
					МассивСотрудников 		= ПроцедурыРаботыСНормамиСервер.ПолучитьМассивСотрудниковПодразделений(Истина,Новый Массив,?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущаяДата()));
					ТаблицаСкладовВыдачи 	= ПроцедурыРаботыСНормамиСервер.ПолучитьСкладыВыдачиСотрудников(МассивСотрудников,ТекущийОбъект.ВидВыдачиСИЗ,ТекущийОбъект.Организация);
					ТаблицаСкладовВыдачи 	= ТаблицаСкладовВыдачи.Скопировать(Новый Структура("Склад",ТекущийОбъект.Склад));
					МассивСотрудников 		= ТаблицаСкладовВыдачи.ВыгрузитьКолонку("Сотрудник");
					
					МассивСкладов = Новый Массив;
					МассивСкладов.Добавить(ТекущийОбъект.Склад);
					МассивСкладов.Добавить(ТекущийОбъект.СкладОтправитель);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			МассивСотрудников = Новый Массив;
			Для Каждого ТекущийСотрудник Из ВыбранныйСотрудник Цикл
				МассивСотрудников.Добавить(ТекущийСотрудник);
			КонецЦикла;
			
			//при заполнении по сотруднику нужно считать остатки по складу-отправителю
			МассивСкладов = Новый Массив;
			МассивСкладов.Добавить(ТекущийОбъект.СкладОтправитель);
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого ТекСтрокаТовары Из ТекущийОбъект.ДокументОснование.Товары Цикл
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаТовары);
			НоваяСтрока.ДатаВыдачи 	= ТекущийОбъект.Дата;
			НоваяСтрока.Сотрудник 	= ТекущийОбъект.Сотрудник;
		КонецЦикла;
		
		ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ПотребностьВыдачиСИЗОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|				И НАЧАЛОПЕРИОДА(ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|				И ВЫБОР
	|					КОГДА &ДСИЗ = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ДСИЗ
	|								ТОГДА НоменклатураНормы.ВидСИЗ.Дерматологический
	|							ИНАЧЕ НЕ ЕСТЬNULL(НоменклатураНормы.ВидСИЗ.Дерматологический, ЛОЖЬ)
	|						КОНЕЦ
	|				КОНЕЦ) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаВыдачи,
	|	ВТ_Потребность.КоличествоОстаток КАК Количество,
	|	ВТ_Потребность.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_СоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_Потребность.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Сотрудник.ФизическоеЛицо.Пол КАК ПолСотрудника,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",		ТекущийОбъект.ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ДСИЗ",				ДСИЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаПотребности 					= Результат[3].Выгрузить();
	ТаблицаНоменклатурыНормСотрудников 	= Результат[4].Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущийОбъект.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.ПолСотрудника КАК ПолСотрудника,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ТаблицаПотребности.Количество КАК Количество,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
	|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
	|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
	|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
	|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаРазмеров.Рост КАК Рост,
	|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
	|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
	|	ТаблицаРазмеров.Комплект КАК Комплект,
	|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
	|ИЗ
	|	&ТаблицаРазмеров КАК ТаблицаРазмеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ПериодРасчета,
	|			Организация = &ОрганизацияДляОстатков
	|				И Склад В (&МассивСкладов)) КАК ОстаткиНоменклатурыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаПотребности.Количество КАК Количество,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ПотребностьБезКомплектующих
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|			ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_Номенклатура.Номенклатура
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаРазмеров.Сотрудник
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаРазмеров.Комплект КАК Комплект,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаРазмеров.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ ВТ_КомплектующиеДляСотрудников
	|ИЗ
	|	ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|		ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_ОстаткиНоменклатуры.Номенклатура
	|			И ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры = ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_Номенклатура.Номенклатура
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка КАК Комплект,
	|	МАКСИМУМ(НоменклатураКомплектующие.НомерСтроки) КАК КоличествоКомплектующих
	|ПОМЕСТИТЬ ВТ_КоличествоКомплектующих
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКомплектующие.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьБезКомплектующих.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьБезКомплектующих.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.Номенклатура КАК Номенклатура,
	|	ВТ_ПотребностьБезКомплектующих.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.Количество КАК Количество,
	|	ВТ_ПотребностьБезКомплектующих.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьБезКомплектующих.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ПотребностьБезКомплектующих.Приоритет КАК Приоритет,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ПотребностьБезКомплектующих.Количество КАК Сумма,
	|	ВТ_ПотребностьБезКомплектующих.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_ПотребностьБезКомплектующих КАК ВТ_ПотребностьБезКомплектующих
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_ПотребностьБезКомплектующих.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_ПотребностьБезКомплектующих.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи,
	|	ПриоритетСоответствия,
	|	Приоритет
	|ИТОГИ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КомплектующиеДляСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_КомплектующиеДляСотрудников.Комплект КАК Комплект,
	|	ВТ_КомплектующиеДляСотрудников.Номенклатура КАК Номенклатура,
	|	ВТ_КомплектующиеДляСотрудников.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_КомплектующиеДляСотрудников.Количество КАК КоличествоВКомплекте,
	|	СУММА(ВТ_КомплектующиеДляСотрудников.Остаток) КАК Остаток,
	|	ВТ_КоличествоКомплектующих.КоличествоКомплектующих КАК КоличествоКомплектующих,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена
	|ИЗ
	|	ВТ_КомплектующиеДляСотрудников КАК ВТ_КомплектующиеДляСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_КомплектующиеДляСотрудников.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_КомплектующиеДляСотрудников.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоКомплектующих КАК ВТ_КоличествоКомплектующих
	|		ПО ВТ_КомплектующиеДляСотрудников.Комплект = ВТ_КоличествоКомплектующих.Комплект
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КомплектующиеДляСотрудников.Сотрудник,
	|	ВТ_КомплектующиеДляСотрудников.Комплект,
	|	ВТ_КомплектующиеДляСотрудников.Номенклатура,
	|	ВТ_КоличествоКомплектующих.КоличествоКомплектующих,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0),
	|	ВТ_КомплектующиеДляСотрудников.Количество,
	|	ВТ_КомплектующиеДляСотрудников.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Комплект,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиНоменклатуры.Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("ТаблицаПотребности", 	ТаблицаПотребности);
	Запрос.УстановитьПараметр("ТаблицаРазмеров", 		ТаблицаРазмеров);
	Запрос.УстановитьПараметр("ПериодРасчета",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Период",					?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСкладов",			МассивСкладов);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",	?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),ТекущийОбъект.Организация));
	
	ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаКомплектующих 	= Результат[9].Выгрузить();
	ТаблицаОстатков 		= Результат[10].Выгрузить();
	
	ВыборкаПоСотруднику = Результат[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСотруднику.Следующий() Цикл
		
		ВыборкаПоНормеВыдачи = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
			
			ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			СтрокаДобавлена = Ложь;
			
			Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
				
				ВыборкаПоДате = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоДате.Следующий() Цикл
					
					СтрокаДобавлена = Ложь;
					
					ВыборкаПоНоменклатуре = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоНоменклатуре.Следующий() Цикл
						
						СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоНоменклатуре.ХарактеристикаНоменклатуры);
						
						НайденныеСтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
						
						Если НайденныеСтрокиОстатков.Количество() = 0 ИЛИ НайденныеСтрокиОстатков[0].КоличествоОстаток < ВыборкаПоНоменклатуре.Количество Тогда
							СтруктураПоиска = Новый Структура("Сотрудник, Комплект", ВыборкаПоНоменклатуре.Сотрудник, ВыборкаПоНоменклатуре.Номенклатура);
							НайденныеСтроки = ТаблицаКомплектующих.НайтиСтроки(СтруктураПоиска);
							Если НайденныеСтроки.Количество() = 0 Тогда
								ДобавлятьКомплектующие = Ложь;
							Иначе
								Если НайденныеСтроки[0].КоличествоКомплектующих = НайденныеСтроки.Количество() Тогда
									ДобавлятьКомплектующие = Истина;
									Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
										Если НайденнаяСтрока.Остаток < НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуре.Количество Тогда
											ДобавлятьКомплектующие = Ложь;
										КонецЕсли;
									КонецЦикла;
								Иначе
									ДобавлятьКомплектующие = Ложь;
								КонецЕсли;
							КонецЕсли;
							Если ДобавлятьКомплектующие Тогда
								Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
									НоваяСтрока = ТаблицаДокумента.Добавить();
									ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
									НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы = 1;
									ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
									НоваяСтрока.Сумма = НоваяСтрока.Цена * НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуре.Количество;
									НайденнаяСтрока.Остаток = НайденнаяСтрока.Остаток - НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуре.Количество;
								КонецЦикла;
								СтрокаДобавлена = Истина;
								Прервать;
							КонецЕсли;
						Иначе
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы = 1;
							НайденныеСтрокиОстатков[0].КоличествоОстаток = НайденныеСтрокиОстатков[0].КоличествоОстаток - ВыборкаПоНоменклатуре.Количество;
							СтрокаДобавлена = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					Если НЕ СтрокаДобавлена Тогда
						
						ВыборкаПоНоменклатуре.Сбросить();
						Пока ВыборкаПоНоменклатуре.Следующий() Цикл
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							Если ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
								НоваяСтрока.НеВыдано 							= Истина;
								НоваяСтрока.НеВыданоПоПричине                   = Справочники.ПричиныНевыдачиСИЗ.НетНаСкладе;
							КонецЕсли;
							НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы 	= 1;  
							НоваяСтрока.Номенклатура 							= Справочники.Номенклатура.ПустаяСсылка();
							НоваяСтрока.ХарактеристикаНоменклатуры 				= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
							НоваяСтрока.Цена 									= 0;
							НоваяСтрока.Сумма 									= 0;
							Прервать;
						КонецЦикла;
						
					КонецЕсли;
				
				КонецЦикла;
				
				//в случае частичной выдачи даты выдачи разъехались, поэтому этот фрагмент перенесен выше
				//Если НЕ СтрокаДобавлена Тогда
				//	
				//	ВыборкаПоНоменклатуре.Сбросить();
				//	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				//		НоваяСтрока = ТаблицаДокумента.Добавить();
				//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
				//		Если ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
				//			НоваяСтрока.НеВыдано 							= Истина;
				//			НоваяСтрока.НеВыданоПоПричине                   = Справочники.ПричиныНевыдачиСИЗ.НетНаСкладе;
				//		КонецЕсли;
				//		НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы 	= 1;  
				//		НоваяСтрока.Номенклатура 							= Справочники.Номенклатура.ПустаяСсылка();
				//		НоваяСтрока.ХарактеристикаНоменклатуры 				= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				//		НоваяСтрока.Цена 									= 0;
				//		НоваяСтрока.Сумма 									= 0;
				//		Прервать;
				//	КонецЦикла;
				//	
				//КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДокумента.ЗаполнитьЗначения(Ложь,"ДобавленаКопированием");
	
	ТекущийОбъект.Товары.Загрузить(ТаблицаДокумента);
	ТекущийОбъект.Товары.Сортировать("Сотрудник Возр, НормаВыдачи Возр, НоменклатураНормы Возр");
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура СписаниеСредствЗащитыСотрудника_ЗаполнитьТаблицуДокумента(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.Увольнение Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗ.Количество КАК Сумма,
		|	ВТ_ВыданныеСИЗ.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗ.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗ.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
		
	ИначеЕсли ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.ОкончаниеСрокаНоски Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
		|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_ПериодичностьВыдачи
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыдачаПоПотребностиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВТ_ВыдачаПоПотребности.ДатаПотребности ЕСТЬ NULL
		|				ИЛИ ВТ_ВыдачаПоПотребности.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ВыдачаПоПотребности1.ДатаПотребности ЕСТЬ NULL
		|							ИЛИ ВТ_ВыдачаПоПотребности1.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА ВТ_ВыданныеСИЗ.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|									ТОГДА ВЫБОР
		|											КОГДА ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, 12 * ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, 12 * ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов * (100 - ВТ_ВыданныеСИЗ.ПроцентИзноса.Код) / 100)
		|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов * (100 - ВТ_ВыданныеСИЗ.ПроцентИзноса.Код) / 100)
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.ДатаПотребности
		|				КОНЕЦ
		|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ДатаПотребности
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВТ_ВыданныеСИЗ.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодичностьВыдачи КАК ВТ_ПериодичностьВыдачи
		|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_ПериодичностьВыдачи.Ссылка
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ПериодичностьВыдачи.НоменклатураНормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
		|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_ВыданныеСИЗ.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности1
		|		ПО ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ВыдачаПоПотребности1.НоменклатураНормы
		|			И ВТ_ВыданныеСИЗ.ДатаВыдачи = ВТ_ВыдачаПоПотребности1.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаВыдачи КАК ДатаВыдачи,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Сумма,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи КАК ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаСледующейВыдачи, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",			?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
		
	ИначеЕсли ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.ОтменаНорм Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ПотребностьВыдачиСИЗОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыданныеСИЗ.КоличествоОстаток КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗ.КоличествоОстаток КАК Сумма,
		|	ВТ_ВыданныеСИЗ.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_ВыданныеСИЗ.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗ.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗ.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
		|ГДЕ
		|	ВТ_Потребность.НоменклатураНормы ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВыданныеСИЗ.НормаВыдачи.Наименование,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы.Наименование,
		|	ВТ_ВыданныеСИЗ.Номенклатура.Наименование,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры.КодSAP,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("Сотрудник",			ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",		ТекущийОбъект.ВидВыдачиСИЗ);
		
	//+++АСТБ_Горюшин_Алексей_20510
	ИначеЕсли ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.ТехническоеСписание Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗ.Количество КАК Сумма,
		|	ВТ_ВыданныеСИЗ.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗ.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗ.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);	
	//---АСТБ_Горюшин_Алексей_20510
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
		|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_ПериодичностьВыдачи
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыдачаПоПотребностиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВТ_ВыдачаПоПотребности.ДатаПотребности ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ВыдачаПоПотребности1.ДатаПотребности ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ВТ_ВыданныеСИЗ.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|									ТОГДА ВЫБОР
		|											КОГДА ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|												ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, 12 * ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|											ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, 12 * ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов * (100 - ВТ_ВыданныеСИЗ.ПроцентИзноса.Код) / 100)
		|										ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов * (100 - ВТ_ВыданныеСИЗ.ПроцентИзноса.Код) / 100)
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.ДатаПотребности
		|				КОНЕЦ
		|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ДатаПотребности
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВТ_ВыданныеСИЗ.Сотрудник КАК Сотрудник,
		|	ВТ_ВыданныеСИЗ.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодичностьВыдачи КАК ВТ_ПериодичностьВыдачи
		|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_ПериодичностьВыдачи.Ссылка
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ПериодичностьВыдачи.НоменклатураНормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
		|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_ВыданныеСИЗ.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности1
		|		ПО ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ВыдачаПоПотребности1.НоменклатураНормы
		|			И ВТ_ВыданныеСИЗ.ДатаВыдачи = ВТ_ВыдачаПоПотребности1.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ЗанятыеРабочиеМестаОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК ЗанятыеРабочиеМестаОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаВыдачи КАК ДатаВыдачи,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Сумма,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи КАК ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ПО ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Сотрудник = ВТ_ЗанятыеРабочиеМеста.Сотрудник
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаСледующейВыдачи, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	И НЕ ВТ_ЗанятыеРабочиеМеста.КоличествоОстаток ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",			?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
		
	КонецЕсли;
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗачетУпрощеннойВыдачи_ЗаполнитьТаблицуДокумента(ТекущийОбъект, ВидЗаполнения, ЗначениеПараметраЗаполнения) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка);
	
	Если ВидЗаполнения = "Полностью" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_ОстаткиПоВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УпрощеннаяВыдача.Сотрудник.Наименование,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы.Наименование,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация); 		
		
	ИначеЕсли ВидЗаполнения = "ПоСотрудникам" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				И Сотрудник В (&МассивСотрудников)) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И СрокиНоскиПоУпрощеннойВыдаче.Сотрудник В(&МассивСотрудников)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_ОстаткиПоВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Сотрудник В (&МассивСотрудников)) КАК ПотребностьВыдачиСИЗОстатки
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УпрощеннаяВыдача.Сотрудник.Наименование,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы.Наименование,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивСотрудников",			ЗначениеПараметраЗаполнения);
		
	ИначеЕсли ВидЗаполнения = "ПоПодразделениям" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Подразделение В (&МассивПодразделений)) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|				&ДатаАнализа,
		|				Организация = &Организация
		|					И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ВыданныеСредстваЗащитыОстатки.Сотрудник
		|ГДЕ
		|	НЕ ВыданныеСредстваЗащитыОстатки.Сотрудник ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И НЕ СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_ОстаткиПоВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ПотребностьВыдачиСИЗОстатки.Сотрудник
		|ГДЕ
		|	НЕ ПотребностьВыдачиСИЗОстатки.Сотрудник ЕСТЬ NULL
		|	И НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УпрощеннаяВыдача.Сотрудник.Наименование,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы.Наименование,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивПодразделений",		ЗначениеПараметраЗаполнения);
		
	ИначеЕсли ВидЗаполнения = "ПоДолжностям" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Должность В (&МассивДолжностей)) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|				&ДатаАнализа,
		|				Организация = &Организация
		|					И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ВыданныеСредстваЗащитыОстатки.Сотрудник
		|ГДЕ
		|	НЕ ВыданныеСредстваЗащитыОстатки.Сотрудник ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И НЕ СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_ОстаткиПоВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ПотребностьВыдачиСИЗОстатки.Сотрудник
		|ГДЕ
		|	НЕ ПотребностьВыдачиСИЗОстатки.Сотрудник ЕСТЬ NULL
		|	И НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УпрощеннаяВыдача.Сотрудник.Наименование,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы.Наименование,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивДолжностей",			ЗначениеПараметраЗаполнения);
		
	ИначеЕсли ВидЗаполнения = "ПоНоменклатуреНормы" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				И НоменклатураНормы В (&МассивНоменклатурыНормы)) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы В(&МассивНоменклатурыНормы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_ОстаткиПоВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НоменклатураНормы В (&МассивНоменклатурыНормы)) КАК ПотребностьВыдачиСИЗОстатки
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УпрощеннаяВыдача.Сотрудник.Наименование,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы.Наименование,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация); 
		Запрос.УстановитьПараметр("МассивНоменклатурыНормы",	ЗначениеПараметраЗаполнения);
		
	КонецЕсли;	
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры	

Процедура ВыдачаСИЗ_СкорректироватьТекущуюСтроку(ТекущийОбъект,АдресРезультатаПодбораВХранилище,НомерВыбраннойСтроки) Экспорт
	
	ТаблицаДанныхПодбора 	= ПолучитьИзВременногоХранилища(АдресРезультатаПодбораВХранилище);
	СтрокаТаблицыОбъекта 	= ТекущийОбъект.Товары[НомерВыбраннойСтроки - 1];
	
	//АСТБ_ALEXEY_96460**************************************************************
	СтарыйКомплект = СтрокаТаблицыОбъекта.Комплект;
	//АСТБ_ALEXEY_96460**************************************************************
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицыОбъекта,ТаблицаДанныхПодбора[0]);
	
	//АСТБ_ALEXEY_96460**************************************************************
	Если НЕ СтарыйКомплект = СтрокаТаблицыОбъекта.Комплект Тогда //комплектующее от другого комплекта
		СтрокаТаблицыОбъекта.Комплект = СтарыйКомплект;
	КонецЕсли;	
	//АСТБ_ALEXEY_96460**************************************************************
	
	СтрокаТаблицыОбъекта.Сумма 		= СтрокаТаблицыОбъекта.Количество * СтрокаТаблицыОбъекта.Цена * ?(СтрокаТаблицыОбъекта.КоличествоВКомплекте = 0,1,СтрокаТаблицыОбъекта.КоличествоВКомплекте);	
	ТекущийОбъект.СуммаДокумента 	= ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ПолучитьТаблицуДвиженийПоПотребности(ДокументСсылка,ТаблицаДвижений,ДвиженияПоДоступнымУсловиямРаботы = Неопределено,ТаблицаВыдачаПоПотребности = Неопределено) Экспорт
	
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
		
		МассивСотрудников = ДокументСсылка.Товары.ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				ДокументСсылка.ВидВыдачиСИЗ);
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ДокументСсылка",				ДокументСсылка);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуВыдачиСИЗ(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СписаниеСредствЗащитыСотрудника") Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ДокументСсылка.Сотрудник);
		
		//могут быть строки с одинаковыми нормами, но разными номенклатурами - нужно просуммировать количество
		ТаблицаДокумента = ДокументСсылка.Товары.Выгрузить();
		ТаблицаДокумента.Свернуть("НормаВыдачи, НоменклатураНормы, ДатаВыдачи","Количество");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ТаблицаДокумента);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуСписанияСИЗ(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		МассивСотрудников = ДокументСсылка.Работники.ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.Работники.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуПриемаНаРаботу(СтруктураОтбора,ТаблицаВыдачаПоПотребности);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		
		МассивСотрудников = ДокументСсылка.Работники.ВыгрузитьКолонку("Сотрудник");
		
		//АсТБ_Alexey_55146_********************************************************************
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровоеПеремещениеРаботники.Ссылка.Дата КАК Период,
		|	КадровоеПеремещениеРаботники.НомерСтроки КАК НомерСтроки,
		|	КадровоеПеремещениеРаботники.Ссылка.Организация КАК Организация,
		|	КадровоеПеремещениеРаботники.Сотрудник КАК Сотрудник,
		|	КадровоеПеремещениеРаботники.ПодразделениеСтарое КАК ПодразделениеСтарое,
		|	КадровоеПеремещениеРаботники.ДолжностьСтарая КАК ДолжностьСтарая,
		|	КадровоеПеремещениеРаботники.РабочееМестоСтарое КАК РабочееМестоСтарое,
		|	КадровоеПеремещениеРаботники.ЗанимаемыхСтавокСтарое КАК ЗанимаемыхСтавокСтарое,
		|	КадровоеПеремещениеРаботники.ПодразделениеНовое КАК ПодразделениеНовое,
		|	КадровоеПеремещениеРаботники.ДолжностьНовая КАК ДолжностьНовая,
		|	КадровоеПеремещениеРаботники.РабочееМестоНовое КАК РабочееМестоНовое,
		|	КадровоеПеремещениеРаботники.ЗанимаемыхСтавокНовое КАК ЗанимаемыхСтавокНовое,
		|	ВЫБОР
		|		КОГДА КадровоеПеремещениеРаботники.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА КадровоеПеремещениеРаботники.Ссылка.ДатаОкончания
		|		ИНАЧЕ КадровоеПеремещениеРаботники.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания
		|ИЗ
		|	Документ.КадровоеПеремещение.Работники КАК КадровоеПеремещениеРаботники
		|ГДЕ
		|	КадровоеПеремещениеРаботники.Ссылка = &Ссылка
		|	И НЕ (КадровоеПеремещениеРаботники.ПодразделениеСтарое = КадровоеПеремещениеРаботники.ПодразделениеНовое
		|	И КадровоеПеремещениеРаботники.ДолжностьСтарая = КадровоеПеремещениеРаботники.ДолжностьНовая
		|	И КадровоеПеремещениеРаботники.РабочееМестоСтарое = КадровоеПеремещениеРаботники.РабочееМестоНовое)";
		
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		//АсТБ_Alexey_55146_********************************************************************
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		//АсТБ_Alexey_55146_********************************************************************
		СтруктураОтбора.Вставить("ТаблицаДокумента",			Запрос.Выполнить().Выгрузить());
		//АсТБ_Alexey_55146_********************************************************************
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуКадровогоПеремещения(СтруктураОтбора,ТаблицаВыдачаПоПотребности);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Увольнение") Тогда
		
		МассивСотрудников = ДокументСсылка.Работники.ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.Работники.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		СтруктураОтбора.Вставить("ТаблицаВыдачаПоПотребности",	ТаблицаВыдачаПоПотребности);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуУвольнения(СтруктураОтбора,ТаблицаВыдачаПоПотребности);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтсутствиеНаРабочемМесте") Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ДокументСсылка.Сотрудник);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ДатаНачала",					ДокументСсылка.ДатаНачала);
		СтруктураОтбора.Вставить("ДатаОкончания",				ДокументСсылка.ДатаОкончания);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуОтсутствияНаРабочемМесте(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриказПоНормамВыдачиСИЗ") Тогда
		
		//формируем массив сотрудников
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Подразделение КАК Подразделение,
		|	ТаблицаДокумента.Должность КАК Должность
		|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодРасчета, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ПО (ВЫБОР
		|				КОГДА ВТ_ТаблицаДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаДокумента.Подразделение = ЗанятыеРабочиеМестаОстатки.Подразделение
		|			КОНЕЦ)
		|			И ВТ_ТаблицаДокумента.Должность = ЗанятыеРабочиеМестаОстатки.Должность
		|ГДЕ
		|	НЕ ЗанятыеРабочиеМестаОстатки.Сотрудник ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ПериодРасчета",							ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",							ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("ТаблицаДокумента",						ДокументСсылка.НормыВыдачиСИЗ.Выгрузить());
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",							ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",						Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",						ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",							ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",					ДокументСсылка.НормыВыдачиСИЗ.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",					МассивСотрудников);
		СтруктураОтбора.Вставить("МассивНоменклатурыНорм",				ПолучитьМассивНоменклатурыНормПоНормамВыдачи(ДокументСсылка.НормыВыдачиСИЗ.ВыгрузитьКолонку("НормаВыдачи")));
		СтруктураОтбора.Вставить("ДвиженияПоДоступнымУсловиямРаботы",	ДвиженияПоДоступнымУсловиямРаботы);
		
		Если МассивСотрудников.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуПриказПоНормамВыдачиСИЗ(СтруктураОтбора,ТаблицаВыдачаПоПотребности);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УстановкаУсловийРаботыСотрудника") Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ДокументСсылка.Сотрудник);
		
		ТаблицаДокумента = ДокументСсылка.УсловияРаботы.Выгрузить();
		ТаблицаДокумента.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ТаблицаДокумента.ЗаполнитьЗначения(ДокументСсылка.Сотрудник,"Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ТаблицаДокумента);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуУстановкиУсловийРаботыСотрудника(СтруктураОтбора,ТаблицаВыдачаПоПотребности);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УстановкаПериодаЗимы") Тогда
		
		//формируем массив сотрудников
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Подразделения.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В ИЕРАРХИИ(&МассивПодразделений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник
		|ИЗ
		|	ВТ_Подразделения КАК ВТ_Подразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодРасчета, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ПО ВТ_Подразделения.Подразделение = ЗанятыеРабочиеМестаОстатки.Подразделение
		|ГДЕ
		|	НЕ ЗанятыеРабочиеМестаОстатки.Сотрудник ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",		ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("МассивПодразделений",ДокументСсылка.ПериодыЗимы.ВыгрузитьКолонку("Подразделение"));
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.ПериодыЗимы.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуУстановкиПериодаЗимы(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПереносЗимнейПотребности") Тогда
		
		//формируем массив сотрудников
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Подразделения.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В ИЕРАРХИИ(&МассивПодразделений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник
		|ИЗ
		|	ВТ_Подразделения КАК ВТ_Подразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодРасчета, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ПО ВТ_Подразделения.Подразделение = ЗанятыеРабочиеМестаОстатки.Подразделение
		|ГДЕ
		|	НЕ ЗанятыеРабочиеМестаОстатки.Сотрудник ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",		ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("МассивПодразделений",ДокументСсылка.ПериодыЗимы.ВыгрузитьКолонку("Подразделение"));
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.ПериодыЗимы.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		//ИсходнаяПотребностьВыдачи 	= ИсходнаяПотребностьВыдачи.Скопировать(Новый Структура("ЭтоЗима",Истина));
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуПереносаЗимнейПотребности(СтруктураОтбора);
		//КонечнаяПотребностьВыдачи 	= КонечнаяПотребностьВыдачи.Скопировать(Новый Структура("ЭтоЗима",Истина));
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	КонецЕсли;
	
	ТаблицаДвижений.Сортировать("Сотрудник Возр,НормаВыдачи Возр,НоменклатураНормы Возр,ВидДвижения Убыв,ДатаПотребности Возр,ПроцентИзноса Возр");
	
	//***НСК Трегубов А.А.*** -- №73822 проценты износа в 4 алгоритме --  23.06.2021 <<<	
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.ПроцентыИзноса.ПустаяСсылка(),"ПроцентИзноса");
	
	Если ЗначениеЗаполнено(ТаблицаВыдачаПоПотребности) Тогда	
		ТаблицаВыдачаПоПотребности.ЗаполнитьЗначения(0,"ПроцентИзноса");
	КонецЕсли;
	//***НСК Трегубов А.А.*** -- №73822 проценты износа в 4 алгоритме --  23.06.2021 >>>

КонецПроцедуры

Функция ПолучитьМассивНоменклатурыНормПоНормамВыдачи(МассивНормВыдачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка",МассивНормВыдачи);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураНормы");
	
КонецФункции

Процедура ПолучитьТаблицуДвиженийВыдачиПоПотребности(ДокументСсылка,ТаблицаДвижений,ДвиженияПоПотребности,ДвиженияПоВыданнымСИЗ,ТаблицаВыдачаПоПотребности) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДвиженийПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвиженийПоПотребности.Период КАК Период,
		|	ТаблицаДвиженийПоПотребности.Организация КАК Организация,
		|	ТаблицаДвиженийПоПотребности.Сотрудник КАК Сотрудник,
		|	ТаблицаДвиженийПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаДвиженийПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаДвиженийПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ТаблицаДвиженийПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ТаблицаДвиженийПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДвиженияПоПотребности
		|ИЗ
		|	&ТаблицаДвиженийПоПотребности КАК ТаблицаДвиженийПоПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
		|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОстатки.Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТ_ДвиженияПоПотребности.Организация КАК Организация,
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ДвиженияПоПотребности.Период КАК ДатаВыдачи,
		|	ВТ_ДвиженияПоПотребности.Количество КАК Количество,
		|	ВТ_ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ПриходПоПотребности
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТ_ДвиженияПоПотребности.Организация КАК Организация,
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВТ_ДвиженияПоПотребности.Количество >= ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0)
		|			ТОГДА ВТ_ВыдачаПоПотребности.Количество
		|		ИНАЧЕ ВТ_ДвиженияПоПотребности.Количество
		|	КОНЕЦ КАК Количество,
		|	ВТ_ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_РасходПоПотребности
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
		|		ПО ВТ_ДвиженияПоПотребности.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_ДвиженияПоПотребности.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_ДвиженияПоПотребности.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
		|			И ВТ_ДвиженияПоПотребности.ПроцентИзноса = ВТ_ВыдачаПоПотребности.ПроцентИзноса
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ВТ_ВыдачаПоПотребности.Количество ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасходПоПотребности.Период КАК Период,
		|	ВТ_РасходПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ВТ_РасходПоПотребности.Организация КАК Организация,
		|	ВТ_РасходПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_РасходПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_РасходПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_РасходПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_РасходПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_РасходПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_РасходПоПотребности.Количество КАК Количество
		|ИЗ
		|	ВТ_РасходПоПотребности КАК ВТ_РасходПоПотребности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПриходПоПотребности.Период,
		|	ВТ_ПриходПоПотребности.ВидДвижения,
		|	ВТ_ПриходПоПотребности.Организация,
		|	ВТ_ПриходПоПотребности.Сотрудник,
		|	ВТ_ПриходПоПотребности.НормаВыдачи,
		|	ВТ_ПриходПоПотребности.НоменклатураНормы,
		|	ВТ_ПриходПоПотребности.ДатаПотребности,
		|	ВТ_ПриходПоПотребности.ДатаВыдачи,
		|	ВТ_ПриходПоПотребности.ПроцентИзноса,
		|	ВТ_ПриходПоПотребности.Количество
		|ИЗ
		|	ВТ_ПриходПоПотребности КАК ВТ_ПриходПоПотребности";
		
		Запрос.УстановитьПараметр("ТаблицаДвиженийПоПотребности",	ДвиженияПоПотребности);
		Запрос.УстановитьПараметр("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",					ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("Сотрудник",						ДокументСсылка.Сотрудник);
		
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СписаниеСредствЗащитыСотрудника") Тогда
		
		Если ДокументСсылка.ПричинаСписания = Перечисления.ПричиныСписания.Увольнение 
			ИЛИ ДокументСсылка.ПричинаСписания = Перечисления.ПричиныСписания.ОкончаниеСрокаНоски
			ИЛИ ДокументСсылка.ПричинаСписания = Перечисления.ПричиныСписания.ОтменаНорм Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДвиженияПоВыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
			|	ДвиженияПоВыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
			|	ДвиженияПоВыданнымСИЗ.ДатаВыдачи КАК ДатаВыдачи,
			|	ДвиженияПоВыданнымСИЗ.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ДвиженияПовыданнымСИЗ
			|ИЗ
			|	&ДвиженияПоВыданнымСИЗ КАК ДвиженияПоВыданнымСИЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДвиженияПовыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_ДвиженияПовыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ДвиженияПовыданнымСИЗ.ДатаВыдачи КАК ДатаВыдачи,
			|	СУММА(ВТ_ДвиженияПовыданнымСИЗ.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ_СгруппированноеСписание
			|ИЗ
			|	ВТ_ДвиженияПовыданнымСИЗ КАК ВТ_ДвиженияПовыданнымСИЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДвиженияПовыданнымСИЗ.НормаВыдачи,
			|	ВТ_ДвиженияПовыданнымСИЗ.НоменклатураНормы,
			|	ВТ_ДвиженияПовыданнымСИЗ.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
			|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
			|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
			|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
			|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
			|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
			|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
			|ИЗ
			|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
			|			&ДатаАнализа,
			|			Организация = &Организация
			|				И Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОстатки
			|ГДЕ
			|	ВыдачаПоПотребностиОстатки.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
			|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
			|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
			|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
			|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&Период КАК Период,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	&Организация КАК Организация,
			|	&Сотрудник КАК Сотрудник,
			|	ВТ_СгруппированноеСписание.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_СгруппированноеСписание.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
			|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
			|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
			|	ВЫБОР
			|		КОГДА ВТ_СгруппированноеСписание.Количество < ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0)
			|			ТОГДА ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0) - ВТ_СгруппированноеСписание.Количество
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Количество
			|ПОМЕСТИТЬ ВТ_Расход
			|ИЗ
			|	ВТ_СгруппированноеСписание КАК ВТ_СгруппированноеСписание
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
			|		ПО ВТ_СгруппированноеСписание.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
			|			И ВТ_СгруппированноеСписание.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
			|			И ВТ_СгруппированноеСписание.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&Период КАК Период,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
			|	&Организация КАК Организация,
			|	&Сотрудник КАК Сотрудник,
			|	ВТ_СгруппированноеСписание.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_СгруппированноеСписание.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
			|	ВЫБОР
			|		КОГДА ВТ_СгруппированноеСписание.Количество = ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0)
			|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ИНАЧЕ ВТ_СгруппированноеСписание.ДатаВыдачи
			|	КОНЕЦ КАК ДатаВыдачи,
			|	0 КАК ПроцентИзноса,
			|	ВЫБОР
			|		КОГДА ВТ_СгруппированноеСписание.Количество < ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0)
			|			ТОГДА ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0) - ВТ_СгруппированноеСписание.Количество
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Количество
			|ПОМЕСТИТЬ ВТ_Приход
			|ИЗ
			|	ВТ_СгруппированноеСписание КАК ВТ_СгруппированноеСписание
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
			|		ПО ВТ_СгруппированноеСписание.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
			|			И ВТ_СгруппированноеСписание.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
			|			И ВТ_СгруппированноеСписание.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Расход.Период КАК Период,
			|	ВТ_Расход.ВидДвижения КАК ВидДвижения,
			|	ВТ_Расход.Организация КАК Организация,
			|	ВТ_Расход.Сотрудник КАК Сотрудник,
			|	ВТ_Расход.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_Расход.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_Расход.ДатаПотребности КАК ДатаПотребности,
			|	ВТ_Расход.ДатаВыдачи КАК ДатаВыдачи,
			|	ВТ_Расход.ПроцентИзноса КАК ПроцентИзноса,
			|	ВТ_Расход.Количество КАК Количество
			|ИЗ
			|	ВТ_Расход КАК ВТ_Расход
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ_Приход.Период,
			|	ВТ_Приход.ВидДвижения,
			|	ВТ_Приход.Организация,
			|	ВТ_Приход.Сотрудник,
			|	ВТ_Приход.НормаВыдачи,
			|	ВТ_Приход.НоменклатураНормы,
			|	ВТ_Приход.ДатаПотребности,
			|	ВТ_Приход.ДатаВыдачи,
			|	ВТ_Приход.ПроцентИзноса,
			|	ВТ_Приход.Количество
			|ИЗ
			|	ВТ_Приход КАК ВТ_Приход";
			
			Запрос.УстановитьПараметр("ДвиженияПоВыданнымСИЗ",	ДвиженияПоВыданнымСИЗ);
			Запрос.УстановитьПараметр("Период",					ДокументСсылка.Дата);
			Запрос.УстановитьПараметр("ДатаАнализа",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
			Запрос.УстановитьПараметр("Организация",			ДокументСсылка.Организация);
			Запрос.УстановитьПараметр("Сотрудник",				ДокументСсылка.Сотрудник);
			
		Иначе
			
			//АсТБ_Alexey_83202_********************************************************************
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДвиженияПоВыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
			|	ДвиженияПоВыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
			|	ДвиженияПоВыданнымСИЗ.ДатаВыдачи КАК ДатаВыдачи,
			|	ДвиженияПоВыданнымСИЗ.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ДвиженияПоВыданнымСИЗ
			|ИЗ
			|	&ДвиженияПоВыданнымСИЗ КАК ДвиженияПоВыданнымСИЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДвиженияПовыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_ДвиженияПовыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ДвиженияПовыданнымСИЗ.ДатаВыдачи КАК ДатаВыдачи,
			|	СУММА(ВТ_ДвиженияПовыданнымСИЗ.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ_СгруппированныеДвиженияПоВыданнымСИЗ
			|ИЗ
			|	ВТ_ДвиженияПоВыданнымСИЗ КАК ВТ_ДвиженияПовыданнымСИЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДвиженияПовыданнымСИЗ.НормаВыдачи,
			|	ВТ_ДвиженияПовыданнымСИЗ.НоменклатураНормы,
			|	ВТ_ДвиженияПовыданнымСИЗ.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвиженияПоПотребности.ВидДвижения КАК ВидДвижения,
			|	ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
			|	ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
			|	ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
			|	ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
			|	ДвиженияПоПотребности.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ДвиженияПоПотребности
			|ИЗ
			|	&ДвиженияПоПотребности КАК ДвиженияПоПотребности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
			|	ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
			|	ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
			|	ТаблицаДокумента.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
			|ИЗ
			|	&ТаблицаДокумента КАК ТаблицаДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
			|	СУММА(ВТ_ТаблицаДокумента.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ_СгруппированнаяТаблицаДокумента
			|ИЗ
			|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТаблицаДокумента.НормаВыдачи,
			|	ВТ_ТаблицаДокумента.НоменклатураНормы,
			|	ВТ_ТаблицаДокумента.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
			|	СУММА(ВТ_ТаблицаДокумента.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ_СгруппированнаяТаблицаДокументаБезНормВыдачи
			|ИЗ
			|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТаблицаДокумента.НоменклатураНормы,
			|	ВТ_ТаблицаДокумента.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
			|	СУММА(ВТ_ДвиженияПоПотребности.Количество) КАК Количество,
			|	ЕСТЬNULL(ВТ_СгруппированнаяТаблицаДокумента.ДатаВыдачи, ВТ_СгруппированнаяТаблицаДокументаБезНормВыдачи.ДатаВыдачи) КАК ДатаВыдачи,
			|	ВТ_ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса
			|ПОМЕСТИТЬ ВТ_ПотребностьРасход
			|ИЗ
			|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СгруппированнаяТаблицаДокумента КАК ВТ_СгруппированнаяТаблицаДокумента
			|		ПО ВТ_ДвиженияПоПотребности.НормаВыдачи = ВТ_СгруппированнаяТаблицаДокумента.НормаВыдачи
			|			И ВТ_ДвиженияПоПотребности.НоменклатураНормы = ВТ_СгруппированнаяТаблицаДокумента.НоменклатураНормы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СгруппированнаяТаблицаДокументаБезНормВыдачи КАК ВТ_СгруппированнаяТаблицаДокументаБезНормВыдачи
			|		ПО ВТ_ДвиженияПоПотребности.НоменклатураНормы = ВТ_СгруппированнаяТаблицаДокументаБезНормВыдачи.НоменклатураНормы
			|ГДЕ
			|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДвиженияПоПотребности.НормаВыдачи,
			|	ВТ_ДвиженияПоПотребности.НоменклатураНормы,
			|	ВТ_ДвиженияПоПотребности.ДатаПотребности,
			|	ЕСТЬNULL(ВТ_СгруппированнаяТаблицаДокумента.ДатаВыдачи, ВТ_СгруппированнаяТаблицаДокументаБезНормВыдачи.ДатаВыдачи),
			|	ВТ_ДвиженияПоПотребности.ПроцентИзноса
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
			|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
			|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
			|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
			|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
			|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
			|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
			|ИЗ
			|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
			|			&ДатаАнализа,
			|			Организация = &Организация
			|				И Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
			|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
			|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
			|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
			|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
			|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
			|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
			|	СУММА(ВТ_ВыдачаПоПотребности.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребностиБезНормыВыдачи
			|ИЗ
			|	ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ВыдачаПоПотребности.НоменклатураНормы,
			|	ВТ_ВыдачаПоПотребности.ДатаПотребности,
			|	ВТ_ВыдачаПоПотребности.ДатаВыдачи,
			|	ВТ_ВыдачаПоПотребности.ПроцентИзноса
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Период КАК Период,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	&Организация КАК Организация,
			|	&Сотрудник КАК Сотрудник,
			|	ВТ_СгруппированныеДвиженияПоВыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_СгруппированныеДвиженияПоВыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
			|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
			|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
			|	ВТ_СгруппированныеДвиженияПоВыданнымСИЗ.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ВыдачаВыдачаРасход
			|ИЗ
			|	ВТ_СгруппированныеДвиженияПоВыданнымСИЗ КАК ВТ_СгруппированныеДвиженияПоВыданнымСИЗ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
			|		ПО ВТ_СгруппированныеДвиженияПоВыданнымСИЗ.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
			|			И ВТ_СгруппированныеДвиженияПоВыданнымСИЗ.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
			|			И ВТ_СгруппированныеДвиженияПоВыданнымСИЗ.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
			|ГДЕ
			|	НЕ ВТ_ВыдачаПоПотребности.Количество ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Период КАК Период,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	&Организация КАК Организация,
			|	&Сотрудник КАК Сотрудник,
			|	ВТ_ПотребностьРасход.НормаВыдачи КАК НормаВыдачи,
			|	ВТ_ПотребностьРасход.НоменклатураНормы КАК НоменклатураНормы,
			|	ВТ_ПотребностьРасход.ДатаПотребности КАК ДатаПотребности,
			|	ЕСТЬNULL(ВТ_ВыдачаПоПотребности.ДатаВыдачи, ВТ_ВыдачаПоПотребностиБезНормыВыдачи.ДатаВыдачи) КАК ДатаВыдачи,
			|	ЕСТЬNULL(ВТ_ВыдачаПоПотребности.ПроцентИзноса, ВТ_ВыдачаПоПотребностиБезНормыВыдачи.ПроцентИзноса) КАК ПроцентИзноса,
			|	ВЫБОР
			|		КОГДА ВТ_ВыдачаПоПотребности.НоменклатураНормы ЕСТЬ NULL
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(ВТ_ВыдачаПоПотребностиБезНормыВыдачи.Количество, 0) > ВТ_ПотребностьРасход.Количество
			|						ТОГДА ВТ_ПотребностьРасход.Количество
			|					ИНАЧЕ ЕСТЬNULL(ВТ_ВыдачаПоПотребностиБезНормыВыдачи.Количество, 0)
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0) > ВТ_ПотребностьРасход.Количество
			|					ТОГДА ВТ_ПотребностьРасход.Количество
			|				ИНАЧЕ ЕСТЬNULL(ВТ_ВыдачаПоПотребности.Количество, 0)
			|			КОНЕЦ
			|	КОНЕЦ КАК Количество
			|ПОМЕСТИТЬ ВТ_ВыдачаПотребностьРасход
			|ИЗ
			|	ВТ_ПотребностьРасход КАК ВТ_ПотребностьРасход
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
			|		ПО ВТ_ПотребностьРасход.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
			|			И ВТ_ПотребностьРасход.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
			|			И ВТ_ПотребностьРасход.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
			|			И ВТ_ПотребностьРасход.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
			|			И ВТ_ПотребностьРасход.ПроцентИзноса = ВТ_ВыдачаПоПотребности.ПроцентИзноса
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребностиБезНормыВыдачи КАК ВТ_ВыдачаПоПотребностиБезНормыВыдачи
			|		ПО ВТ_ПотребностьРасход.НоменклатураНормы = ВТ_ВыдачаПоПотребностиБезНормыВыдачи.НоменклатураНормы
			|			И ВТ_ПотребностьРасход.ДатаПотребности = ВТ_ВыдачаПоПотребностиБезНормыВыдачи.ДатаПотребности
			|			И ВТ_ПотребностьРасход.ДатаВыдачи = ВТ_ВыдачаПоПотребностиБезНормыВыдачи.ДатаВыдачи
			|			И ВТ_ПотребностьРасход.ПроцентИзноса = ВТ_ВыдачаПоПотребностиБезНормыВыдачи.ПроцентИзноса
			|ГДЕ
			|	(НЕ ВТ_ВыдачаПоПотребности.Количество ЕСТЬ NULL
			|			ИЛИ НЕ ВТ_ВыдачаПоПотребностиБезНормыВыдачи.Количество ЕСТЬ NULL)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.Период, ВТ_ВыдачаВыдачаРасход.Период) КАК Период,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.ВидДвижения, ВТ_ВыдачаВыдачаРасход.ВидДвижения) КАК ВидДвижения,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.Организация, ВТ_ВыдачаВыдачаРасход.Организация) КАК Организация,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.Сотрудник, ВТ_ВыдачаВыдачаРасход.Сотрудник) КАК Сотрудник,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.НормаВыдачи, ВТ_ВыдачаВыдачаРасход.НормаВыдачи) КАК НормаВыдачи,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.НоменклатураНормы, ВТ_ВыдачаВыдачаРасход.НоменклатураНормы) КАК НоменклатураНормы,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.ДатаПотребности, ВТ_ВыдачаВыдачаРасход.ДатаПотребности) КАК ДатаПотребности,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.ДатаВыдачи, ВТ_ВыдачаВыдачаРасход.ДатаВыдачи) КАК ДатаВыдачи,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.ПроцентИзноса, ВТ_ВыдачаВыдачаРасход.ПроцентИзноса) КАК ПроцентИзноса,
			|	ЕСТЬNULL(ВТ_ВыдачаПотребностьРасход.Количество, ВТ_ВыдачаВыдачаРасход.Количество) КАК Количество
			|ИЗ
			|	ВТ_ВыдачаПотребностьРасход КАК ВТ_ВыдачаПотребностьРасход
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВыдачаВыдачаРасход КАК ВТ_ВыдачаВыдачаРасход
			|		ПО ВТ_ВыдачаПотребностьРасход.НормаВыдачи = ВТ_ВыдачаВыдачаРасход.НормаВыдачи
			|			И ВТ_ВыдачаПотребностьРасход.НоменклатураНормы = ВТ_ВыдачаВыдачаРасход.НоменклатураНормы
			|			И ВТ_ВыдачаПотребностьРасход.ДатаПотребности = ВТ_ВыдачаВыдачаРасход.ДатаПотребности
			|			И ВТ_ВыдачаПотребностьРасход.ДатаВыдачи = ВТ_ВыдачаВыдачаРасход.ДатаВыдачи
			|
			|УПОРЯДОЧИТЬ ПО
			|	Сотрудник,
			|	НормаВыдачи,
			|	НоменклатураНормы,
			|	ДатаПотребности,
			|	ДатаВыдачи,
			|	ПроцентИзноса";
			
			Запрос.УстановитьПараметр("ДвиженияПоПотребности",	ДвиженияПоПотребности);
			Запрос.УстановитьПараметр("ДвиженияПоВыданнымСИЗ",	ДвиженияПоВыданнымСИЗ);
			Запрос.УстановитьПараметр("ТаблицаДокумента",		ДокументСсылка.Товары.Выгрузить());
			Запрос.УстановитьПараметр("Период",					ДокументСсылка.Дата);
			Запрос.УстановитьПараметр("ДатаАнализа",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
			Запрос.УстановитьПараметр("Организация",			ДокументСсылка.Организация);
			Запрос.УстановитьПараметр("Сотрудник",				ДокументСсылка.Сотрудник);
			//АсТБ_Alexey_83202_********************************************************************
			
		КонецЕсли;
		
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриемНаРаботу") 
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Увольнение") 
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КадровоеПеремещение")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриказПоНормамВыдачиСИЗ")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УстановкаУсловийРаботыСотрудника") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДвиженийПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвиженийПоПотребности.Период КАК Период,
		|	ТаблицаДвиженийПоПотребности.Организация КАК Организация,
		|	ТаблицаДвиженийПоПотребности.Сотрудник КАК Сотрудник,
		|	ТаблицаДвиженийПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаДвиженийПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	НАЧАЛОПЕРИОДА(ТаблицаДвиженийПоПотребности.ДатаПотребности, ДЕНЬ) КАК ДатаПотребности,
		|	ТаблицаДвиженийПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ТаблицаДвиженийПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДвиженияПоПотребности
		|ИЗ
		|	&ТаблицаДвиженийПоПотребности КАК ТаблицаДвиженийПоПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
		|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_СоставНормы
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ВТ_ДвиженияПоПотребности.Период КАК Период,
		|	ВТ_ДвиженияПоПотребности.Организация КАК Организация,
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ДвиженияПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_РасходПоПотребности
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ВТ_ДвиженияПоПотребности.Период КАК Период,
		|	ВТ_ДвиженияПоПотребности.Организация КАК Организация,
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ДвиженияПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ПриходПоПотребности
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВыдачаПоПотребности.Период КАК Период,
		|	ТаблицаВыдачаПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ТаблицаВыдачаПоПотребности.Организация КАК Организация,
		|	ТаблицаВыдачаПоПотребности.Сотрудник КАК Сотрудник,
		|	ТаблицаВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ТаблицаВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ТаблицаВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ТаблицаВыдачаПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаВыдачаПоПотребности
		|ИЗ
		|	&ТаблицаВыдачаПоПотребности КАК ТаблицаВыдачаПоПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
		|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
		|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ВТ_СоставНормы.Ссылка
		|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА ВТ_СоставНормы.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыдачаПоПотребностиОстатки.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов * 12)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыдачаПоПотребностиОстатки.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов)
		|			КОНЕЦ, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОстатки.Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|	ВложенныйЗапрос.НормаВыдачи КАК НормаВыдачи,
		|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОбороты.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОбороты.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребностиОбороты.ПроцентИзноса КАК ПроцентИзноса,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|				ТОГДА ВЫБОР
		|						КОГДА ПОДСТРОКА(ВыдачаПоПотребностиОбороты.Регистратор.Комментарий, 1, 23) = ""#РасчетПоДатеДокумента#""
		|							ТОГДА ВыдачаПоПотребностиОбороты.Период
		|						ИНАЧЕ ВыдачаПоПотребностиОбороты.ДатаВыдачи
		|					КОНЕЦ
		|			ИНАЧЕ ВыдачаПоПотребностиОбороты.Период
		|		КОНЕЦ) КАК ДатаДокумента
		|ПОМЕСТИТЬ ВТ_ПоследнийПриходВыдачиПоПотребности
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВыдачаПоПотребностиОбороты.Сотрудник КАК Сотрудник,
		|		ВыдачаПоПотребностиОбороты.НормаВыдачи КАК НормаВыдачи,
		|		ВыдачаПоПотребностиОбороты.НоменклатураНормы КАК НоменклатураНормы,
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|					ТОГДА ВЫБОР
		|							КОГДА ПОДСТРОКА(ВыдачаПоПотребностиОбороты.Регистратор.Комментарий, 1, 23) = ""#РасчетПоДатеДокумента#""
		|								ТОГДА ВыдачаПоПотребностиОбороты.Период
		|							ИНАЧЕ ВыдачаПоПотребностиОбороты.ДатаВыдачи
		|						КОНЕЦ
		|				ИНАЧЕ ВыдачаПоПотребностиОбороты.Период
		|			КОНЕЦ) КАК ДатаДокумента
		|	ИЗ
		|		РегистрНакопления.ВыдачаПоПотребности.Обороты(
		|				,
		|				&ДатаАнализа,
		|				Регистратор,
		|				Организация = &Организация
		|					И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОбороты
		|	ГДЕ
		|		НЕ ВыдачаПоПотребностиОбороты.КоличествоПриход = 0
		|		И НЕ НАЧАЛОПЕРИОДА(ВыдачаПоПотребностиОбороты.Период, ДЕНЬ) = ВыдачаПоПотребностиОбороты.ДатаПотребности
		|		И НЕ ВыдачаПоПотребностиОбороты.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		И НЕ(ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.УстановкаПериодаЗимы
		|					ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ОтсутствиеНаРабочемМесте
		|					ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ПереносЗимнейПотребности)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВыдачаПоПотребностиОбороты.Сотрудник,
		|		ВыдачаПоПотребностиОбороты.НормаВыдачи,
		|		ВыдачаПоПотребностиОбороты.НоменклатураНормы) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаПоПотребности.Обороты(
		|				,
		|				&ДатаАнализа,
		|				Регистратор,
		|				Организация = &Организация
		|					И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОбороты
		|		ПО ВложенныйЗапрос.Сотрудник = ВыдачаПоПотребностиОбороты.Сотрудник
		|			И ВложенныйЗапрос.НормаВыдачи = ВыдачаПоПотребностиОбороты.НормаВыдачи
		|			И ВложенныйЗапрос.НоменклатураНормы = ВыдачаПоПотребностиОбороты.НоменклатураНормы
		|			И ВложенныйЗапрос.ДатаДокумента = ВыдачаПоПотребностиОбороты.Период
		|ГДЕ
		|	НЕ ВыдачаПоПотребностиОбороты.КоличествоПриход = 0
		|	И НЕ НАЧАЛОПЕРИОДА(ВыдачаПоПотребностиОбороты.Период, ДЕНЬ) = ВыдачаПоПотребностиОбороты.ДатаПотребности
		|	И НЕ(ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.УстановкаПериодаЗимы
		|				ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ОтсутствиеНаРабочемМесте
		|				ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ПереносЗимнейПотребности)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОбороты.ДатаПотребности,
		|	ВыдачаПоПотребностиОбороты.ДатаВыдачи,
		|	ВыдачаПоПотребностиОбороты.ПроцентИзноса,
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.НормаВыдачи,
		|	ВложенныйЗапрос.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасходПоПотребности.Период КАК Период,
		|	ВТ_РасходПоПотребности.Организация КАК Организация,
		|	ВТ_РасходПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_РасходПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_РасходПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_РасходПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ВыдачаПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребностиРасход
		|ИЗ
		|	ВТ_РасходПоПотребности КАК ВТ_РасходПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
		|		ПО ВТ_РасходПоПотребности.Сотрудник = ВТ_ВыдачаПоПотребности.Сотрудник
		|			И ВТ_РасходПоПотребности.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_РасходПоПотребности.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_РасходПоПотребности.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
		|			И ВТ_РасходПоПотребности.ПроцентИзноса = ВТ_ВыдачаПоПотребности.ПроцентИзноса
		|ГДЕ
		|	НЕ ВТ_ВыдачаПоПотребности.Количество ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПриходПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ВТ_ПриходПоПотребности.Период КАК Период,
		|	ВТ_ПриходПоПотребности.Организация КАК Организация,
		|	ВТ_ПриходПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ПриходПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ПриходПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ПриходПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ПриходПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ПриходПоПотребности.Количество КАК Количество,
		|	ВТ_ТаблицаВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребностиПриход
		|ИЗ
		|	ВТ_ПриходПоПотребности КАК ВТ_ПриходПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаВыдачаПоПотребности КАК ВТ_ТаблицаВыдачаПоПотребности
		|		ПО ВТ_ПриходПоПотребности.Сотрудник = ВТ_ТаблицаВыдачаПоПотребности.Сотрудник
		|			И ВТ_ПриходПоПотребности.НормаВыдачи = ВТ_ТаблицаВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_ПриходПоПотребности.НоменклатураНормы = ВТ_ТаблицаВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_ПриходПоПотребности.ДатаПотребности = ВТ_ТаблицаВыдачаПоПотребности.ДатаПотребности
		|			И ВТ_ПриходПоПотребности.ПроцентИзноса = ВТ_ТаблицаВыдачаПоПотребности.ПроцентИзноса
		|			И ВТ_ПриходПоПотребности.ВидДвижения = ВТ_ТаблицаВыдачаПоПотребности.ВидДвижения
		|ГДЕ
		|	НЕ ВТ_ТаблицаВыдачаПоПотребности.Количество ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыдачаПоПотребностиРасход.Период КАК Период,
		|	ВТ_ВыдачаПоПотребностиРасход.Организация КАК Организация,
		|	ЕСТЬNULL(ВТ_ПоследнийПриходВыдачиПоПотребности.Сотрудник, ВТ_ПоследнийПриходВыдачиПоПотребности1.Сотрудник) КАК Сотрудник,
		|	ВТ_ВыдачаПоПотребностиРасход.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыдачаПоПотребностиРасход.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыдачаПоПотребностиРасход.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ВыдачаПоПотребностиРасход.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыдачаПоПотребностиРасход.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ВыдачаПоПотребностиРасход.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВТ_ПоследнийПриходВыдачиПоПотребности1.ДатаДокумента) КАК ДатаДокумента,
		|	ЕСТЬNULL(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаПотребности, ВТ_ПоследнийПриходВыдачиПоПотребности1.ДатаПотребности) КАК ДатаПотребностиДляРасчетаПроцентаИзноса
		|ПОМЕСТИТЬ ВТ_ОстальныеДвижения
		|ИЗ
		|	ВТ_ВыдачаПоПотребностиРасход КАК ВТ_ВыдачаПоПотребностиРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаВыдачаПоПотребности КАК ВТ_ТаблицаВыдачаПоПотребности
		|		ПО ВТ_ВыдачаПоПотребностиРасход.Сотрудник = ВТ_ТаблицаВыдачаПоПотребности.Сотрудник
		|			И ВТ_ВыдачаПоПотребностиРасход.НормаВыдачи = ВТ_ТаблицаВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_ВыдачаПоПотребностиРасход.НоменклатураНормы = ВТ_ТаблицаВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_ВыдачаПоПотребностиРасход.ДатаПотребности = ВТ_ТаблицаВыдачаПоПотребности.ДатаПотребности
		|			И ВТ_ВыдачаПоПотребностиРасход.ДатаВыдачи = ВТ_ТаблицаВыдачаПоПотребности.ДатаВыдачи
		|			И ВТ_ВыдачаПоПотребностиРасход.ПроцентИзноса = ВТ_ТаблицаВыдачаПоПотребности.ПроцентИзноса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнийПриходВыдачиПоПотребности КАК ВТ_ПоследнийПриходВыдачиПоПотребности
		|		ПО ВТ_ВыдачаПоПотребностиРасход.Сотрудник = ВТ_ПоследнийПриходВыдачиПоПотребности.Сотрудник
		|			И ВТ_ВыдачаПоПотребностиРасход.НормаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.НормаВыдачи
		|			И ВТ_ВыдачаПоПотребностиРасход.НоменклатураНормы = ВТ_ПоследнийПриходВыдачиПоПотребности.НоменклатураНормы
		|			И ВТ_ВыдачаПоПотребностиРасход.ДатаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаВыдачи
		|			И ВТ_ВыдачаПоПотребностиРасход.ПроцентИзноса = ВТ_ПоследнийПриходВыдачиПоПотребности.ПроцентИзноса
		|			И ВТ_ВыдачаПоПотребностиРасход.ДатаПотребности = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнийПриходВыдачиПоПотребности КАК ВТ_ПоследнийПриходВыдачиПоПотребности1
		|		ПО ВТ_ВыдачаПоПотребностиРасход.Сотрудник = ВТ_ПоследнийПриходВыдачиПоПотребности1.Сотрудник
		|			И ВТ_ВыдачаПоПотребностиРасход.НормаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности1.НормаВыдачи
		|			И ВТ_ВыдачаПоПотребностиРасход.НоменклатураНормы = ВТ_ПоследнийПриходВыдачиПоПотребности1.НоменклатураНормы
		|			И ВТ_ВыдачаПоПотребностиРасход.ДатаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности1.ДатаВыдачи
		|			И ВТ_ВыдачаПоПотребностиРасход.ПроцентИзноса = ВТ_ПоследнийПриходВыдачиПоПотребности1.ПроцентИзноса
		|ГДЕ
		|	ВТ_ТаблицаВыдачаПоПотребности.Количество ЕСТЬ NULL
		|	И НЕ ЕСТЬNULL(ВТ_ПоследнийПриходВыдачиПоПотребности.Сотрудник, ВТ_ПоследнийПриходВыдачиПоПотребности1.Сотрудник) ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТ_ОстальныеДвижения.Количество КАК Количество,
		|	ВТ_ОстальныеДвижения.Период КАК Период,
		|	ВТ_ОстальныеДвижения.Организация КАК Организация,
		|	ВТ_ОстальныеДвижения.Сотрудник КАК Сотрудник,
		|	ВТ_ОстальныеДвижения.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ОстальныеДвижения.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстальныеДвижения.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ОстальныеДвижения.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстальныеДвижения.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ОстальныеДвиженияРасходПриход
		|ИЗ
		|	ВТ_ОстальныеДвижения КАК ВТ_ОстальныеДвижения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВТ_ОстальныеДвижения.Количество,
		|	ВТ_ОстальныеДвижения.Период,
		|	ВТ_ОстальныеДвижения.Организация,
		|	ВТ_ОстальныеДвижения.Сотрудник,
		|	ВТ_ОстальныеДвижения.НормаВыдачи,
		|	ВТ_ОстальныеДвижения.НоменклатураНормы,
		|	ВЫБОР
		|		КОГДА ВТ_ВыдачаПоПотребностиПриход.ДатаПотребности ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ ВТ_ВыдачаПоПотребностиПриход.ДатаПотребности
		|	КОНЕЦ,
		|	ВТ_ОстальныеДвижения.ДатаВыдачи,
		|	ВТ_ОстальныеДвижения.ПроцентИзноса
		|ИЗ
		|	ВТ_ОстальныеДвижения КАК ВТ_ОстальныеДвижения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребностиПриход КАК ВТ_ВыдачаПоПотребностиПриход
		|		ПО ВТ_ОстальныеДвижения.Сотрудник = ВТ_ВыдачаПоПотребностиПриход.Сотрудник
		|			И ВТ_ОстальныеДвижения.НормаВыдачи = ВТ_ВыдачаПоПотребностиПриход.НормаВыдачи
		|			И ВТ_ОстальныеДвижения.НоменклатураНормы = ВТ_ВыдачаПоПотребностиПриход.НоменклатураНормы
		|			И ВТ_ОстальныеДвижения.ДатаВыдачи = ВТ_ВыдачаПоПотребностиПриход.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстальныеДвиженияРасходПриход.ВидДвижения КАК ВидДвижения,
		|	ВТ_ОстальныеДвиженияРасходПриход.Количество КАК Количество,
		|	ВТ_ОстальныеДвиженияРасходПриход.Период КАК Период,
		|	ВТ_ОстальныеДвиженияРасходПриход.Организация КАК Организация,
		|	ВТ_ОстальныеДвиженияРасходПриход.Сотрудник КАК Сотрудник,
		|	ВТ_ОстальныеДвиженияРасходПриход.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ОстальныеДвиженияРасходПриход.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстальныеДвиженияРасходПриход.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ОстальныеДвиженияРасходПриход.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстальныеДвиженияРасходПриход.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	ВТ_ОстальныеДвиженияРасходПриход КАК ВТ_ОстальныеДвиженияРасходПриход
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаВыдачаПоПотребности.ВидДвижения,
		|	ВТ_ТаблицаВыдачаПоПотребности.Количество,
		|	ВТ_ТаблицаВыдачаПоПотребности.Период,
		|	ВТ_ТаблицаВыдачаПоПотребности.Организация,
		|	ВТ_ТаблицаВыдачаПоПотребности.Сотрудник,
		|	ВТ_ТаблицаВыдачаПоПотребности.НормаВыдачи,
		|	ВТ_ТаблицаВыдачаПоПотребности.НоменклатураНормы,
		|	ВТ_ТаблицаВыдачаПоПотребности.ДатаПотребности,
		|	ВТ_ТаблицаВыдачаПоПотребности.ДатаВыдачи,
		|	ВТ_ТаблицаВыдачаПоПотребности.ПроцентИзноса
		|ИЗ
		|	ВТ_ТаблицаВыдачаПоПотребности КАК ВТ_ТаблицаВыдачаПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ТаблицаВыдачаПоПотребности.Сотрудник КАК Сотрудник,
		|			ВТ_ТаблицаВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|			ВТ_ТаблицаВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаВыдачаПоПотребности.ДатаПотребности) КАК КоличествоРазличных_ДатаПотребности,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаВыдачаПоПотребности.НормаВыдачи) КАК КоличествоРазличных_НормаВыдачи
		|		ИЗ
		|			ВТ_ТаблицаВыдачаПоПотребности КАК ВТ_ТаблицаВыдачаПоПотребности
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ТаблицаВыдачаПоПотребности.Сотрудник,
		|			ВТ_ТаблицаВыдачаПоПотребности.НоменклатураНормы,
		|			ВТ_ТаблицаВыдачаПоПотребности.ДатаВыдачи) КАК ВложенныйЗапрос
		|		ПО ВТ_ТаблицаВыдачаПоПотребности.Сотрудник = ВложенныйЗапрос.Сотрудник
		|			И ВТ_ТаблицаВыдачаПоПотребности.НоменклатураНормы = ВложенныйЗапрос.НоменклатураНормы
		|			И ВТ_ТаблицаВыдачаПоПотребности.ДатаВыдачи = ВложенныйЗапрос.ДатаВыдачи
		|ГДЕ
		|	(ВложенныйЗапрос.КоличествоРазличных_ДатаПотребности > 1
		|			ИЛИ ВложенныйЗапрос.КоличествоРазличных_НормаВыдачи > 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Результат.Период КАК Период,
		|	ВТ_Результат.ВидДвижения КАК ВидДвижения,
		|	ВТ_Результат.Организация КАК Организация,
		|	ВТ_Результат.Сотрудник КАК Сотрудник,
		|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_Результат.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_Результат.Количество КАК Количество
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	НормаВыдачи,
		|	НоменклатураНормы,
		|	ДатаПотребности,
		|	ДатаВыдачи,
		|	ПроцентИзноса,
		|	ВидДвижения УБЫВ";
		
		Запрос.УстановитьПараметр("ТаблицаДвиженийПоПотребности",	ДвиженияПоПотребности);
		Запрос.УстановитьПараметр("ТаблицаВыдачаПоПотребности",		ТаблицаВыдачаПоПотребности);
		Запрос.УстановитьПараметр("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Период",							ДокументСсылка.Дата);
		Запрос.УстановитьПараметр("Организация",					ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("МассивСотрудников",				ДвиженияПоПотребности.ВыгрузитьКолонку("Сотрудник"));
		
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УстановкаПериодаЗимы") 
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтсутствиеНаРабочемМесте")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПереносЗимнейПотребности")Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДвиженийПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвиженийПоПотребности.Период КАК Период,
		|	ТаблицаДвиженийПоПотребности.Организация КАК Организация,
		|	ТаблицаДвиженийПоПотребности.Сотрудник КАК Сотрудник,
		|	ТаблицаДвиженийПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаДвиженийПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаДвиженийПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ТаблицаДвиженийПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ТаблицаДвиженийПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДвиженияПоПотребности
		|ИЗ
		|	&ТаблицаДвиженийПоПотребности КАК ТаблицаДвиженийПоПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
		|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОстатки.Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТ_ДвиженияПоПотребности.Организация КАК Организация,
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ДвиженияПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВЫБОР
		|		КОГДА ВТ_ДвиженияПоПотребности.Количество > ВТ_ВыдачаПоПотребности.Количество
		|			ТОГДА ВТ_ВыдачаПоПотребности.Количество
		|		ИНАЧЕ ВТ_ДвиженияПоПотребности.Количество
		|	КОНЕЦ КАК Количество
		|ПОМЕСТИТЬ ВТ_РасходПоПотребности
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
		|		ПО ВТ_ДвиженияПоПотребности.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
		|			И ВТ_ДвиженияПоПотребности.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
		|			И ВТ_ДвиженияПоПотребности.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
		|			И ВТ_ДвиженияПоПотребности.Сотрудник = ВТ_ВыдачаПоПотребности.Сотрудник
		|			И ВТ_ДвиженияПоПотребности.ПроцентИзноса = ВТ_ВыдачаПоПотребности.ПроцентИзноса
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ВТ_ВыдачаПоПотребности.Количество ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	МАКСИМУМ(ВТ_ДвиженияПоПотребности.ДатаПотребности) КАК ДатаПотребности,
		|	ВТ_ДвиженияПоПотребности.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаПотребностиПоПриходу
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДвиженияПоПотребности.Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы,
		|	ВТ_ДвиженияПоПотребности.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоПотребности.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТ_ДвиженияПоПотребности.Организация КАК Организация,
		|	ВТ_ДвиженияПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ДвиженияПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ДвиженияПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	НАЧАЛОПЕРИОДА(ВТ_МаксимальнаяДатаПотребностиПоПриходу.ДатаПотребности, ДЕНЬ) КАК ДатаПотребности,
		|	НАЧАЛОПЕРИОДА(ВТ_РасходПоПотребности.ДатаВыдачи, ДЕНЬ) КАК ДатаВыдачи,
		|	ВТ_РасходПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_РасходПоПотребности.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ПриходПоПотребности
		|ИЗ
		|	ВТ_ДвиженияПоПотребности КАК ВТ_ДвиженияПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходПоПотребности КАК ВТ_РасходПоПотребности
		|		ПО ВТ_ДвиженияПоПотребности.Сотрудник = ВТ_РасходПоПотребности.Сотрудник
		|			И ВТ_ДвиженияПоПотребности.НормаВыдачи = ВТ_РасходПоПотребности.НормаВыдачи
		|			И ВТ_ДвиженияПоПотребности.НоменклатураНормы = ВТ_РасходПоПотребности.НоменклатураНормы
		|			И ВТ_ДвиженияПоПотребности.ПроцентИзноса = ВТ_РасходПоПотребности.ПроцентИзноса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальнаяДатаПотребностиПоПриходу КАК ВТ_МаксимальнаяДатаПотребностиПоПриходу
		|		ПО ВТ_ДвиженияПоПотребности.Сотрудник = ВТ_МаксимальнаяДатаПотребностиПоПриходу.Сотрудник
		|			И ВТ_ДвиженияПоПотребности.НормаВыдачи = ВТ_МаксимальнаяДатаПотребностиПоПриходу.НормаВыдачи
		|			И ВТ_ДвиженияПоПотребности.НоменклатураНормы = ВТ_МаксимальнаяДатаПотребностиПоПриходу.НоменклатураНормы
		|			И ВТ_ДвиженияПоПотребности.ПроцентИзноса = ВТ_МаксимальнаяДатаПотребностиПоПриходу.ПроцентИзноса
		|ГДЕ
		|	ВТ_ДвиженияПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ ВТ_РасходПоПотребности.Количество ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасходПоПотребности.Период КАК Период,
		|	ВТ_РасходПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ВТ_РасходПоПотребности.Организация КАК Организация,
		|	ВТ_РасходПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_РасходПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_РасходПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_РасходПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_РасходПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_РасходПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_РасходПоПотребности.Количество КАК Количество
		|ИЗ
		|	ВТ_РасходПоПотребности КАК ВТ_РасходПоПотребности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПриходПоПотребности.Период КАК Период,
		|	ВТ_ПриходПоПотребности.ВидДвижения КАК ВидДвижения,
		|	ВТ_ПриходПоПотребности.Организация КАК Организация,
		|	ВТ_ПриходПоПотребности.Сотрудник КАК Сотрудник,
		|	ВТ_ПриходПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ПриходПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ПриходПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ПриходПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ПриходПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ПриходПоПотребности.Количество КАК Количество
		|ИЗ
		|	ВТ_ПриходПоПотребности КАК ВТ_ПриходПоПотребности
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	НормаВыдачи,
		|	НоменклатураНормы,
		|	ДатаПотребности УБЫВ";
		
		Запрос.УстановитьПараметр("ТаблицаДвиженийПоПотребности",	ДвиженияПоПотребности);
		Запрос.УстановитьПараметр("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",					ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("МассивСотрудников",				ДвиженияПоПотребности.ВыгрузитьКолонку("Сотрудник"));
		
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаРасхода = Результат[5].Выгрузить();
		ТаблицаПрихода = Результат[6].Выгрузить();
		
		ТаблицаДвижений = ТаблицаРасхода.Скопировать();
		
		//могут быть лишние движения по приходу
		//нужно приходовать количество в соответствии с расходом
		ТаблицаРасхода.Свернуть("Сотрудник, НормаВыдачи, НоменклатураНормы","Количество");
		
		Для Каждого СтрокаТаблицыПрихода Из ТаблицаПрихода Цикл
			
			СтруктураПоиска = Новый Структура("Сотрудник, НормаВыдачи, НоменклатураНормы", СтрокаТаблицыПрихода.Сотрудник, СтрокаТаблицыПрихода.НормаВыдачи, СтрокаТаблицыПрихода.НоменклатураНормы);
			
			НайденнаяСтрока = ТаблицаРасхода.НайтиСтроки(СтруктураПоиска)[0];
			
			Если НайденнаяСтрока.Количество >= СтрокаТаблицыПрихода.Количество Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(),СтрокаТаблицыПрихода);
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - СтрокаТаблицыПрихода.Количество;
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаДвижений.Свернуть("Период,ВидДвижения,Организация,Сотрудник,НормаВыдачи,НоменклатураНормы,ДатаПотребности,ДатаВыдачи,ПроцентИзноса","Количество");
	ТаблицаДвижений.Сортировать("Сотрудник Возр,НормаВыдачи Возр,НоменклатураНормы Возр,ВидДвижения Убыв,ДатаПотребности Возр,ДатаВыдачи Возр,ПроцентИзноса Возр");
	
КонецПроцедуры

// функция возвращает таблицу исходной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Количество выданных | Это зима | Процент износа |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,МассивСотрудников,ВидВыдачиСИЗ)
//
Функция ПолучитьИсходнуюПотребность(СтруктураОтбора) Экспорт
	
	Перем МассивНоменклатурыНорм;
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	ВидВыдачиСИЗ						= СтруктураОтбора.ВидВыдачиСИЗ;
	НеИспользоватьФильтрПоВидуВыдачи	= (ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
	
	СтруктураОтбора.Свойство("МассивНоменклатурыНорм",МассивНоменклатурыНорм);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"),,МассивНоменклатурыНорм);
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))
	|				И (НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|					ИЛИ &НеИспользоватьФильтрПоВидуВыдачи)) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_НормыСПотребностью
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))
	|				И (НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|					ИЛИ &НеИспользоватьФильтрПоВидуВыдачи)) КАК ВыдачаПоПотребностиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВТ_ВыдачаПоПотребности.КоличествоВыдано) КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребностиПолная
	|ИЗ
	|	ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаПоПотребности.Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСПотребностью.Сотрудник КАК Сотрудник,
	|	ВТ_НормыСПотребностью.Подразделение КАК Подразделение,
	|	ВТ_НормыСПотребностью.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_НормыСПотребностью.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСПотребностью.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_НормыСПотребностью.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_НормыСПотребностью.КоличествоПотребность - ЕСТЬNULL(ВТ_ВыдачаПоПотребностиПолная.КоличествоВыдано, 0) КАК КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	0 КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьБезВыдачи
	|ИЗ
	|	ВТ_НормыСПотребностью КАК ВТ_НормыСПотребностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребностиПолная КАК ВТ_ВыдачаПоПотребностиПолная
	|		ПО ВТ_НормыСПотребностью.Сотрудник = ВТ_ВыдачаПоПотребностиПолная.Сотрудник
	|			И ВТ_НормыСПотребностью.НормаВыдачи = ВТ_ВыдачаПоПотребностиПолная.НормаВыдачи
	|			И ВТ_НормыСПотребностью.НоменклатураНормы = ВТ_ВыдачаПоПотребностиПолная.НоменклатураНормы
	|			И ВТ_НормыСПотребностью.ДатаПотребности = ВТ_ВыдачаПоПотребностиПолная.ДатаПотребности
	|ГДЕ
	|	ВТ_НормыСПотребностью.КоличествоПотребность - ЕСТЬNULL(ВТ_ВыдачаПоПотребностиПолная.КоличествоВыдано, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСПотребностью.Сотрудник КАК Сотрудник,
	|	ВТ_НормыСПотребностью.Подразделение КАК Подразделение,
	|	ВТ_НормыСПотребностью.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_НормыСПотребностью.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСПотребностью.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_НормыСПотребностью.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.КоличествоВыдано > ВТ_НормыСПотребностью.КоличествоПотребность
	|			ТОГДА ВТ_НормыСПотребностью.КоличествоПотребность
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.КоличествоВыдано
	|	КОНЕЦ КАК КоличествоПотребность,
	|	ВТ_ВыдачаПоПотребности.КоличествоВыдано КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ПотребностьСВыдачей
	|ИЗ
	|	ВТ_НормыСПотребностью КАК ВТ_НормыСПотребностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|		ПО ВТ_НормыСПотребностью.Сотрудник = ВТ_ВыдачаПоПотребности.Сотрудник
	|			И ВТ_НормыСПотребностью.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
	|			И ВТ_НормыСПотребностью.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
	|			И ВТ_НормыСПотребностью.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
	|ГДЕ
	|	НЕ ВТ_ВыдачаПоПотребности.ПроцентИзноса ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьБезВыдачи.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьБезВыдачи.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьБезВыдачи.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПотребностьБезВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьБезВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьБезВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьБезВыдачи.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьБезВыдачи.КоличествоВыдано КАК КоличествоВыдано,
	|	ВТ_ПотребностьБезВыдачи.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ВсяПотребность
	|ИЗ
	|	ВТ_ПотребностьБезВыдачи КАК ВТ_ПотребностьБезВыдачи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСВыдачей.Сотрудник,
	|	ВТ_ПотребностьСВыдачей.Подразделение,
	|	ВТ_ПотребностьСВыдачей.ЭтоЗима,
	|	ВТ_ПотребностьСВыдачей.НормаВыдачи,
	|	ВТ_ПотребностьСВыдачей.НоменклатураНормы,
	|	ВТ_ПотребностьСВыдачей.ДатаПотребности,
	|	ВТ_ПотребностьСВыдачей.КоличествоПотребность,
	|	ВТ_ПотребностьСВыдачей.КоличествоВыдано,
	|	ВТ_ПотребностьСВыдачей.ПроцентИзноса
	|ИЗ
	|	ВТ_ПотребностьСВыдачей КАК ВТ_ПотребностьСВыдачей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_ВсяПотребность.Подразделение КАК Подразделение,
	|	ВТ_ВсяПотребность.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ВсяПотребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВсяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВсяПотребность.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВТ_ВсяПотребность.КоличествоПотребность) КАК КоличествоПотребность,
	|	СУММА(ВТ_ВсяПотребность.КоличествоВыдано) КАК КоличествоВыдано,
	|	ВТ_ВсяПотребность.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ВсяПотребность КАК ВТ_ВсяПотребность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсяПотребность.Сотрудник,
	|	ВТ_ВсяПотребность.Подразделение,
	|	ВТ_ВсяПотребность.ЭтоЗима,
	|	ВТ_ВсяПотребность.НормаВыдачи,
	|	ВТ_ВсяПотребность.НоменклатураНормы,
	|	ВТ_ВсяПотребность.ДатаПотребности,
	|	ВТ_ВсяПотребность.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсяПотребность.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_ВсяПотребность КАК ВТ_ВсяПотребность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсяПотребность.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_ВсяПотребность КАК ВТ_ВсяПотребность";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоВидуВыдачи",	НеИспользоватьФильтрПоВидуВыдачи);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",						ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("НачалоТекущегоМесяца",				НачалоМесяца(ДатаАнализа.Значение.Дата));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[8].Выгрузить();
	ТаблицаПодразделений 	= Результат[9].Выгрузить();
	ТаблицаДатПотребности 	= Результат[10].Выгрузить();
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.ДатаНачалаЗимы,
	|	ТаблицаЗимы.ДатаОкончанияЗимы,
	|	ТаблицаЗимы.ДатаПериода,
	|	ТаблицаЗимы.Подразделение
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник,
	|	ТаблицаПотребности.Подразделение,
	|	ТаблицаПотребности.НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы,
	|	ТаблицаПотребности.ДатаПотребности,
	|	ТаблицаПотребности.ЭтоЗима,
	|	ТаблицаПотребности.ПроцентИзноса,
	|	ТаблицаПотребности.КоличествоПотребность,
	|	ТаблицаПотребности.КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаПотребности.ДатаПотребности КАК ДатаПотребности,
	|	МИНИМУМ(ВТ_ТаблицаПотребности.ЭтоЗима) КАК ЭтоЗима,
	|	ВТ_ТаблицаПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	МАКСИМУМ(ВТ_ТаблицаПотребности.КоличествоПотребность) КАК КоличествоПотребность,
	|	МАКСИМУМ(ВТ_ТаблицаПотребности.КоличествоВыдано) КАК КоличествоВыдано,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ТаблицаПотребности.ДатаПотребности = ВТ_ТаблицаЗимы.ДатаПериода
	|			И ВТ_ТаблицаПотребности.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаПотребности.Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы,
	|	ВТ_ТаблицаПотребности.ДатаПотребности,
	|	ВТ_ТаблицаПотребности.ПроцентИзноса,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",		ТаблицаЗимы);
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Количество выданных | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,МассивСотрудников,ДокументСсылка)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуВыдачиСИЗ(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ДокументСсылка 						= СтруктураОтбора.ДокументСсылка;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ПодобранныеНормы.ТипПериода КАК ТипПериода,
	|	ПодобранныеНормы.КоличествоПериодов КАК КоличествоПериодов,
	|	ПодобранныеНормы.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПодобранныеНормы.ТипПериода КАК ТипПериода,
	|	ВТ_ПодобранныеНормы.КоличествоПериодов КАК КоличествоПериодов,
	|	ВТ_ПодобранныеНормы.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ КАК НормыВыдачиСИЗ
	|		ПО ВТ_ПодобранныеНормы.НормаВыдачи = НормыВыдачиСИЗ.Ссылка
	|ГДЕ
	|	НормыВыдачиСИЗ.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса.Код
	|	КОНЕЦ КАК ПроцентИзноса,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано КАК НеВыдано,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте КАК КоличествоВКомплекте
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_ТаблицаДокумента.Количество) КАК КоличествоСумма,
	|	МАКСИМУМ(ВТ_ТаблицаДокумента.Количество) КАК КоличествоМаксимум,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ГруппировкаТаблицыДокументаПоНорме
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокумента.НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	0 КАК КоличествоВыдано,
	|	ВТ_Потребность.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|	0 КАК ПроцентИзноса,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.ТипПериода КАК ТипПериода,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ИЗ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи КАК ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_Потребность.Сотрудник
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи = ВТ_Потребность.НормаВыдачи
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_Потребность.ДатаПотребности ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаПотребности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_ТаблицаДокумента.КоличествоВКомплекте = 0
	|				ТОГДА ВТ_ГруппировкаТаблицыДокументаПоНорме.КоличествоСумма
	|			ИНАЧЕ ВТ_ГруппировкаТаблицыДокументаПоНорме.КоличествоМаксимум
	|		КОНЕЦ) КАК КоличествоВыдано,
	|	МАКСИМУМ(ВТ_ТаблицаДокумента.КоличествоПотребность) КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокумента.НеВыдано КАК НеВыдано,
	|	ВТ_ГруппировкаТаблицыДокументаПоНорме.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппировкаТаблицыДокументаПоНорме КАК ВТ_ГруппировкаТаблицыДокументаПоНорме
	|		ПО ВТ_ТаблицаДокумента.Сотрудник = ВТ_ГруппировкаТаблицыДокументаПоНорме.Сотрудник
	|			И ВТ_ТаблицаДокумента.НормаВыдачи = ВТ_ГруппировкаТаблицыДокументаПоНорме.НормаВыдачи
	|			И ВТ_ТаблицаДокумента.НоменклатураНормы = ВТ_ГруппировкаТаблицыДокументаПоНорме.НоменклатураНормы
	|			И ВТ_ТаблицаДокумента.ДатаВыдачи = ВТ_ГруппировкаТаблицыДокументаПоНорме.ДатаВыдачи
	|			И ВТ_ТаблицаДокумента.ПроцентИзноса = ВТ_ГруппировкаТаблицыДокументаПоНорме.ПроцентИзноса
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.НеВыдано,
	|	ВТ_ГруппировкаТаблицыДокументаПоНорме.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи КАК ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи";
	
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Ссылка",								ДокументСсылка);   
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",						ДокументСсылка.ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаНорм 			= Результат[5].Выгрузить();
	ТаблицаВыдачи			= Результат[6].Выгрузить();
	ТаблицаПодразделений 	= Результат[7].Выгрузить();
	
	//создаем пустую таблицу для заполнения (структура поиска такова, что заведомо возвращает пустую таблицу)
	ТаблицаКонечнойПотребности = ТаблицаНорм.Скопировать(НОВЫЙ Структура("Сотрудник",""),"Сотрудник, Подразделение, ЭтоЗима, НормаВыдачи, НоменклатураНормы, КоличествоВыдано, КоличествоПотребность, ДатаПотребности, ПроцентИзноса");
	
	//определяем дату потребности с учетом выдачи и заполняем пустую таблицу
	Для Каждого СтрокаТаблицыНорм Из ТаблицаНорм Цикл
		
		СтруктураПоиска = Новый Структура("Сотрудник, НормаВыдачи, НоменклатураНормы, ДатаПотребности",
		СтрокаТаблицыНорм.Сотрудник,СтрокаТаблицыНорм.НормаВыдачи,СтрокаТаблицыНорм.НоменклатураНормы,СтрокаТаблицыНорм.ДатаПотребности);
		
		НайденныеСтроки = ТаблицаВыдачи.НайтиСтроки(СтруктураПоиска);					
		
		Если НайденныеСтроки.Количество() = 0 Тогда //потребность не двигаем
			
			НоваяСтрока = ТаблицаКонечнойПотребности.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыНорм);
			
		Иначе
			
			Если НайденныеСтроки[0].НеВыдано Тогда //потребность не двигаем
				
				НоваяСтрока = ТаблицаКонечнойПотребности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыНорм);
				
			Иначе
				
				Если НайденныеСтроки[0].КоличествоВыдано < НайденныеСтроки[0].КоличествоПотребность Тогда //неполная выдача
					
					//остаток по потребности оставляем на месте
					НоваяСтрока = ТаблицаКонечнойПотребности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыНорм);
					НоваяСтрока.КоличествоПотребность = НайденныеСтроки[0].КоличествоПотребность - НайденныеСтроки[0].КоличествоВыдано;
					НоваяСтрока.КоличествоВыдано = 0;
					
					//выдачу двигаем вперед
					НоваяСтрока = ТаблицаКонечнойПотребности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыНорм);
					НоваяСтрока.КоличествоПотребность = НайденныеСтроки[0].КоличествоВыдано;
					Если НайденныеСтроки[0].ПроцентИзноса = 0 Тогда
						НоваяСтрока.ДатаПотребности = ДобавитьМесяц(ДатаДокумента,?(СтрокаТаблицыНорм.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,СтрокаТаблицыНорм.КоличествоПериодов * 12,СтрокаТаблицыНорм.КоличествоПериодов));
					Иначе
						НоваяСтрока.ДатаПотребности = ПроцедурыРаботыСНормамиСервер.РассчитатьДатуПотребностиПоИзносу(ДатаДокумента,СтрокаТаблицыНорм.ТипПериода,СтрокаТаблицыНорм.КоличествоПериодов,НайденныеСтроки[0].ПроцентИзноса);
						//АсТБ_Alexey_73822_********************************************************************
						//НоваяСтрока.ПроцентИзноса 	= НайденныеСтроки[0].ПроцентИзноса;
						НоваяСтрока.ПроцентИзноса 	= 0;
						//АсТБ_Alexey_73822_********************************************************************
					КонецЕсли;
					
				Иначе //полная выдача: двигаем всю потребность
					
					НоваяСтрока = ТаблицаКонечнойПотребности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыНорм);
					Если НайденныеСтроки[0].ПроцентИзноса = 0 Тогда
						НоваяСтрока.ДатаПотребности = ДобавитьМесяц(ДатаДокумента,?(СтрокаТаблицыНорм.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,СтрокаТаблицыНорм.КоличествоПериодов * 12,СтрокаТаблицыНорм.КоличествоПериодов));
					Иначе
						НоваяСтрока.ДатаПотребности = ПроцедурыРаботыСНормамиСервер.РассчитатьДатуПотребностиПоИзносу(ДатаДокумента,СтрокаТаблицыНорм.ТипПериода,СтрокаТаблицыНорм.КоличествоПериодов,НайденныеСтроки[0].ПроцентИзноса);
						//АсТБ_Alexey_73822_********************************************************************
						//НоваяСтрока.ПроцентИзноса 	= НайденныеСтроки[0].ПроцентИзноса;
						НоваяСтрока.ПроцентИзноса 	= 0;
						//АсТБ_Alexey_73822_********************************************************************
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаКонечнойПотребности.Свернуть("Сотрудник, Подразделение, ЭтоЗима, НормаВыдачи, НоменклатураНормы,ДатаПотребности,ПроцентИзноса","КоличествоВыдано,КоличествоПотребность");
	
	ТаблицаДатПотребности = ТаблицаКонечнойПотребности.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаКонечнойПотребности,ТаблицаЗимы);
	
	Возврат ТаблицаКонечнойПотребности;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Количество выданных | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,МассивСотрудников,ТаблицаДокумента,ДатаДокумента,ВидВыдачиСИЗ)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуСписанияСИЗ(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	//АсТБ_Alexey_83202_********************************************************************
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаДокумента.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.НормаВыдачи ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВыдачаПоПотребности1.НормаВыдачи ЕСТЬ NULL
	|						ТОГДА ВТ_ТаблицаДокумента.НормаВыдачи
	|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.НормаВыдачи
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаДокумента.НормаВыдачи
	|	КОНЕЦ КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВыдачаПоПотребности1.ДатаПотребности ЕСТЬ NULL
	|						ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.ПроцентИзноса ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВыдачаПоПотребности1.ПроцентИзноса ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.ПроцентИзноса
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ПроцентИзноса
	|	КОНЕЦ КАК ПроцентИзноса,
	|	СУММА(ВТ_ТаблицаДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСДатойПотребности
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|		ПО ВТ_ТаблицаДокумента.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
	|			И ВТ_ТаблицаДокумента.ДатаВыдачи = ВТ_ВыдачаПоПотребности.ДатаВыдачи
	|			И ВТ_ТаблицаДокумента.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности1
	|		ПО ВТ_ТаблицаДокумента.НоменклатураНормы = ВТ_ВыдачаПоПотребности1.НоменклатураНормы
	|			И ВТ_ТаблицаДокумента.ДатаВыдачи = ВТ_ВыдачаПоПотребности1.ДатаВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокумента.НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.НормаВыдачи ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВыдачаПоПотребности1.НормаВыдачи ЕСТЬ NULL
	|						ТОГДА ВТ_ТаблицаДокумента.НормаВыдачи
	|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.НормаВыдачи
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаДокумента.НормаВыдачи
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВыдачаПоПотребности1.ДатаПотребности ЕСТЬ NULL
	|						ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ДатаПотребности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.ПроцентИзноса ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВыдачаПоПотребности1.ПроцентИзноса ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ ВТ_ВыдачаПоПотребности1.ПроцентИзноса
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ПроцентИзноса
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ТаблицаДокументаСДатойПотребности.НормаВыдачи) КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСДатойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВТ_ТаблицаДокументаСДатойПотребности.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_СгруппированнаяТаблицаДокумента
	|ИЗ
	|	ВТ_ТаблицаДокументаСДатойПотребности КАК ВТ_ТаблицаДокументаСДатойПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокументаСДатойПотребности.НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ДатаПотребности,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СоставНормВыдачи
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы В(&МассивНоменклатураНормы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтсутствиеНаРабочемМестеСрезПоследних.Сотрудник КАК Сотрудник,
	|	ДОБАВИТЬКДАТЕ(ОтсутствиеНаРабочемМестеСрезПоследних.ДатаОкончания, ДЕНЬ, 1) КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_ОтсутствиеНаРабочемМесте
	|ИЗ
	|	РегистрСведений.ОтсутствиеНаРабочемМесте.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ОтсутствиеНаРабочемМестеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПотребностьВыдачи.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ТаблицаДокументаСДатойПотребности.Количество < ВТ_ПотребностьВыдачи.КоличествоПотребность
	|						ТОГДА ВТ_ПотребностьВыдачи.КоличествоПотребность - ВТ_ТаблицаДокументаСДатойПотребности.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСДатойПотребности.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьРасход
	|ИЗ
	|	ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокументаСДатойПотребности КАК ВТ_ТаблицаДокументаСДатойПотребности
	|		ПО ВТ_ПотребностьВыдачи.НормаВыдачи = ВТ_ТаблицаДокументаСДатойПотребности.НормаВыдачи
	|			И (ВТ_ТаблицаДокументаСДатойПотребности.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы)
	|			И ВТ_ПотребностьВыдачи.ДатаПотребности = ВТ_ТаблицаДокументаСДатойПотребности.ДатаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтсутствиеНаРабочемМесте КАК ВТ_ОтсутствиеНаРабочемМесте
	|		ПО ВТ_ПотребностьВыдачи.Сотрудник = ВТ_ОтсутствиеНаРабочемМесте.Сотрудник
	|ГДЕ
	|	ВТ_ПотребностьВыдачи.НормаВыдачи В
	|			(ВЫБРАТЬ
	|				ВТ_СоставНормВыдачи.Ссылка КАК НормаВыдачи
	|			ИЗ
	|				ВТ_СоставНормВыдачи КАК ВТ_СоставНормВыдачи)
	|	И ВЫБОР
	|			КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|				ТОГДА НАЧАЛОПЕРИОДА(ВТ_ПотребностьВыдачи.ДатаПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ПЕриод, МЕСЯЦ)
	|			ИНАЧЕ ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности < НАЧАЛОПЕРИОДА(&ПЕриод, МЕСЯЦ)
	|		КОНЕЦ
	|	И НЕ ВТ_ТаблицаДокументаСДатойПотребности.ДатаВыдачи ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьВыдачи.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|				ТОГДА НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) < ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности > ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности
	|									ТОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности
	|								ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|							КОНЕЦ
	|					ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|				КОНЕЦ
	|		КОНЕЦ) КАК ДатаПотребности,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ТаблицаДокументаСДатойПотребности.Количество > ВТ_ПотребностьВыдачи.КоличествоПотребность
	|							ТОГДА ВТ_ПотребностьВыдачи.КоличествоПотребность
	|						ИНАЧЕ ВТ_ТаблицаДокументаСДатойПотребности.Количество
	|					КОНЕЦ
	|			ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоПотребность
	|		КОНЕЦ) КАК КоличествоПотребность,
	|	0 КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьПриход
	|ИЗ
	|	ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокументаСДатойПотребности КАК ВТ_ТаблицаДокументаСДатойПотребности
	|		ПО (ВТ_ТаблицаДокументаСДатойПотребности.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы)
	|			И ВТ_ПотребностьВыдачи.НормаВыдачи = ВТ_ТаблицаДокументаСДатойПотребности.НормаВыдачи
	|			И ВТ_ПотребностьВыдачи.ДатаПотребности = ВТ_ТаблицаДокументаСДатойПотребности.ДатаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтсутствиеНаРабочемМесте КАК ВТ_ОтсутствиеНаРабочемМесте
	|		ПО ВТ_ПотребностьВыдачи.Сотрудник = ВТ_ОтсутствиеНаРабочемМесте.Сотрудник
	|ГДЕ
	|	ВТ_ПотребностьВыдачи.НормаВыдачи В
	|			(ВЫБРАТЬ
	|				ВТ_СоставНормВыдачи.Ссылка КАК НормаВыдачи
	|			ИЗ
	|				ВТ_СоставНормВыдачи КАК ВТ_СоставНормВыдачи)
	|	И НАЧАЛОПЕРИОДА(ВТ_ПотребностьВыдачи.ДатаПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ПЕриод, МЕСЯЦ)
	|	И НЕ ВТ_ТаблицаДокументаСДатойПотребности.ДатаВыдачи ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьВыдачи.Сотрудник,
	|	ВТ_ПотребностьВыдачи.НормаВыдачи,
	|	ВТ_ПотребностьВыдачи.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьРасход.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьРасход.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьРасход.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьРасход.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьРасход.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьРасход.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_ПотребностьРасход КАК ВТ_ПотребностьРасход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьПриход.Сотрудник,
	|	ВТ_ПотребностьПриход.НормаВыдачи,
	|	ВТ_ПотребностьПриход.НоменклатураНормы,
	|	ВТ_ПотребностьПриход.ДатаПотребности,
	|	ВТ_ПотребностьПриход.КоличествоПотребность,
	|	ВТ_ПотребностьПриход.ПроцентИзноса
	|ИЗ
	|	ВТ_ПотребностьПриход КАК ВТ_ПотребностьПриход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_СобраннаяПотребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_СобраннаяПотребность.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_СобраннаяПотребность.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребностьСПодразделениями
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ПО ВТ_СобраннаяПотребность.НормаВыдачи = ВТ_ПодобранныеНормы.НормаВыдачи
	|			И ВТ_СобраннаяПотребность.НоменклатураНормы = ВТ_ПодобранныеНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормыСДатойПотребности
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.Сотрудник, ВТ_ПодобранныеНормыСДатойПотребности.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.Подразделение, ВТ_ПодобранныеНормыСДатойПотребности.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.ЭтоЗима, ВТ_ПодобранныеНормыСДатойПотребности.ЭтоЗима) КАК ЭтоЗима,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.НормаВыдачи, ВТ_ПодобранныеНормыСДатойПотребности.НормаВыдачи) КАК НормаВыдачи,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.НоменклатураНормы, ВТ_ПодобранныеНормыСДатойПотребности.НоменклатураНормы) КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.ДатаПотребности, ВТ_ПодобранныеНормыСДатойПотребности.ДатаПотребности) КАК ДатаПотребности,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.ПроцентИзноса, 0) КАК ПроцентИзноса,
	|	ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.КоличествоПотребность, ВТ_ПодобранныеНормыСДатойПотребности.КоличествоПотребность) КАК КоличествоПотребность,
	|	0 КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормыСДатойПотребности КАК ВТ_ПодобранныеНормыСДатойПотребности
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СобраннаяПотребностьСПодразделениями КАК ВТ_СобраннаяПотребностьСПодразделениями
	|		ПО ВТ_ПодобранныеНормыСДатойПотребности.ДатаПотребности = ВТ_СобраннаяПотребностьСПодразделениями.ДатаПотребности
	|			И (ВТ_СобраннаяПотребностьСПодразделениями.Сотрудник = ВТ_ПодобранныеНормыСДатойПотребности.Сотрудник)
	|			И (ВТ_СобраннаяПотребностьСПодразделениями.НормаВыдачи = ВТ_ПодобранныеНормыСДатойПотребности.НормаВыдачи)
	|			И (ВТ_СобраннаяПотребностьСПодразделениями.НоменклатураНормы = ВТ_ПодобранныеНормыСДатойПотребности.НоменклатураНормы)
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_СобраннаяПотребностьСПодразделениями.Подразделение, ВТ_ПодобранныеНормыСДатойПотребности.Подразделение) ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ДляПроверкиКонечнойПотребности
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы В(&МассивНоменклатураНормы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_Результат.КоличествоПотребность) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ДляПроверкиКонечнойПотребности.КоличествоВПериоде - ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности.КоличествоПотребность КАК КоличествоДляКорректировки,
	|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_КонечнаяПотребностьДляКорректировки
	|ИЗ
	|	ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности КАК ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДляПроверкиКонечнойПотребности КАК ВТ_ДляПроверкиКонечнойПотребности
	|		ПО ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности.НормаВыдачи = ВТ_ДляПроверкиКонечнойПотребности.НормаВыдачи
	|			И ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности.НоменклатураНормы = ВТ_ДляПроверкиКонечнойПотребности.НоменклатураНормы
	|			И ВТ_СгруппированныйРезультатДляПроверкиКонечнойПотребности.КоличествоПотребность < ВТ_ДляПроверкиКонечнойПотребности.КоличествоВПериоде
	|ГДЕ
	|	НЕ ВТ_ДляПроверкиКонечнойПотребности.КоличествоВПериоде ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВТ_Результат.КоличествоВыдано) КАК КоличествоВыдано,
	|	ВТ_Результат.КоличествоПотребность + ЕСТЬNULL(ВТ_КонечнаяПотребностьДляКорректировки.КоличествоДляКорректировки, 0) КАК КоличествоПотребность,
	|	ВТ_Результат.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонечнаяПотребностьДляКорректировки КАК ВТ_КонечнаяПотребностьДляКорректировки
	|		ПО ВТ_Результат.НормаВыдачи = ВТ_КонечнаяПотребностьДляКорректировки.НормаВыдачи
	|			И ВТ_Результат.НоменклатураНормы = ВТ_КонечнаяПотребностьДляКорректировки.НоменклатураНормы
	|			И ВТ_Результат.ДатаПотребности = ВТ_КонечнаяПотребностьДляКорректировки.ДатаПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность + ЕСТЬNULL(ВТ_КонечнаяПотребностьДляКорректировки.КоличествоДляКорректировки, 0),
	|	ВТ_Результат.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("МассивНоменклатураНормы",			ТаблицаДокумента.ВыгрузитьКолонку("НоменклатураНормы"));
	Запрос.УстановитьПараметр("ТаблицаДокумента",					ТаблицаДокумента);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[17].Выгрузить();
	ТаблицаПодразделений 	= Результат[18].Выгрузить();
	ТаблицаДатПотребности 	= Результат[19].Выгрузить();
	
	//АсТБ_Alexey_83202_********************************************************************
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаНачала,ДатаОкончания,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуОтсутствияНаРабочемМесте(СтруктураОтбора) Экспорт
	
	Организация 							= СтруктураОтбора.Организация;
	ДатаАнализа 							= СтруктураОтбора.ДатаАнализа;
	ДатаНачала 								= СтруктураОтбора.ДатаНачала;
	ДатаОкончания 							= СтруктураОтбора.ДатаОкончания;
	МассивСотрудников 						= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам 		= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтсутствиеНаРабочемМестеСрезПоследних.Сотрудник КАК Сотрудник,
	|	ДОБАВИТЬКДАТЕ(ОтсутствиеНаРабочемМестеСрезПоследних.ДатаОкончания, ДЕНЬ, 1) КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_ОтсутствиеНаРабочемМесте
	|ИЗ
	|	РегистрСведений.ОтсутствиеНаРабочемМесте.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ОтсутствиеНаРабочемМестеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ОстаткиВПП
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ВыдачаПоПотребностиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ОстаткиВПП.КоличествоОстаток ЕСТЬ NULL
	|					ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НАЧАЛОПЕРИОДА(ВЫБОР
	|									КОГДА ВТ_ОстаткиВПП.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов)
	|								КОНЕЦ, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|							ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫБОР
	|									КОГДА ВТ_ОстаткиВПП.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов)
	|								КОНЕЦ, ДЕНЬ)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаПотребности,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиВПП.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиВПП.ПроцентИзноса, 0) КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтсутствиеНаРабочемМесте КАК ВТ_ОтсутствиеНаРабочемМесте
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОтсутствиеНаРабочемМесте.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВПП КАК ВТ_ОстаткиВПП
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОстаткиВПП.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НормаВыдачи = ВТ_ОстаткиВПП.НормаВыдачи
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_ОстаткиВПП.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_ОстаткиВПП.ДатаПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ОстаткиВПП.ПроцентИзноса, 0),
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ОстаткиВПП.КоличествоОстаток ЕСТЬ NULL
	|					ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НАЧАЛОПЕРИОДА(ВЫБОР
	|									КОГДА ВТ_ОстаткиВПП.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов)
	|								КОНЕЦ, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|							ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫБОР
	|									КОГДА ВТ_ОстаткиВПП.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ОстаткиВПП.ДатаВыдачи, МЕСЯЦ, ВТ_ОстаткиВПП.ПериодичностьВыдачи.КоличествоПериодов)
	|								КОНЕЦ, ДЕНЬ)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|	КОНЕЦ,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток - ЕСТЬNULL(ВТ_ОстаткиВПП.КоличествоОстаток, 0)),
	|	ЕСТЬNULL(ВТ_ОстаткиВПП.ПроцентИзноса, 0)
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтсутствиеНаРабочемМесте КАК ВТ_ОтсутствиеНаРабочемМесте
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОтсутствиеНаРабочемМесте.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВПП КАК ВТ_ОстаткиВПП
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОстаткиВПП.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НормаВыдачи = ВТ_ОстаткиВПП.НормаВыдачи
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_ОстаткиВПП.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_ОстаткиВПП.ДатаПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ОстаткиВПП.ПроцентИзноса, 0),
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_ПотребностьВыдачи.КоличествоОстаток) КАК КоличествоПотребность,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Результат.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ДатаНачала",							ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",						ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[5].Выгрузить();
	ТаблицаПодразделений 	= Результат[6].Выгрузить();
	ТаблицаДатПотребности 	= Результат[7].Выгрузить();
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуПриемаНаРаботу(СтруктураОтбора,ТаблицаВыдачаПоПотребности) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.Должность КАК Должность,
	|	ТаблицаДокумента.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановленныеНормыВыдачиСИЗСрезПоследних.Должность КАК Должность,
	|	УстановленныеНормыВыдачиСИЗСрезПоследних.УсловиеНормы КАК УсловиеНормы
	|ПОМЕСТИТЬ ВТ_УстановленныеНормы
	|ИЗ
	|	РегистрСведений.УстановленныеНормыВыдачиСИЗ.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (Подразделение В (&МассивПодразделений)
	|					ИЛИ Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|				И Должность В (&МассивДолжностей)
	|				И (РабочееМесто В (&МассивРабочихМест)
	|					ИЛИ РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка))) КАК УстановленныеНормыВыдачиСИЗСрезПоследних
	|ГДЕ
	|	УстановленныеНормыВыдачиСИЗСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаДокумента.Должность КАК Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто КАК РабочееМесто,
	|	ВТ_УстановленныеНормы.УсловиеНормы КАК Условие,
	|	ВЫБОР
	|		КОГДА ВТ_УстановленныеНормы.УсловиеНормы.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ЗимойДополнительно)
	|				ИЛИ ВТ_УстановленныеНормы.УсловиеНормы.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ПриУсловииЗимойДополнительно)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗима
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УстановленныеНормы КАК ВТ_УстановленныеНормы
	|		ПО ВТ_ТаблицаДокумента.Должность = ВТ_УстановленныеНормы.Должность
	|ГДЕ
	|	НЕ ВТ_УстановленныеНормы.УсловиеНормы ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаДокумента);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("МассивПодразделений",ТаблицаДокумента.ВыгрузитьКолонку("Подразделение"));
	Запрос.УстановитьПараметр("МассивДолжностей",	ТаблицаДокумента.ВыгрузитьКолонку("Должность"));
	Запрос.УстановитьПараметр("МассивРабочихМест",	ТаблицаДокумента.ВыгрузитьКолонку("РабочееМесто"));
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаЗапроса,ТаблицаЗанятыхРМ);
	
	ТаблицаЗанятыхРМ.Свернуть("Сотрудник, Подразделение, Должность, РабочееМесто, Условие, ЭтоЗима");
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ПодобранныеНормы.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА &Период
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаВыдачи,
	|	0 КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ТаблицаВыдачаПоПотребности);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	СкорректироватьТаблицуВыдачиПоПотребностиПоЗиме(ТаблицаЗапроса,ТаблицаВыдачаПоПотребности,ДатаДокумента);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуУвольнения(СтруктураОтбора,ТаблицаВыдачаПоПотребности) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Должность,
	|	ТаблицаДокумента.РабочееМесто,
	|	ТаблицаДокумента.ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто,
	|	ТаблицаЗанятыхРабочихМест.Условие,
	|	ТаблицаЗанятыхРабочихМест.КоличествоСтавок,
	|	ТаблицаЗанятыхРабочихМест.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятыеРабочиеМеста.Сотрудник,
	|	ЗанятыеРабочиеМеста.Подразделение,
	|	ЗанятыеРабочиеМеста.Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто,
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавок, 0) КАК КоличествоСтавок,
	|	ЗанятыеРабочиеМеста.Условие,
	|	ЗанятыеРабочиеМеста.ЭтоЗима
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность КАК Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		СУММА(ВТ_ЗанятыеРабочиеМеста.КоличествоСтавок) КАК КоличествоСтавок,
	|		ВТ_ЗанятыеРабочиеМеста.Условие КАК Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима КАК ЭтоЗима
	|	ИЗ
	|		ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто,
	|		ВТ_ЗанятыеРабочиеМеста.Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима) КАК ЗанятыеРабочиеМеста
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|			ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|			ВТ_ТаблицаДокумента.Должность КАК Должность,
	|			ВТ_ТаблицаДокумента.РабочееМесто КАК РабочееМесто,
	|			СУММА(ВТ_ТаблицаДокумента.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок
	|		ИЗ
	|			ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ТаблицаДокумента.Сотрудник,
	|			ВТ_ТаблицаДокумента.Подразделение,
	|			ВТ_ТаблицаДокумента.Должность,
	|			ВТ_ТаблицаДокумента.РабочееМесто) КАК ТаблицаДокумента
	|		ПО ЗанятыеРабочиеМеста.Сотрудник = ТаблицаДокумента.Сотрудник
	|			И ЗанятыеРабочиеМеста.Подразделение = ТаблицаДокумента.Подразделение
	|			И ЗанятыеРабочиеМеста.Должность = ТаблицаДокумента.Должность
	|			И ЗанятыеРабочиеМеста.РабочееМесто = ТаблицаДокумента.РабочееМесто
	|ГДЕ
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавок, 0) > 0";
	
	Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(Запрос.Выполнить().Выгрузить(),ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	0 КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ТаблицаВыдачаПоПотребности);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	СкорректироватьТаблицуВыдачиПоПотребностиПоЗиме(ТаблицаЗапроса,ТаблицаВыдачаПоПотребности,ДатаАнализа.Значение.Дата);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуКадровогоПеремещения(СтруктураОтбора,ТаблицаВыдачаПоПотребности) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.ПодразделениеСтарое,
	|	ТаблицаДокумента.ДолжностьСтарая,
	|	ТаблицаДокумента.РабочееМестоСтарое,
	|	ТаблицаДокумента.ЗанимаемыхСтавокСтарое,
	|	ТаблицаДокумента.ПодразделениеНовое,
	|	ТаблицаДокумента.ДолжностьНовая,
	|	ТаблицаДокумента.РабочееМестоНовое
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто,
	|	ТаблицаЗанятыхРабочихМест.Условие,
	|	ТаблицаЗанятыхРабочихМест.КоличествоСтавок,
	|	ТаблицаЗанятыхРабочихМест.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Сотрудник,
	|	ЗанятыеРабочиеМеста.Подразделение,
	|	ЗанятыеРабочиеМеста.Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто,
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавокСтарое, 0) КАК КоличествоСтавок,
	|	ЗанятыеРабочиеМеста.Условие,
	|	ЗанятыеРабочиеМеста.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ТаблицаУвольнения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность КАК Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		СУММА(ВТ_ЗанятыеРабочиеМеста.КоличествоСтавок) КАК КоличествоСтавок,
	|		ВТ_ЗанятыеРабочиеМеста.Условие КАК Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима КАК ЭтоЗима
	|	ИЗ
	|		ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто,
	|		ВТ_ЗанятыеРабочиеМеста.Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима) КАК ЗанятыеРабочиеМеста
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|			ВТ_ТаблицаДокумента.ПодразделениеСтарое КАК ПодразделениеСтарое,
	|			ВТ_ТаблицаДокумента.ДолжностьСтарая КАК ДолжностьСтарая,
	|			ВТ_ТаблицаДокумента.РабочееМестоСтарое КАК РабочееМестоСтарое,
	|			СУММА(ВТ_ТаблицаДокумента.ЗанимаемыхСтавокСтарое) КАК ЗанимаемыхСтавокСтарое
	|		ИЗ
	|			ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ТаблицаДокумента.Сотрудник,
	|			ВТ_ТаблицаДокумента.ПодразделениеСтарое,
	|			ВТ_ТаблицаДокумента.ДолжностьСтарая,
	|			ВТ_ТаблицаДокумента.РабочееМестоСтарое) КАК ТаблицаДокумента
	|		ПО ЗанятыеРабочиеМеста.Сотрудник = ТаблицаДокумента.Сотрудник
	|			И ЗанятыеРабочиеМеста.Подразделение = ТаблицаДокумента.ПодразделениеСтарое
	|			И ЗанятыеРабочиеМеста.Должность = ТаблицаДокумента.ДолжностьСтарая
	|			И ЗанятыеРабочиеМеста.РабочееМесто = ТаблицаДокумента.РабочееМестоСтарое
	|ГДЕ
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавокСтарое, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.ПодразделениеНовое КАК Подразделение,
	|	ВТ_ТаблицаДокумента.ДолжностьНовая КАК Должность,
	|	ВТ_ТаблицаДокумента.РабочееМестоНовое КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаПриема
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаУвольнения.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаУвольнения.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаУвольнения.Должность КАК Должность,
	|	ВТ_ТаблицаУвольнения.РабочееМесто КАК РабочееМесто,
	|	ВТ_ТаблицаУвольнения.Условие,
	|	ВТ_ТаблицаУвольнения.ЭтоЗима
	|ИЗ
	|	ВТ_ТаблицаУвольнения КАК ВТ_ТаблицаУвольнения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПриема.Сотрудник,
	|	ВТ_ТаблицаПриема.Подразделение,
	|	ВТ_ТаблицаПриема.Должность,
	|	ВТ_ТаблицаПриема.РабочееМесто,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ТаблицаПриема КАК ВТ_ТаблицаПриема
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто";
	
	Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗапроса.ВыгрузитьКолонку("Подразделение"),ТаблицаЗапроса.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗапроса,ТаблицаУстановленныхНорм,Организация,ДатаАнализа); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ПотребностьВыдачи.ДатаПотребности, &Период) КАК ДатаПотребности,
	|	ЕСТЬNULL(ВТ_ПотребностьВыдачи.КоличествоОстаток, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ПодобранныеНормы.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	0 КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ТаблицаВыдачаПоПотребности);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	СкорректироватьТаблицуВыдачиПоПотребностиПоЗиме(ТаблицаЗапроса,ТаблицаВыдачаПоПотребности,ДатаДокумента);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуУстановкиУсловийРаботыСотрудника(СтруктураОтбора,ТаблицаВыдачаПоПотребности) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Должность,
	|	ТаблицаДокумента.РабочееМесто,
	|	ТаблицаДокумента.Условие,
	|	ТаблицаДокумента.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто,
	|	ТаблицаЗанятыхРабочихМест.Условие,
	|	ТаблицаЗанятыхРабочихМест.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто,
	|	ВТ_ТаблицаДокумента.Условие,
	|	ВТ_ТаблицаДокумента.Использовать,
	|	ВЫБОР
	|		КОГДА УсловияНорм.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ЗимойДополнительно)
	|				ИЛИ УсловияНорм.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ПриУсловииЗимойДополнительно)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСЗимой
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияНорм КАК УсловияНорм
	|		ПО ВТ_ТаблицаДокумента.Условие = УсловияНорм.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Сотрудник, ВТ_ЗанятыеРабочиеМеста.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Подразделение, ВТ_ЗанятыеРабочиеМеста.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Должность, ВТ_ЗанятыеРабочиеМеста.Должность) КАК Должность,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.РабочееМесто, ВТ_ЗанятыеРабочиеМеста.РабочееМесто) КАК РабочееМесто,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Условие, ВТ_ЗанятыеРабочиеМеста.Условие) КАК Условие,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.ЭтоЗима, ВТ_ЗанятыеРабочиеМеста.ЭтоЗима) КАК ЭтоЗима,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокументаСЗимой.Сотрудник ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВТ_ТаблицаДокументаСЗимой.Использовать
	|	КОНЕЦ КАК Использовать
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ТаблицаДокументаСЗимой КАК ВТ_ТаблицаДокументаСЗимой
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|		ПО ВТ_ТаблицаДокументаСЗимой.Сотрудник = ВТ_ЗанятыеРабочиеМеста.Сотрудник
	|			И ВТ_ТаблицаДокументаСЗимой.Подразделение = ВТ_ЗанятыеРабочиеМеста.Подразделение
	|			И ВТ_ТаблицаДокументаСЗимой.Должность = ВТ_ЗанятыеРабочиеМеста.Должность
	|			И ВТ_ТаблицаДокументаСЗимой.РабочееМесто = ВТ_ЗанятыеРабочиеМеста.РабочееМесто
	|			И ВТ_ТаблицаДокументаСЗимой.Условие = ВТ_ЗанятыеРабочиеМеста.Условие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.Должность КАК Должность,
	|	ВТ_Результат.РабочееМесто КАК РабочееМесто,
	|	ВТ_Результат.Условие КАК Условие,
	|	ВТ_Результат.ЭтоЗима
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто,
	|	Условие";
	
	Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(Запрос.Выполнить().Выгрузить(),ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы,
	|	ПодобранныеНормы.КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА &Период
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	0 КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ТаблицаВыдачаПоПотребности);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	СкорректироватьТаблицуВыдачиПоПотребностиПоЗиме(ТаблицаЗапроса,ТаблицаВыдачаПоПотребности,ДатаДокумента);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуУстановкиПериодаЗимы(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_НормыСПотребностью
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ВыдачаПоПотребностиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВТ_ВыдачаПоПотребности.КоличествоВыдано) КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребностиПолная
	|ИЗ
	|	ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаПоПотребности.Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСПотребностью.Сотрудник КАК Сотрудник,
	|	ВТ_НормыСПотребностью.Подразделение КАК Подразделение,
	|	ВТ_НормыСПотребностью.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_НормыСПотребностью.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСПотребностью.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_НормыСПотребностью.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_НормыСПотребностью.КоличествоПотребность КАК КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	0 КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьБезВыдачи
	|ИЗ
	|	ВТ_НормыСПотребностью КАК ВТ_НормыСПотребностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребностиПолная КАК ВТ_ВыдачаПоПотребностиПолная
	|		ПО ВТ_НормыСПотребностью.Сотрудник = ВТ_ВыдачаПоПотребностиПолная.Сотрудник
	|			И ВТ_НормыСПотребностью.НормаВыдачи = ВТ_ВыдачаПоПотребностиПолная.НормаВыдачи
	|			И ВТ_НормыСПотребностью.НоменклатураНормы = ВТ_ВыдачаПоПотребностиПолная.НоменклатураНормы
	|			И ВТ_НормыСПотребностью.ДатаПотребности = ВТ_ВыдачаПоПотребностиПолная.ДатаПотребности
	|ГДЕ
	|	ВТ_ВыдачаПоПотребностиПолная.КоличествоВыдано ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСПотребностью.Сотрудник КАК Сотрудник,
	|	ВТ_НормыСПотребностью.Подразделение КАК Подразделение,
	|	ВТ_НормыСПотребностью.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_НормыСПотребностью.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСПотребностью.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_НормыСПотребностью.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.КоличествоВыдано > ВТ_НормыСПотребностью.КоличествоПотребность
	|			ТОГДА ВТ_НормыСПотребностью.КоличествоПотребность
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.КоличествоВыдано
	|	КОНЕЦ КАК КоличествоПотребность,
	|	ВТ_ВыдачаПоПотребности.КоличествоВыдано КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ПотребностьСВыдачей
	|ИЗ
	|	ВТ_НормыСПотребностью КАК ВТ_НормыСПотребностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|		ПО ВТ_НормыСПотребностью.Сотрудник = ВТ_ВыдачаПоПотребности.Сотрудник
	|			И ВТ_НормыСПотребностью.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
	|			И ВТ_НормыСПотребностью.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
	|			И ВТ_НормыСПотребностью.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
	|ГДЕ
	|	НЕ ВТ_ВыдачаПоПотребности.ПроцентИзноса ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьБезВыдачи.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьБезВыдачи.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьБезВыдачи.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПотребностьБезВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьБезВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьБезВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьБезВыдачи.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьБезВыдачи.КоличествоВыдано КАК КоличествоВыдано,
	|	ВТ_ПотребностьБезВыдачи.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ВсяПотребность
	|ИЗ
	|	ВТ_ПотребностьБезВыдачи КАК ВТ_ПотребностьБезВыдачи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСВыдачей.Сотрудник,
	|	ВТ_ПотребностьСВыдачей.Подразделение,
	|	ВТ_ПотребностьСВыдачей.ЭтоЗима,
	|	ВТ_ПотребностьСВыдачей.НормаВыдачи,
	|	ВТ_ПотребностьСВыдачей.НоменклатураНормы,
	|	ВТ_ПотребностьСВыдачей.ДатаПотребности,
	|	ВТ_ПотребностьСВыдачей.КоличествоПотребность,
	|	ВТ_ПотребностьСВыдачей.КоличествоВыдано,
	|	ВТ_ПотребностьСВыдачей.ПроцентИзноса
	|ИЗ
	|	ВТ_ПотребностьСВыдачей КАК ВТ_ПотребностьСВыдачей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_ВсяПотребность.Подразделение КАК Подразделение,
	|	ВТ_ВсяПотребность.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ВсяПотребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВсяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВсяПотребность.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВТ_ВсяПотребность.КоличествоПотребность) КАК КоличествоПотребность,
	|	СУММА(ВТ_ВсяПотребность.КоличествоВыдано) КАК КоличествоВыдано,
	|	ВТ_ВсяПотребность.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ВсяПотребность КАК ВТ_ВсяПотребность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсяПотребность.Сотрудник,
	|	ВТ_ВсяПотребность.Подразделение,
	|	ВТ_ВсяПотребность.ЭтоЗима,
	|	ВТ_ВсяПотребность.НормаВыдачи,
	|	ВТ_ВсяПотребность.НоменклатураНормы,
	|	ВТ_ВсяПотребность.ДатаПотребности,
	|	ВТ_ВсяПотребность.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсяПотребность.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_ВсяПотребность КАК ВТ_ВсяПотребность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсяПотребность.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_ВсяПотребность КАК ВТ_ВсяПотребность";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[8].Выгрузить();
	ТаблицаПодразделений 	= Результат[9].Выгрузить();
	ТаблицаДатПотребности 	= Результат[10].Выгрузить();
	
	//АсТБ_Alexey_76619_********************************************************************
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоОтсутствиюНаРабочемМесте(ТаблицаЗапроса, Организация, ДатаАнализа);
	//АсТБ_Alexey_76619_********************************************************************
	
	МассивПодразделений = ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение");
	МассивДат 			= ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности");
	
	//формирование таблицы зимы с учетом данных документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПериодыЗимыСрезПоследних.Подразделение,
	|	ПериодыЗимыСрезПоследних.НачалоЗимы,
	|	ПериодыЗимыСрезПоследних.КонецЗимы
	|ПОМЕСТИТЬ ВТ_ПериодыЗимы
	|ИЗ
	|	РегистрСведений.ПериодыЗимы.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ПериодыЗимыСрезПоследних
	|ГДЕ
	|	ПериодыЗимыСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.НачалоЗимы,
	|	ТаблицаДокумента.КонецЗимы,
	|	ТаблицаДокумента.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ВТ_ПериодыЗимы.Подразделение
	|		ИНАЧЕ ВТ_ТаблицаДокумента.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ВТ_ПериодыЗимы.НачалоЗимы
	|		ИНАЧЕ ВТ_ТаблицаДокумента.НачалоЗимы
	|	КОНЕЦ КАК НачалоЗимы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ВТ_ПериодыЗимы.КонецЗимы
	|		ИНАЧЕ ВТ_ТаблицаДокумента.КонецЗимы
	|	КОНЕЦ КАК КонецЗимы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВТ_ТаблицаДокумента.Использовать
	|	КОНЕЦ КАК Использовать
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблицаЗимы
	|ИЗ
	|	ВТ_ПериодыЗимы КАК ВТ_ПериодыЗимы
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО ВТ_ПериодыЗимы.Подразделение = ВТ_ТаблицаДокумента.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение,
	|	ВТ_ИтоговаяТаблицаЗимы.НачалоЗимы КАК НачалоЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.КонецЗимы КАК КонецЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.Использовать
	|ИЗ
	|	ВТ_ИтоговаяТаблицаЗимы КАК ВТ_ИтоговаяТаблицаЗимы
	|ГДЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение В(&МассивПодразделений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение,
	|	ВТ_ИтоговаяТаблицаЗимы.НачалоЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.КонецЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.Использовать
	|ИЗ
	|	ВТ_ИтоговаяТаблицаЗимы КАК ВТ_ИтоговаяТаблицаЗимы
	|ГДЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение,
	|	ВТ_ИтоговаяТаблицаЗимы.НачалоЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.КонецЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.Использовать
	|ИЗ
	|	ВТ_ИтоговаяТаблицаЗимы КАК ВТ_ИтоговаяТаблицаЗимы
	|ГДЕ
	|	НЕ ВТ_ИтоговаяТаблицаЗимы.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_ИтоговаяТаблицаЗимы.Подразделение В (&МассивПодразделений)";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаДокумента);
	Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	
	Результат 						= Запрос.ВыполнитьПакет();
	ТаблицаПоПодразделениям 		= Результат[3].Выгрузить();
	ТаблицаПоПустымПодразделениям 	= Результат[4].Выгрузить();
	ТаблицаПоДругимПодразделениям 	= Результат[5].Выгрузить();
	
	Для Каждого ЭлементМассиваПодразделений Из МассивПодразделений Цикл
		
		НайденнаяСтрока = ТаблицаПоПодразделениям.Найти(ЭлементМассиваПодразделений,"Подразделение");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			ДанныеНайденыВИерархии = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимыРекурсивно(ЭлементМассиваПодразделений,ЭлементМассиваПодразделений.Родитель,ТаблицаПоПодразделениям,ТаблицаПоДругимПодразделениям);
			
			Если НЕ ДанныеНайденыВИерархии Тогда
				
				Если ТаблицаПоПустымПодразделениям.Количество() > 0 Тогда
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТаблицаПоПустымПодразделениям[0]);
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					
				Иначе
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					НоваяСтрока.НачалоЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					НоваяСтрока.КонецЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					НоваяСтрока.Использовать	= Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаЗимы = Новый ТаблицаЗначений;
	ТаблицаЗимы.Колонки.Добавить("ДатаПериода",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЗимы.Колонки.Добавить("Подразделение",		Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаЗимы.Колонки.Добавить("ДатаНачалаЗимы",		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЗимы.Колонки.Добавить("ДатаОкончанияЗимы",	Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЗимы.Колонки.Добавить("Использовать",		Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТаблицыПоПодразделениям Из ТаблицаПоПодразделениям Цикл
		
		Для Каждого ЭлементМассиваДат Из МассивДат Цикл
			
			НоваяСтрока = ТаблицаЗимы.Добавить();
			НоваяСтрока.ДатаПериода 		= ЭлементМассиваДат;
			НоваяСтрока.Подразделение 		= СтрокаТаблицыПоПодразделениям.Подразделение;
			//!!!возможно, неверное определение периода зимы:
			//НоваяСтрока.ДатаНачалаЗимы 		= ПроцедурыРаботыСНормамиСервер.ПолучитьДатуНачалаМесяца(СтрокаТаблицыПоПодразделениям.НачалоЗимы,ЭлементМассиваДат);
			//НоваяСтрока.ДатаОкончанияЗимы 	= ПроцедурыРаботыСНормамиСервер.ПолучитьДатуКонцаМесяца(СтрокаТаблицыПоПодразделениям.КонецЗимы,ЭлементМассиваДат);
			//!!!возможно, должно быть так:
			СтруктураПериодаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимы(ЭлементМассиваДат,СтрокаТаблицыПоПодразделениям.НачалоЗимы,СтрокаТаблицыПоПодразделениям.КонецЗимы);
			Если СтрокаТаблицыПоПодразделениям.Использовать Тогда
				НоваяСтрока.ДатаНачалаЗимы 		= СтруктураПериодаЗимы.НачалоЗимы;
				НоваяСтрока.ДатаОкончанияЗимы 	= СтруктураПериодаЗимы.КонецЗимы;
			Иначе
				НоваяСтрока.ДатаНачалаЗимы 		= Дата('00010101');
				НоваяСтрока.ДатаОкончанияЗимы 	= Дата('00010101');
			КонецЕсли;
			НоваяСтрока.Использовать 		= СтрокаТаблицыПоПодразделениям.Использовать;
			//!!!
			
		КонецЦикла;
		
	КонецЦикла;
	
	УточнитьПотребностьПоУстановкеПериодаЗимы(ТаблицаЗапроса,ТаблицаЗимы,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуПриказПоНормамВыдачиСИЗ(СтруктураОтбора,ТаблицаВыдачаПоПотребности) Экспорт
	
	Перем МассивНоменклатурыНорм;
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам 	= МассивСотрудников.Количество() = 0;
	ДвиженияПоДоступнымУсловиямРаботы	= СтруктураОтбора.ДвиженияПоДоступнымУсловиямРаботы;
	
	СтруктураОтбора.Свойство("МассивНоменклатурыНорм",МассивНоменклатурыНорм);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа,ТаблицаДокумента,ДвиженияПоДоступнымУсловиямРаботы);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"),,МассивНоменклатурыНорм);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаУстановленныхНорм.Подразделение,
	|	ТаблицаУстановленныхНорм.Должность,
	|	ТаблицаУстановленныхНорм.РабочееМесто,
	|	ТаблицаУстановленныхНорм.УсловиеНормы,
	|	ТаблицаУстановленныхНорм.НормаВыдачи,
	|	ТаблицаУстановленныхНорм.НоменклатураНормы,
	|	ТаблицаУстановленныхНорм.ТипПериода,
	|	ТаблицаУстановленныхНорм.КоличествоПериодов,
	|	ТаблицаУстановленныхНорм.КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_УстановленныеНормы
	|ИЗ
	|	&ТаблицаУстановленныхНорм КАК ТаблицаУстановленныхНорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Должность,
	|	ТаблицаДокумента.РабочееМесто,
	|	ТаблицаДокумента.УсловиеНормы,
	|	ТаблицаДокумента.НормаВыдачи,
	|	ТаблицаДокумента.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто,
	|	ВТ_ТаблицаДокумента.УсловиеНормы,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.Использовать,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаССоставом
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НормыВыдачиСИЗСоставНормы.Ссылка.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Период)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НормыВыдачиСИЗСоставНормы.УчитыватьВПотребности
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.Подразделение, ВТ_УстановленныеНормы.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.Должность, ВТ_УстановленныеНормы.Должность) КАК Должность,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.РабочееМесто, ВТ_УстановленныеНормы.РабочееМесто) КАК РабочееМесто,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.УсловиеНормы, ВТ_УстановленныеНормы.УсловиеНормы) КАК Условие,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.НормаВыдачи, ВТ_УстановленныеНормы.НормаВыдачи) КАК НормаВыдачи,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.НоменклатураНормы, ВТ_УстановленныеНормы.НоменклатураНормы) КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.ТипПериода, ВТ_УстановленныеНормы.ТипПериода) КАК ТипПериода,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.КоличествоПериодов, ВТ_УстановленныеНормы.КоличествоПериодов) КАК КоличествоПериодов,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.КоличествоВПериоде, ВТ_УстановленныеНормы.КоличествоВПериоде) КАК КоличествоВПериоде,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокументаССоставом.НормаВыдачи ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВТ_ТаблицаДокументаССоставом.Использовать
	|	КОНЕЦ КАК Использовать
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ТаблицаДокументаССоставом КАК ВТ_ТаблицаДокументаССоставом
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_УстановленныеНормы КАК ВТ_УстановленныеНормы
	|		ПО ВТ_ТаблицаДокументаССоставом.Подразделение = ВТ_УстановленныеНормы.Подразделение
	|			И ВТ_ТаблицаДокументаССоставом.Должность = ВТ_УстановленныеНормы.Должность
	|			И ВТ_ТаблицаДокументаССоставом.РабочееМесто = ВТ_УстановленныеНормы.РабочееМесто
	|			И ВТ_ТаблицаДокументаССоставом.УсловиеНормы = ВТ_УстановленныеНормы.УсловиеНормы
	|			И ВТ_ТаблицаДокументаССоставом.НормаВыдачи = ВТ_УстановленныеНормы.НормаВыдачи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение,
	|	Должность,
	|	РабочееМесто,
	|	Условие,
	|	НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.Должность КАК Должность,
	|	ВТ_Результат.РабочееМесто КАК РабочееМесто,
	|	ВТ_Результат.Условие КАК УсловиеНормы,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ТипПериода,
	|	ВТ_Результат.КоличествоПериодов,
	|	ВТ_Результат.КоличествоВПериоде,
	|	ВТ_Результат.Использовать
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Должность,
	|	РабочееМесто,
	|	УсловиеНормы,
	|	НормаВыдачи";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	Запрос.УстановитьПараметр("ТаблицаУстановленныхНорм",	ТаблицаУстановленныхНорм);
	
	ТаблицаСНормами = ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,Запрос.Выполнить().Выгрузить(),Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы,
	|	ПодобранныеНормы.КоличествоВПериоде,
	|	ПодобранныеНормы.Использовать
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ПодобранныеНормы.Сотрудник,
	//|	ВТ_ПодобранныеНормы.Подразделение,
	//|	ВТ_ПодобранныеНормы.ЭтоЗима,
	//|	ВТ_ПодобранныеНормы.НормаВыдачи,
	//|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	//|	ВЫБОР
	//|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	//|			ТОГДА &Период
	//|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	//|	КОНЕЦ КАК ДатаПотребности,
	//|	ВЫБОР
	//|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	//|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	//|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	//|	КОНЕЦ КАК КоличествоПотребность
	//|ПОМЕСТИТЬ ВТ_Результат
	//|ИЗ
	//|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	//|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	//|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	//|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.Сотрудник, ВТ_ПотребностьВыдачи.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.ЭтоЗима, ЛОЖЬ) КАК ЭтоЗима,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.НормаВыдачи, ВТ_ПотребностьВыдачи.НормаВыдачи) КАК НормаВыдачи,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.НоменклатураНормы, ВТ_ПотребностьВыдачи.НоменклатураНормы) КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА &Период
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	ВТ_ПодобранныеНормы.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	0 КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ТаблицаВыдачаПоПотребности);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	СкорректироватьТаблицуВыдачиПоПотребностиПоЗиме(ТаблицаЗапроса,ТаблицаВыдачаПоПотребности,ДатаДокумента);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуПереносаЗимнейПотребности(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
	|	МАКСИМУМ(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВыдачаПоПотребностиОстатки.ПроцентИзноса, 0) КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|				&ПериодРасчета,
	|				Организация = &Организация
	|					И (&НеИспользоватьФильтрПоСотрудникам
	|						ИЛИ Сотрудник В (&МассивСотрудников))) КАК ВыдачаПоПотребностиОстатки
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВыдачаПоПотребностиОстатки.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НормаВыдачи = ВыдачаПоПотребностиОстатки.НормаВыдачи
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВыдачаПоПотребностиОстатки.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВыдачаПоПотребностиОстатки.ДатаПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
	|	ЕСТЬNULL(ВыдачаПоПотребностиОстатки.ПроцентИзноса, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыданныеСИЗ.КоличествоОстаток КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_НормыСВыдачей
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ВыданныеСИЗ.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСВыдачей.Сотрудник КАК Сотрудник,
	|	ВТ_НормыСВыдачей.Подразделение КАК Подразделение,
	|	ВТ_НормыСВыдачей.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_НормыСВыдачей.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСВыдачей.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_НормыСВыдачей.КоличествоВыдано КАК КоличествоВыдано,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_ПотребностьВыдачи.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_НормыСВыдачей КАК ВТ_НормыСВыдачей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_НормыСВыдачей.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_НормыСВыдачей.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_НормыСВыдачей.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.КоличествоВыдано КАК КоличествоВыдано,
	|	ВТ_Результат.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[5].Выгрузить();
	ТаблицаПодразделений 	= Результат[6].Выгрузить();
	ТаблицаДатПотребности 	= Результат[7].Выгрузить();
	
	МассивПодразделений = ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение");
	МассивДат 			= ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности");
	
	//формирование таблицы зимы с учетом данных документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.НачалоЗимы,
	|	ТаблицаДокумента.КонецЗимы,
	|	ТаблицаДокумента.НачальнаяДатаБудущейЗимы,
	|	ТаблицаДокумента.КонечнаяДатаБудущейЗимы
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.НачалоЗимы КАК НачалоЗимы,
	|	ВТ_ТаблицаДокумента.КонецЗимы КАК КонецЗимы,
	|	ВТ_ТаблицаДокумента.НачальнаяДатаБудущейЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаДокумента.КонечнаяДатаБудущейЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|ГДЕ
	|	ВТ_ТаблицаДокумента.Подразделение В(&МассивПодразделений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.НачалоЗимы,
	|	ВТ_ТаблицаДокумента.КонецЗимы,
	|	ВТ_ТаблицаДокумента.НачальнаяДатаБудущейЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаДокумента.КонечнаяДатаБудущейЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|ГДЕ
	|	ВТ_ТаблицаДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.НачалоЗимы,
	|	ВТ_ТаблицаДокумента.КонецЗимы,
	|	ВТ_ТаблицаДокумента.НачальнаяДатаБудущейЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаДокумента.КонечнаяДатаБудущейЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|ГДЕ
	|	НЕ ВТ_ТаблицаДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаДокумента.Подразделение В (&МассивПодразделений)";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаДокумента);
	Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	
	Результат 						= Запрос.ВыполнитьПакет();
	ТаблицаПоПодразделениям 		= Результат[1].Выгрузить();
	ТаблицаПоПустымПодразделениям 	= Результат[2].Выгрузить();
	ТаблицаПоДругимПодразделениям 	= Результат[3].Выгрузить();
	
	Для Каждого ЭлементМассиваПодразделений Из МассивПодразделений Цикл
		
		НайденнаяСтрока = ТаблицаПоПодразделениям.Найти(ЭлементМассиваПодразделений,"Подразделение");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			ДанныеНайденыВИерархии = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимыРекурсивно(ЭлементМассиваПодразделений,ЭлементМассиваПодразделений.Родитель,ТаблицаПоПодразделениям,ТаблицаПоДругимПодразделениям);
			
			Если НЕ ДанныеНайденыВИерархии Тогда
				
				Если ТаблицаПоПустымПодразделениям.Количество() > 0 Тогда
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТаблицаПоПустымПодразделениям[0]);
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					
				Иначе
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					НоваяСтрока.НачалоЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					НоваяСтрока.КонецЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы,
	|	ТаблицаЗимы.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.Подразделение КАК Подразделение,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ТаблицаПотребности.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|				И НЕ ВТ_ТаблицаЗимы.ДатаНачалаЗимы = ДАТАВРЕМЯ(1, 1, 1)
	|				И ВТ_ТаблицаПотребности.ДатаПотребности < ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|			ТОГДА ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|		ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы,
	|	ВТ_ТаблицаПотребности.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ТаблицаПотребности.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",		ТаблицаПоПодразделениям);
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УточнитьПотребностьПоУстановкеПериодаЗимы(ТаблицаЗапроса,ТаблицаЗимы,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы,
	|	ТаблицаЗимы.ДатаПериода КАК ДатаПериода,
	|	ТаблицаЗимы.Подразделение КАК Подразделение,
	|	ТаблицаЗимы.Использовать КАК Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.Подразделение КАК Подразделение,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.ДатаПотребности КАК ДатаПотребности,
	//АсТБ_Alexey_76619_********************************************************************
	|	ТаблицаПотребности.ДатаОкончанияОтсутствияНаРабочемМесте КАК ДатаОкончанияОтсутствияНаРабочемМесте,
	//АсТБ_Alexey_76619_********************************************************************
	|	ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ТаблицаПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	//АсТБ_Alexey_76619_********************************************************************
	|	ТаблицаПотребности.КоличествоВыдано КАК КоличествоВыдано
	//АсТБ_Alexey_76619_********************************************************************
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ДатаАнализа,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ЕСТЬNULL(ВТ_ВыдачаПоПотребности.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.ДатаВыдачи ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_СоставНормы.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыдачаПоПотребности.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.КоличествоПериодов * 12)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыдачаПоПотребности.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.КоличествоПериодов)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаСледующейВыдачи,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК Количество,
	|	ЕСТЬNULL(ВТ_ВыдачаПоПотребности.ПроцентИзноса, 0) КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ПотребностьСДатойВыдачи
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ВыдачаПоПотребности.Сотрудник
	|			И ВТ_ТаблицаПотребности.НормаВыдачи = ВТ_ВыдачаПоПотребности.НормаВыдачи
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ВыдачаПоПотребности.НоменклатураНормы
	|			И ВТ_ТаблицаПотребности.ДатаПотребности = ВТ_ВыдачаПоПотребности.ДатаПотребности
	|			И ВТ_ТаблицаПотребности.ПроцентИзноса = ВТ_ВыдачаПоПотребности.ПроцентИзноса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_ТаблицаПотребности.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	//АсТБ_Alexey_76619_********************************************************************
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПотребности.ДатаОкончанияОтсутствияНаРабочемМесте > ВЫБОР
	|				КОГДА ВТ_ТаблицаЗимы.Использовать
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|								ТОГДА ВЫБОР
	|										КОГДА НАЧАЛОПЕРИОДА(ВТ_ТаблицаПотребности.ДатаПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ВТ_ТаблицаЗимы.ДатаНачалаЗимы, МЕСЯЦ)
	|											ТОГДА ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|										ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|									КОНЕЦ
	|							ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|							ТОГДА ВЫБОР
	|									КОГДА НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ВТ_ПотребностьСДатойВыдачи.ДатаСледующейВыдачи, МЕСЯЦ)
	|										ТОГДА ВТ_ПотребностьСДатойВыдачи.ДатаСледующейВыдачи
	|									ИНАЧЕ &ДатаДокумента
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|					КОНЕЦ
	|			КОНЕЦ
	|			ТОГДА ВТ_ТаблицаПотребности.ДатаОкончанияОтсутствияНаРабочемМесте
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ТаблицаЗимы.Использовать
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|								ТОГДА ВЫБОР
	|										КОГДА НАЧАЛОПЕРИОДА(ВТ_ТаблицаПотребности.ДатаПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ВТ_ТаблицаЗимы.ДатаНачалаЗимы, МЕСЯЦ)
	|											ТОГДА ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|										ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|									КОНЕЦ
	|							ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|							ТОГДА ВЫБОР
	|									КОГДА НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ВТ_ПотребностьСДатойВыдачи.ДатаСледующейВыдачи, МЕСЯЦ)
	|										ТОГДА ВТ_ПотребностьСДатойВыдачи.ДатаСледующейВыдачи
	|									ИНАЧЕ &ДатаДокумента
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаПотребности,
	//АсТБ_Alexey_76619_********************************************************************
	|	ВТ_ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы,
	|	ВТ_ПотребностьСДатойВыдачи.ПроцентИзноса КАК ПроцентИзноса,
	//АсТБ_Alexey_76619_********************************************************************
	|	ВТ_ТаблицаПотребности.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПотребности.КоличествоВыдано КАК КоличествоВыдано
	//АсТБ_Alexey_76619_********************************************************************
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ТаблицаПотребности.ДатаПотребности = ВТ_ТаблицаЗимы.ДатаПериода
	|			И ВТ_ТаблицаПотребности.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьСДатойВыдачи КАК ВТ_ПотребностьСДатойВыдачи
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ПотребностьСДатойВыдачи.Сотрудник
	|			И ВТ_ТаблицаПотребности.НормаВыдачи = ВТ_ПотребностьСДатойВыдачи.НормаВыдачи
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ПотребностьСДатойВыдачи.НоменклатураНормы
	|			И ВТ_ТаблицаПотребности.ДатаПотребности = ВТ_ПотребностьСДатойВыдачи.ДатаПотребности
	|			И ВТ_ТаблицаПотребности.ПроцентИзноса = ВТ_ПотребностьСДатойВыдачи.ПроцентИзноса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",		ТаблицаЗимы);
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	Запрос.УстановитьПараметр("ДатаАнализа",		ДатаАнализа);
	Запрос.УстановитьПараметр("ДатаДокумента",		ДатаДокумента);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура СкорректироватьТаблицуВыдачиПоПотребностиПоЗиме(ТаблицаЗапроса,ТаблицаВыдачаПоПотребности,ДатаДокумента)
	
	Запрос = НОВЫЙ Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВыдачиПоПотребности.Период КАК Период,
	|	ТаблицаВыдачиПоПотребности.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВыдачиПоПотребности.Организация КАК Организация,
	|	ТаблицаВыдачиПоПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаВыдачиПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаВыдачиПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаВыдачиПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ТаблицаВыдачиПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаВыдачиПоПотребности.Количество КАК Количество,
	|	ТаблицаВыдачиПоПотребности.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаВыдачиПоПотребности
	|ИЗ
	|	&ТаблицаВыдачиПоПотребности КАК ТаблицаВыдачиПоПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКонечнойПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаКонечнойПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаКонечнойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаКонечнойПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ТаблицаКонечнойПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ТаблицаКонечнойПотребности.ДатаПотребностиБезУчетаЗимы КАК ДатаПотребностиБезУчетаЗимы,
	|	ТаблицаКонечнойПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ТаблицаКонечнойПотребности.КоличествоПотребность КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаКонечнойПотребности
	|ИЗ
	|	&ТаблицаКонечнойПотребности КАК ТаблицаКонечнойПотребности
	|ГДЕ
	|	НЕ ТаблицаКонечнойПотребности.ДатаПотребности = ТаблицаКонечнойПотребности.ДатаПотребностиБезУчетаЗимы
	|	И ТаблицаКонечнойПотребности.ЭтоЗима
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКонечнойПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаКонечнойПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаКонечнойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаКонечнойПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ТаблицаКонечнойПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаКонечнойПотребности.ДатаПотребностиБезУчетаЗимы КАК ДатаПотребностиБезУчетаЗимы,
	|	ВТ_ТаблицаКонечнойПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ТаблицаКонечнойПотребности.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ТаблицаКонечнойПотребности.ДатаПотребностиБезУчетаЗимы, МЕСЯЦ, -НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ТаблицаКонечнойПотребности.ДатаПотребностиБезУчетаЗимы, МЕСЯЦ, -НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец КАК Организация
	|ПОМЕСТИТЬ ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи
	|ИЗ
	|	ВТ_ТаблицаКонечнойПотребности КАК ВТ_ТаблицаКонечнойПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ТаблицаКонечнойПотребности.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВТ_ТаблицаКонечнойПотребности.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|ГДЕ
	|	ВТ_ТаблицаКонечнойПотребности.ЭтоЗима
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаВыдачиПоПотребности.Период КАК Период,
	|	ВТ_ТаблицаВыдачиПоПотребности.ВидДвижения КАК ВидДвижения,
	|	ВТ_ТаблицаВыдачиПоПотребности.Организация КАК Организация,
	|	ВТ_ТаблицаВыдачиПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаВыдачиПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаВыдачиПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаВыдачиПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности.Количество КАК Количество,
	|	ВТ_ТаблицаВыдачиПоПотребности.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаВыдачиПоПотребности_Расход
	|ИЗ
	|	ВТ_ТаблицаВыдачиПоПотребности КАК ВТ_ТаблицаВыдачиПоПотребности
	|ГДЕ
	|	ВТ_ТаблицаВыдачиПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаВыдачиПоПотребности.Период КАК Период,
	|	ВТ_ТаблицаВыдачиПоПотребности.ВидДвижения КАК ВидДвижения,
	|	ВТ_ТаблицаВыдачиПоПотребности.Организация КАК Организация,
	|	ВТ_ТаблицаВыдачиПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаВыдачиПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаВыдачиПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаВыдачиПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности.Количество КАК Количество,
	|	ВТ_ТаблицаВыдачиПоПотребности.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаВыдачиПоПотребности_Приход
	|ИЗ
	|	ВТ_ТаблицаВыдачиПоПотребности КАК ВТ_ТаблицаВыдачиПоПотребности
	|ГДЕ
	|	ВТ_ТаблицаВыдачиПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.Период КАК Период,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.ВидДвижения КАК ВидДвижения,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.Организация КАК Организация,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаКонечнойПотребности.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВТ_ТаблицаВыдачиПоПотребности_Приход.ДатаПотребности
	|		ИНАЧЕ ВТ_ТаблицаКонечнойПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.Количество КАК Количество,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы
	|ИЗ
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход КАК ВТ_ТаблицаВыдачиПоПотребности_Приход
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаКонечнойПотребности КАК ВТ_ТаблицаКонечнойПотребности
	|		ПО ВТ_ТаблицаВыдачиПоПотребности_Приход.Сотрудник = ВТ_ТаблицаКонечнойПотребности.Сотрудник
	|			И ВТ_ТаблицаВыдачиПоПотребности_Приход.НормаВыдачи = ВТ_ТаблицаКонечнойПотребности.НормаВыдачи
	|			И ВТ_ТаблицаВыдачиПоПотребности_Приход.НоменклатураНормы = ВТ_ТаблицаКонечнойПотребности.НоменклатураНормы
	|			И ВТ_ТаблицаВыдачиПоПотребности_Приход.ДатаПотребности = ВТ_ТаблицаКонечнойПотребности.ДатаПотребностиБезУчетаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.Период КАК Период,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.ВидДвижения КАК ВидДвижения,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.Организация КАК Организация,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.Количество КАК Количество,
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ТаблицаВыдачиПоПотребности_Расход КАК ВТ_ТаблицаВыдачиПоПотребности_Расход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.Период,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.ВидДвижения,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.Организация,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.Сотрудник,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.НормаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.НоменклатураНормы,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.ДатаПотребности,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.ДатаВыдачи,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.Количество,
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.ПроцентИзноса
	|ИЗ
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы КАК ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.Организация,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.Сотрудник,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.НормаВыдачи,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.НоменклатураНормы,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.ДатаПотребности,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.ДатаВыдачи,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.Количество,
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.ПроцентИзноса
	|ИЗ
	|	ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи КАК ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы КАК ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы
	|		ПО ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.Сотрудник = ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.Сотрудник
	|			И ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.НормаВыдачи = ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.НормаВыдачи
	|			И ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.НоменклатураНормы = ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.НоменклатураНормы
	|			И ВТ_КонечнаяПотребностьЗимняяСДатойВыдачи.ДатаПотребности = ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.ДатаПотребности
	|ГДЕ
	|	ВТ_ТаблицаВыдачиПоПотребности_Приход_СУчетомЗимы.Сотрудник ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Период КАК Период,
	|	ВТ_Результат.ВидДвижения КАК ВидДвижения,
	|	ВТ_Результат.Организация КАК Организация,
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ВидДвижения УБЫВ,
	|	ДатаПотребности,
	|	ДатаВыдачи";
	
	Запрос.УстановитьПараметр("Период",						ДатаДокумента);
	Запрос.УстановитьПараметр("ТаблицаВыдачиПоПотребности",	ТаблицаВыдачаПоПотребности);
	Запрос.УстановитьПараметр("ТаблицаКонечнойПотребности",	ТаблицаЗапроса);
	
	ТаблицаВыдачаПоПотребности = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// процедура выполняет корректировку даты потребности для новой потребности, если сотруднику уже выданы СИЗ по новой потребности
//
Процедура СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ТаблицаВыдачаПоПотребности = Неопределено)
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоОтсутствиюНаРабочемМесте(ТаблицаЗапроса, Организация, ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаКонечнойПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаКонечнойПотребности.Подразделение КАК Подразделение,
	|	ТаблицаКонечнойПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ТаблицаКонечнойПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаКонечнойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаКонечнойПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ТаблицаКонечнойПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ТаблицаКонечнойПотребности.КоличествоВыдано КАК КоличествоВыдано,
	|	ТаблицаКонечнойПотребности.ДатаОкончанияОтсутствияНаРабочемМесте КАК ДатаОкончанияОтсутствияНаРабочемМесте
	|ПОМЕСТИТЬ ВТ_ТаблицаКонечнойПотребности
	|ИЗ
	|	&ТаблицаКонечнойПотребности КАК ТаблицаКонечнойПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НЕ НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВыдачаПоПотребностиОстатки.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	ВыдачаПоПотребностиОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
	|ИЗ
	|	&ВыдачаПоПотребностиОстатки КАК ВыдачаПоПотребностиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОбороты.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОбороты.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОбороты.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОбороты.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОбороты.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОбороты.ПроцентИзноса КАК ПроцентИзноса,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|				ТОГДА ВЫБОР
	|						КОГДА ПОДСТРОКА(ВыдачаПоПотребностиОбороты.Регистратор.Комментарий, 1, 23) = ""#РасчетПоДатеДокумента#""
	|							ТОГДА ВыдачаПоПотребностиОбороты.Период
	|						ИНАЧЕ ВыдачаПоПотребностиОбороты.ДатаВыдачи
	|					КОНЕЦ
	|			ИНАЧЕ ВыдачаПоПотребностиОбороты.Период
	|		КОНЕЦ) КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_ПоследнийПриходВыдачиПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Обороты(
	|			,
	|			&ПериодРасчета,
	|			Регистратор,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОбороты
	|ГДЕ
	|	НЕ ВыдачаПоПотребностиОбороты.КоличествоПриход = 0
	|	И НЕ НАЧАЛОПЕРИОДА(ВыдачаПоПотребностиОбороты.Период, ДЕНЬ) = ВыдачаПоПотребностиОбороты.ДатаПотребности
	|	И НЕ(ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.УстановкаПериодаЗимы
	|				ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ОтсутствиеНаРабочемМесте
	|				ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ПереносЗимнейПотребности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОбороты.Сотрудник,
	|	ВыдачаПоПотребностиОбороты.НормаВыдачи,
	|	ВыдачаПоПотребностиОбороты.НоменклатураНормы,
	|	ВыдачаПоПотребностиОбороты.ДатаПотребности,
	|	ВыдачаПоПотребностиОбороты.ДатаВыдачи,
	|	ВыдачаПоПотребностиОбороты.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОбороты.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОбороты.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОбороты.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОбороты.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОбороты.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОбороты.ПроцентИзноса КАК ПроцентИзноса,
	|	МАКСИМУМ(ВыдачаПоПотребностиОбороты.Период) КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_ПоследнийРасходВыдачиПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Обороты(
	|			,
	|			&ПериодРасчета,
	|			Регистратор,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОбороты
	|ГДЕ
	|	НЕ ВыдачаПоПотребностиОбороты.КоличествоРасход = 0
	|	И НЕ НАЧАЛОПЕРИОДА(ВыдачаПоПотребностиОбороты.Период, ДЕНЬ) = ВыдачаПоПотребностиОбороты.ДатаПотребности
	|	И НЕ ВыдачаПоПотребностиОбороты.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И НЕ(ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.УстановкаПериодаЗимы
	|				ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ОтсутствиеНаРабочемМесте
	|				ИЛИ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.ПереносЗимнейПотребности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОбороты.Сотрудник,
	|	ВыдачаПоПотребностиОбороты.НормаВыдачи,
	|	ВыдачаПоПотребностиОбороты.НоменклатураНормы,
	|	ВыдачаПоПотребностиОбороты.ДатаПотребности,
	|	ВыдачаПоПотребностиОбороты.ДатаВыдачи,
	|	ВыдачаПоПотребностиОбороты.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_ВыдачаПоПотребности.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_АктуальнаяВыдачаПоПотребности
	|ИЗ
	|	ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнийПриходВыдачиПоПотребности КАК ВТ_ПоследнийПриходВыдачиПоПотребности
	|		ПО ВТ_ВыдачаПоПотребности.НормаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.НормаВыдачи
	|			И ВТ_ВыдачаПоПотребности.НоменклатураНормы = ВТ_ПоследнийПриходВыдачиПоПотребности.НоменклатураНормы
	|			И ВТ_ВыдачаПоПотребности.ДатаПотребности = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаПотребности
	|			И ВТ_ВыдачаПоПотребности.ДатаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаВыдачи
	|			И ВТ_ВыдачаПоПотребности.ПроцентИзноса = ВТ_ПоследнийПриходВыдачиПоПотребности.ПроцентИзноса
	|			И ВТ_ВыдачаПоПотребности.Сотрудник = ВТ_ПоследнийПриходВыдачиПоПотребности.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальнаяВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_АктуальнаяВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_АктуальнаяВыдачаПоПотребности.Количество КАК Количество,
	|	ЛОЖЬ КАК ДатаПотребностиРассчитана
	|ПОМЕСТИТЬ ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности
	|ИЗ
	|	ВТ_АктуальнаяВыдачаПоПотребности КАК ВТ_АктуальнаяВыдачаПоПотребности
	|ГДЕ
	|	НЕ ВТ_АктуальнаяВыдачаПоПотребности.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальнаяВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_АктуальнаяВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_АктуальнаяВыдачаПоПотребности.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности
	|ИЗ
	|	ВТ_АктуальнаяВыдачаПоПотребности КАК ВТ_АктуальнаяВыдачаПоПотребности
	|ГДЕ
	|	ВТ_АктуальнаяВыдачаПоПотребности.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПоследнийРасходВыдачиПоПотребности.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СоставНормы.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов * 12)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов)
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ПоследнийРасходВыдачиПоПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.Количество КАК Количество,
	|	ИСТИНА КАК ДатаПотребностиРассчитана
	|ПОМЕСТИТЬ ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности
	|ИЗ
	|	ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности КАК ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнийРасходВыдачиПоПотребности КАК ВТ_ПоследнийРасходВыдачиПоПотребности
	|		ПО ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.Сотрудник = ВТ_ПоследнийРасходВыдачиПоПотребности.Сотрудник
	|			И ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.НормаВыдачи = ВТ_ПоследнийРасходВыдачиПоПотребности.НормаВыдачи
	|			И ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.НоменклатураНормы = ВТ_ПоследнийРасходВыдачиПоПотребности.НоменклатураНормы
	|			И ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ДатаВыдачи = ВТ_ПоследнийРасходВыдачиПоПотребности.ДатаВыдачи
	|			И ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ПроцентИзноса = ВТ_ПоследнийРасходВыдачиПоПотребности.ПроцентИзноса
	|			И ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.ДатаДокумента = ВТ_ПоследнийРасходВыдачиПоПотребности.ДатаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_АктуальнаяВыдачаПоПотребностиБезДатыПотребности.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.Количество КАК Количество,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности.ДатаПотребностиРассчитана КАК ДатаПотребностиРассчитана
	|ПОМЕСТИТЬ ВТ_СобраннаяАктуальнаяВыдачаПоПотребности
	|ИЗ
	|	ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности КАК ВТ_АктуальнаяВыдачаПоПотребностиСДатойПотребности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.Сотрудник,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.НормаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.НоменклатураНормы,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.ДатаПотребности,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.ДатаВыдачи,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.ПроцентИзноса,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.ДатаДокумента,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.Количество,
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности.ДатаПотребностиРассчитана
	|ИЗ
	|	ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности КАК ВТ_АктуальнаяВыдачаПоПотребностиСРасчетнойДатойПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаДокумента КАК ДатаДокумента,
	|	СУММА(ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.Количество) КАК Количество,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаПотребностиРассчитана КАК ДатаПотребностиРассчитана
	|ПОМЕСТИТЬ ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности
	|ИЗ
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности КАК ВТ_СобраннаяАктуальнаяВыдачаПоПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.Сотрудник,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.НормаВыдачи,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.НоменклатураНормы,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаПотребности,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаВыдачи,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ПроцентИзноса,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаДокумента,
	|	ВТ_СобраннаяАктуальнаяВыдачаПоПотребности.ДатаПотребностиРассчитана
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.Количество КАК Количество,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаПотребностиРассчитана КАК ДатаПотребностиРассчитана,
	|	ВТ_ТаблицаКонечнойПотребности.ДатаОкончанияОтсутствияНаРабочемМесте КАК ДатаОкончанияОтсутствияНаРабочемМесте
	|ПОМЕСТИТЬ ВТ_ВыдачаБезПотребности
	|ИЗ
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности КАК ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаКонечнойПотребности КАК ВТ_ТаблицаКонечнойПотребности
	|		ПО ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.Сотрудник = ВТ_ТаблицаКонечнойПотребности.Сотрудник
	|			И ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НормаВыдачи = ВТ_ТаблицаКонечнойПотребности.НормаВыдачи
	|			И ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НоменклатураНормы = ВТ_ТаблицаКонечнойПотребности.НоменклатураНормы
	|			И ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаПотребности = ВТ_ТаблицаКонечнойПотребности.ДатаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НоменклатураНормы = ВТ_ВыданныеСИЗ.НоменклатураНормы
	|			И ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаВыдачи = ВТ_ВыданныеСИЗ.ДатаВыдачи
	|ГДЕ
	|	ВТ_ТаблицаКонечнойПотребности.КоличествоПотребность ЕСТЬ NULL
	|	И НЕ ВТ_ВыданныеСИЗ.КоличествоОстаток ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКонечнойПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаКонечнойПотребности.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаКонечнойПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ТаблицаКонечнойПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаКонечнойПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаКонечнойПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаКонечнойПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ЕСТЬNULL(ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыдачи,
	|	ЕСТЬNULL(ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ПроцентИзноса, 0) КАК ПроцентИзноса,
	|	ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаДокумента КАК ДатаДокумента,
	|	ЕСТЬNULL(ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.Количество, 0) КАК КоличествоВыдано,
	|	ВТ_ТаблицаКонечнойПотребности.ДатаОкончанияОтсутствияНаРабочемМесте КАК ДатаОкончанияОтсутствияНаРабочемМесте
	|ПОМЕСТИТЬ ВТ_ПотребностьИВыдача
	|ИЗ
	|	ВТ_ТаблицаКонечнойПотребности КАК ВТ_ТаблицаКонечнойПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности КАК ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности
	|		ПО ВТ_ТаблицаКонечнойПотребности.Сотрудник = ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.Сотрудник
	|			И ВТ_ТаблицаКонечнойПотребности.НормаВыдачи = ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НормаВыдачи
	|			И ВТ_ТаблицаКонечнойПотребности.НоменклатураНормы = ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.НоменклатураНормы
	|			И ВТ_ТаблицаКонечнойПотребности.ДатаПотребности = ВТ_СгруппированнаяАктуальнаяВыдачаПоПотребности.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьИВыдача.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьИВыдача.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьИВыдача.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьИВыдача.ДатаПотребности КАК ДатаПотребности,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПотребностьИВыдача.ДатаВыдачи) КАК КоличествоДатВыдачи
	|ПОМЕСТИТЬ ВТ_РазличныеДатыВыдачиПоДатеПотребности
	|ИЗ
	|	ВТ_ПотребностьИВыдача КАК ВТ_ПотребностьИВыдача
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьИВыдача.Сотрудник,
	|	ВТ_ПотребностьИВыдача.НормаВыдачи,
	|	ВТ_ПотребностьИВыдача.НоменклатураНормы,
	|	ВТ_ПотребностьИВыдача.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьИВыдача.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьИВыдача.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьИВыдача.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПотребностьИВыдача.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьИВыдача.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ВТ_ПотребностьИВыдача.ДатаПотребности, ДЕНЬ) КАК ДатаПотребности,
	|	ВТ_ПотребностьИВыдача.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьИВыдача.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ПотребностьИВыдача.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ПотребностьИВыдача.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_СоставНормы.ПериодичностьВыдачиТипПериода КАК ТипПериода,
	|	ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов КАК КоличествоПериодов,
	|	СУММА(ВТ_ПотребностьИВыдача.КоличествоВыдано) КАК КоличествоВыдано,
	|	ВТ_ПотребностьИВыдача.ДатаОкончанияОтсутствияНаРабочемМесте КАК ДатаОкончанияОтсутствияНаРабочемМесте
	|ИЗ
	|	ВТ_ПотребностьИВыдача КАК ВТ_ПотребностьИВыдача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_ПотребностьИВыдача.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_ПотребностьИВыдача.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьИВыдача.Сотрудник,
	|	ВТ_ПотребностьИВыдача.ДатаВыдачи,
	|	ВТ_ПотребностьИВыдача.ДатаДокумента,
	|	ВТ_ПотребностьИВыдача.КоличествоПотребность,
	|	ВТ_СоставНормы.ПериодичностьВыдачиТипПериода,
	|	ВТ_ПотребностьИВыдача.ЭтоЗима,
	|	НАЧАЛОПЕРИОДА(ВТ_ПотребностьИВыдача.ДатаПотребности, ДЕНЬ),
	|	ВТ_ПотребностьИВыдача.НоменклатураНормы,
	|	ВТ_ПотребностьИВыдача.НормаВыдачи,
	|	ВТ_ПотребностьИВыдача.Подразделение,
	|	ВТ_ПотребностьИВыдача.ПроцентИзноса,
	|	ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_ПотребностьИВыдача.ДатаОкончанияОтсутствияНаРабочемМесте
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаПотребности,
	|	ВТ_ПотребностьИВыдача.ДатаВыдачи,
	|	ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаБезПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаБезПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаБезПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ВТ_ВыдачаБезПотребности.ДатаПотребности, ДЕНЬ) КАК ДатаПотребности,
	|	ВТ_ВыдачаБезПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаБезПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ВыдачаБезПотребности.ПроцентИзноса КАК НовыйПроцентИзноса,
	|	ВТ_ВыдачаБезПотребности.Количество КАК Количество,
	|	ВТ_ВыдачаБезПотребности.ДатаПотребностиРассчитана КАК ДатаПотребностиРассчитана,
	|	0 КАК КоличествоЗачтено
	|ИЗ
	|	ВТ_ВыдачаБезПотребности КАК ВТ_ВыдачаБезПотребности
	|ГДЕ
	|	ВТ_ВыдачаБезПотребности.ПроцентИзноса < 100
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы,
	|	ДатаВыдачи УБЫВ,
	|	НовыйПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПотребностьИВыдача.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьИВыдача.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_ПотребностьИВыдача КАК ВТ_ПотребностьИВыдача
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РазличныеДатыВыдачиПоДатеПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_РазличныеДатыВыдачиПоДатеПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_РазличныеДатыВыдачиПоДатеПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_РазличныеДатыВыдачиПоДатеПотребности.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_РазличныеДатыВыдачиПоДатеПотребности КАК ВТ_РазличныеДатыВыдачиПоДатеПотребности
	|ГДЕ
	|	ВТ_РазличныеДатыВыдачиПоДатеПотребности.КоличествоДатВыдачи > 1";
	
	Запрос.УстановитьПараметр("ТаблицаКонечнойПотребности",	ТаблицаЗапроса);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("ПериодРасчета",				ДатаАнализа);
	Запрос.УстановитьПараметр("Период",						ДатаАнализа.Значение.Дата);
	Запрос.УстановитьПараметр("МассивСотрудников",			МассивСотрудников);
	//***НСК Трегубов А.А.*** --№73822 проценты износа в 4 алгоритме --  23.06.2021 <<<	
	Запрос.УстановитьПараметр("ВыдачаПоПотребностиОстатки",	ТаблицыВыданныхПоПотребностиСПривязкойВыданныхСИЗ(ДатаАнализа,МассивСотрудников,Организация,ДатаАнализа.Значение.Дата));
	//***НСК Трегубов А.А.*** --№73822 проценты износа в 4 алгоритме --  23.06.2021 >>>	

	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаПотребности 							= Результат[15].Выгрузить();
	ТаблицаВыдачиБезПотребности 				= Результат[16].Выгрузить();
	ТаблицаДляПоискаПотребности 				= Результат[17].Выгрузить();
	ТаблицаРазличныхДатВыдачиПоДатеПотребности 	= Результат[18].Выгрузить();
	
	//распускаем потребность с различными датами выдачи
	Для Каждого СтрокаТаблицыРазличныхДатВыдачиПоДатеПотребности Из ТаблицаРазличныхДатВыдачиПоДатеПотребности Цикл
		
		СтруктураПоиска = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыРазличныхДатВыдачиПоДатеПотребности);
		
		НайденныеСтроки = ТаблицаПотребности.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоПотребность = НайденныеСтроки[0].КоличествоПотребность;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			НайденнаяСтрока.КоличествоПотребность = НайденнаяСтрока.КоличествоВыдано;
			
			КоличествоПотребность = КоличествоПотребность - НайденнаяСтрока.КоличествоВыдано;
			
		КонецЦикла;
		
		Если НЕ КоличествоПотребность = 0 Тогда
			НоваяСтрока 						= ТаблицаПотребности.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденныеСтроки[0]);
			НоваяСтрока.ДатаВыдачи 				= Дата('00010101');
			НоваяСтрока.КоличествоПотребность 	= КоличествоПотребность;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если НЕ ТаблицаРазличныхДатВыдачиПоДатеПотребности.Количество() = 0 Тогда //нужно повторить упорядочивание, как в запросе
		ТаблицаПотребности.Сортировать("Сотрудник, НормаВыдачи, НоменклатураНормы, ДатаПотребности, ДатаВыдачи, ПроцентИзноса");
	КонецЕсли;
	
	//+++АСТБ_Горюшин_Алексей_26412
	ПроверитьИСкорректироватьКоличествоПотребность(ТаблицаПотребности);
	//---АСТБ_Горюшин_Алексей_26412
	
	ТаблицаЗапроса.Очистить();
	
	Для Каждого СтрокаТаблицыДляПоиска Из ТаблицаДляПоискаПотребности Цикл
		
		СтруктураПоиска = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыДляПоиска);
		
		НайденныеСтрокиПотребности = ТаблицаПотребности.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрокаПотребности Из НайденныеСтрокиПотребности Цикл
			
			Если НЕ НайденнаяСтрокаПотребности.КоличествоВыдано = 0 Тогда
				НоваяСтрока = ТаблицаЗапроса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрокаПотребности);
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаВыдачиБезПотребности.НайтиСтроки(СтруктураПоиска);
			
			ОстатокПоПотребности = НайденнаяСтрокаПотребности.КоличествоПотребность;
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если НайденнаяСтрока.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				//*****возможно, это ошибка: расчет новой даты потребности следует рассчитывать позже*****
				//Если НайденнаяСтрока.ПроцентИзноса = 0 Тогда
				//	ДатаПотребностиПоВыдаче = ПроцедурыРаботыСНормамиСервер.РассчитатьДатуПотребностиПоИзносу(НайденнаяСтрока.ДатаВыдачи,
				//	НайденнаяСтрокаПотребности.ТипПериода,
				//	НайденнаяСтрокаПотребности.КоличествоПериодов,
				//	НайденнаяСтрока.ПроцентИзноса);
				//	
				//	Если НачалоМесяца(ДатаПотребностиПоВыдаче) <= НачалоМесяца(ДатаАнализа.Значение.Дата) Тогда	//срок носки закончен																										
				//		Продолжить;
				//	КонецЕсли;
				//КонецЕсли;
				//*****возможно, это ошибка: расчет новой даты потребности следует рассчитывать позже*****
																															
				Если НайденнаяСтрока.Количество < ОстатокПоПотребности Тогда
					
					//Если НайденнаяСтрока.НовыйПроцентИзноса = 0 Тогда
					//	ИсходнаяДата = НайденнаяСтрока.ДатаВыдачи;
					//Иначе
					//	ИсходнаяДата = ДатаАнализа.Значение.Дата;
					//КонецЕсли;
					
					ИсходнаяДата = НайденнаяСтрока.ДатаВыдачи;
					
					НоваяДатаПотребности = ПроцедурыРаботыСНормамиСервер.РассчитатьДатуПотребностиПоИзносу(ИсходнаяДата,НайденнаяСтрокаПотребности.ТипПериода,
																															НайденнаяСтрокаПотребности.КоличествоПериодов,
																															Окр(НайденнаяСтрока.НовыйПроцентИзноса,6,РежимОкругления.Окр15как20));
																															
					Если НачалоМесяца(НоваяДатаПотребности) <= НачалоМесяца(ДатаАнализа.Значение.Дата) Тогда	//срок носки закончен																										
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ТаблицаЗапроса.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрокаПотребности);
					НоваяСтрока.КоличествоПотребность 	= НайденнаяСтрока.Количество;
					НоваяСтрока.КоличествоВыдано 		= НайденнаяСтрока.Количество;
					
					Если НоваяДатаПотребности > НайденнаяСтрокаПотребности.ДатаОкончанияОтсутствияНаРабочемМесте Тогда																										
						НоваяСтрока.ДатаПотребности = НоваяДатаПотребности;
					КонецЕсли;
					НоваяСтрока.ПроцентИзноса 			= Окр(НайденнаяСтрока.НовыйПроцентИзноса,6,РежимОкругления.Окр15как20);
					ОстатокПоПотребности 				= ОстатокПоПотребности - НайденнаяСтрока.Количество;
					НайденнаяСтрока.КоличествоЗачтено 	= НайденнаяСтрока.Количество;
					НайденнаяСтрока.Количество 			= 0;
										
					//новая запись по регистру "ВыдачаПоПотребности"
					//приход
					ВыдачаПоПотребности_НоваяСтрока 					= ТаблицаВыдачаПоПотребности.Добавить();
					ВыдачаПоПотребности_НоваяСтрока.Период 				= ДатаАнализа.Значение.Дата;
					ВыдачаПоПотребности_НоваяСтрока.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					ВыдачаПоПотребности_НоваяСтрока.Организация 		= Организация;
					ВыдачаПоПотребности_НоваяСтрока.Сотрудник 			= НайденнаяСтрокаПотребности.Сотрудник;
					ВыдачаПоПотребности_НоваяСтрока.НормаВыдачи 		= НоваяСтрока.НормаВыдачи;
					ВыдачаПоПотребности_НоваяСтрока.НоменклатураНормы 	= НайденнаяСтрокаПотребности.НоменклатураНормы;
					ВыдачаПоПотребности_НоваяСтрока.ДатаПотребности 	= НоваяСтрока.ДатаПотребности;
					ВыдачаПоПотребности_НоваяСтрока.ДатаВыдачи 			= НайденнаяСтрока.ДатаВыдачи;
					ВыдачаПоПотребности_НоваяСтрока.Количество 			= НоваяСтрока.КоличествоПотребность;
					ВыдачаПоПотребности_НоваяСтрока.ПроцентИзноса 		= Окр(НайденнаяСтрока.НовыйПроцентИзноса,6,РежимОкругления.Окр15как20);
					
				Иначе
					
					//Если НайденнаяСтрока.НовыйПроцентИзноса = 0 Тогда
					//	ИсходнаяДата = НайденнаяСтрока.ДатаВыдачи;
					//Иначе
					//	ИсходнаяДата = ДатаАнализа.Значение.Дата;
					//КонецЕсли;
					
					ИсходнаяДата = НайденнаяСтрока.ДатаВыдачи;
					
					НоваяДатаПотребности = ПроцедурыРаботыСНормамиСервер.РассчитатьДатуПотребностиПоИзносу(ИсходнаяДата,НайденнаяСтрокаПотребности.ТипПериода,
																															НайденнаяСтрокаПотребности.КоличествоПериодов,
																															Окр(НайденнаяСтрока.НовыйПроцентИзноса,6,РежимОкругления.Окр15как20));
																															
					Если НачалоМесяца(НоваяДатаПотребности) <= НачалоМесяца(ДатаАнализа.Значение.Дата) Тогда	//срок носки закончен																										
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ТаблицаЗапроса.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрокаПотребности);
					НоваяСтрока.КоличествоПотребность 	= ОстатокПоПотребности;
					НоваяСтрока.КоличествоВыдано 		= ОстатокПоПотребности;
					
					Если НоваяДатаПотребности > НайденнаяСтрокаПотребности.ДатаОкончанияОтсутствияНаРабочемМесте Тогда																										
						НоваяСтрока.ДатаПотребности = НоваяДатаПотребности;
					КонецЕсли;																										
					НоваяСтрока.ПроцентИзноса 			= Окр(НайденнаяСтрока.НовыйПроцентИзноса,6,РежимОкругления.Окр15как20);
					НайденнаяСтрока.Количество 			= НайденнаяСтрока.Количество - ОстатокПоПотребности;
					НайденнаяСтрока.КоличествоЗачтено 	= ОстатокПоПотребности;
					ОстатокПоПотребности 				= 0;
					
					//новая запись по регистру "ВыдачаПоПотребности"
					//приход
					ВыдачаПоПотребности_НоваяСтрока 					= ТаблицаВыдачаПоПотребности.Добавить();
					ВыдачаПоПотребности_НоваяСтрока.Период 				= ДатаАнализа.Значение.Дата;
					ВыдачаПоПотребности_НоваяСтрока.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					ВыдачаПоПотребности_НоваяСтрока.Организация 		= Организация;
					ВыдачаПоПотребности_НоваяСтрока.Сотрудник 			= НайденнаяСтрокаПотребности.Сотрудник;
					ВыдачаПоПотребности_НоваяСтрока.НормаВыдачи 		= НоваяСтрока.НормаВыдачи;
					ВыдачаПоПотребности_НоваяСтрока.НоменклатураНормы 	= НайденнаяСтрокаПотребности.НоменклатураНормы;
					ВыдачаПоПотребности_НоваяСтрока.ДатаПотребности 	= НоваяСтрока.ДатаПотребности;
					ВыдачаПоПотребности_НоваяСтрока.ДатаВыдачи 			= НайденнаяСтрока.ДатаВыдачи;
					ВыдачаПоПотребности_НоваяСтрока.Количество 			= НоваяСтрока.КоличествоПотребность;
					ВыдачаПоПотребности_НоваяСтрока.ПроцентИзноса 		= Окр(НайденнаяСтрока.НовыйПроцентИзноса,6,РежимОкругления.Окр15как20);
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ОстатокПоПотребности = 0 Тогда
				
				НоваяСтрока = ТаблицаЗапроса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрокаПотребности);
				НоваяСтрока.КоличествоПотребность 	= ОстатокПоПотребности;
				НоваяСтрока.КоличествоВыдано 		= 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаЗапроса.Свернуть("Сотрудник,Подразделение,ЭтоЗима,НормаВыдачи,НоменклатураНормы,ДатаПотребности,ПроцентИзноса","КоличествоПотребность,КоличествоВыдано");
	
	//выполняем движения по зачтенной выдаче без потребности
	ИсходнаяТаблицаВыдачиБезПотребности = Результат[16].Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходнаяТаблицаВыдачиБезПотребности.Сотрудник КАК Сотрудник,
	|	ИсходнаяТаблицаВыдачиБезПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ИсходнаяТаблицаВыдачиБезПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ИсходнаяТаблицаВыдачиБезПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ИсходнаяТаблицаВыдачиБезПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана КАК ДатаПотребностиРассчитана,
	|	ИсходнаяТаблицаВыдачиБезПотребности.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ИсходнаяТаблицаВыдачиБезПотребности
	|ИЗ
	|	&ИсходнаяТаблицаВыдачиБезПотребности КАК ИсходнаяТаблицаВыдачиБезПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВыдачиБезПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаВыдачиБезПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаВыдачиБезПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаВыдачиБезПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ТаблицаВыдачиБезПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаВыдачиБезПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана КАК ДатаПотребностиРассчитана,
	|	ТаблицаВыдачиБезПотребности.Количество КАК Количество,
	|	ТаблицаВыдачиБезПотребности.КоличествоЗачтено КАК КоличествоЗачтено
	|ПОМЕСТИТЬ ВТ_ТаблицаВыдачиБезПотребности
	|ИЗ
	|	&ТаблицаВыдачиБезПотребности КАК ТаблицаВыдачиБезПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ПроцентИзноса КАК ПроцентИзноса,
	//+++АСТБ_Горюшин_Алексей_24806
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.Количество КАК Количество
	//было
	//|	ВТ_ТаблицаВыдачиБезПотребности.КоличествоЗачтено КАК Количество
	//---АСТБ_Горюшин_Алексей_24806
	|ПОМЕСТИТЬ ВТ_Расход
	|ИЗ
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности КАК ВТ_ИсходнаяТаблицаВыдачиБезПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаВыдачиБезПотребности КАК ВТ_ТаблицаВыдачиБезПотребности
	|		ПО ВТ_ИсходнаяТаблицаВыдачиБезПотребности.Сотрудник = ВТ_ТаблицаВыдачиБезПотребности.Сотрудник
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НормаВыдачи = ВТ_ТаблицаВыдачиБезПотребности.НормаВыдачи
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НоменклатураНормы = ВТ_ТаблицаВыдачиБезПотребности.НоменклатураНормы
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребности = ВТ_ТаблицаВыдачиБезПотребности.ДатаПотребности
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаВыдачи = ВТ_ТаблицаВыдачиБезПотребности.ДатаВыдачи
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ПроцентИзноса = ВТ_ТаблицаВыдачиБезПотребности.ПроцентИзноса
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана = ВТ_ТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана
	|ГДЕ
	|	НЕ ВТ_ТаблицаВыдачиБезПотребности.КоличествоЗачтено = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаПотребности,
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаВыдачиБезПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ТаблицаВыдачиБезПотребности.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Приход
	|ИЗ
	|	ВТ_ИсходнаяТаблицаВыдачиБезПотребности КАК ВТ_ИсходнаяТаблицаВыдачиБезПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаВыдачиБезПотребности КАК ВТ_ТаблицаВыдачиБезПотребности
	|		ПО ВТ_ИсходнаяТаблицаВыдачиБезПотребности.Сотрудник = ВТ_ТаблицаВыдачиБезПотребности.Сотрудник
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НормаВыдачи = ВТ_ТаблицаВыдачиБезПотребности.НормаВыдачи
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.НоменклатураНормы = ВТ_ТаблицаВыдачиБезПотребности.НоменклатураНормы
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребности = ВТ_ТаблицаВыдачиБезПотребности.ДатаПотребности
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаВыдачи = ВТ_ТаблицаВыдачиБезПотребности.ДатаВыдачи
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ПроцентИзноса = ВТ_ТаблицаВыдачиБезПотребности.ПроцентИзноса
	|			И ВТ_ИсходнаяТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана = ВТ_ТаблицаВыдачиБезПотребности.ДатаПотребностиРассчитана
	|ГДЕ
	|	НЕ ВТ_ТаблицаВыдачиБезПотребности.Количество = 0
	|	И НЕ ВТ_ТаблицаВыдачиБезПотребности.КоличествоЗачтено = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расход.Период КАК Период,
	|	ВТ_Расход.ВидДвижения КАК ВидДвижения,
	|	ВТ_Расход.Организация КАК Организация,
	|	ВТ_Расход.Сотрудник КАК Сотрудник,
	|	ВТ_Расход.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Расход.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ВТ_Расход.ДатаПотребности, ДЕНЬ) КАК ДатаПотребности,
	|	ВТ_Расход.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Расход.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_Расход.Количество КАК Количество
	|ИЗ
	|	ВТ_Расход КАК ВТ_Расход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Приход.Период,
	|	ВТ_Приход.ВидДвижения,
	|	ВТ_Приход.Организация,
	|	ВТ_Приход.Сотрудник,
	|	ВТ_Приход.НормаВыдачи,
	|	ВТ_Приход.НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ВТ_Приход.ДатаПотребности, ДЕНЬ),
	|	ВТ_Приход.ДатаВыдачи,
	|	ВТ_Приход.ПроцентИзноса,
	|	ВТ_Приход.Количество
	|ИЗ
	|	ВТ_Приход КАК ВТ_Приход
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаПотребности,
	|	ДатаВыдачи,
	|	ПроцентИзноса,
	|	ВидДвижения УБЫВ";
	
	Запрос.УстановитьПараметр("ИсходнаяТаблицаВыдачиБезПотребности",ИсходнаяТаблицаВыдачиБезПотребности);
	Запрос.УстановитьПараметр("ТаблицаВыдачиБезПотребности",		ТаблицаВыдачиБезПотребности);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("Период",								ДатаАнализа.Значение.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаВыдачаПоПотребности.Добавить(),Выборка);
	КонецЦикла;
	
	ТаблицаВыдачаПоПотребности.Свернуть("Период,ВидДвижения,Организация,Сотрудник,НормаВыдачи,НоменклатураНормы,ДатаПотребности,ДатаВыдачи,ПроцентИзноса","Количество");
	
КонецПроцедуры

Процедура ВыдачаСредствЗащитыСотруднику_ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка,ТаблицаДвижений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Комплект
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК Период,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК ДатаВыдачи,
	//Танцюра А.Н. -- №123218 Комплекты с одинаковыми комплектующими -- 27.09.2021 <<<
	//+++АсТБ_Alexey_103065_*******************************************************************
	//|	СУММА(ВЫБОР
	//|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	//|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	//|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество / ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	//|		КОНЕЦ) КАК КоличествоСумма,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	//|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	//|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество / ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	//|		КОНЕЦ) КАК КоличествоМаксимум,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Количество) КАК КоличествоСумма,
	|	МАКСИМУМ(ВыдачаСредствЗащитыСотрудникуТовары.Количество) КАК КоличествоМаксимум,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта,
	//---АсТБ_Alexey_103065_*******************************************************************
	//Танцюра А.Н. -- №123218 Комплекты с одинаковыми комплектующими -- 27.09.2021 >>>
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ДвиженияПоВыдаче
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Комплект
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса,
	//+++АсТБ_Alexey_103065_*******************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта,
	//---АсТБ_Alexey_103065_*******************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_ДвиженияПоВыдаче.Номенклатура КАК Номенклатура,
	|	ВТ_ДвиженияПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ДвиженияПоВыдаче.Организация КАК Организация,
	|	ВТ_ДвиженияПоВыдаче.Период КАК Период,
	|	ВТ_ДвиженияПоВыдаче.Сотрудник КАК Сотрудник,
	|	ВТ_ДвиженияПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ДвиженияПоВыдаче.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ДвиженияПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
	//+++АсТБ_Alexey_103065_*******************************************************************
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДвиженияПоВыдаче.Номенклатура.Комплект
	|				ТОГДА ВТ_ДвиженияПоВыдаче.КоличествоМаксимум
	|			ИНАЧЕ ВТ_ДвиженияПоВыдаче.КоличествоСумма
	|		КОНЕЦ) КАК Количество,
	//---АсТБ_Alexey_103065_*******************************************************************
	|	ВТ_ДвиженияПоВыдаче.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ДвиженияПоВыдаче КАК ВТ_ДвиженияПоВыдаче
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА ВТ_ДвиженияПоВыдаче.Номенклатура.Комплект
	|					ТОГДА ВТ_ДвиженияПоВыдаче.КоличествоМаксимум
	|				ИНАЧЕ ВТ_ДвиженияПоВыдаче.КоличествоСумма
	|			КОНЕЦ = 0
	|
	//+++АсТБ_Alexey_103065_*******************************************************************
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДвиженияПоВыдаче.Номенклатура,
	|	ВТ_ДвиженияПоВыдаче.ХарактеристикаНоменклатуры,
	|	ВТ_ДвиженияПоВыдаче.Организация,
	|	ВТ_ДвиженияПоВыдаче.Период,
	|	ВТ_ДвиженияПоВыдаче.Сотрудник,
	|	ВТ_ДвиженияПоВыдаче.НоменклатураНормы,
	|	ВТ_ДвиженияПоВыдаче.НормаВыдачи,
	|	ВТ_ДвиженияПоВыдаче.ДатаВыдачи,
	|	ВТ_ДвиженияПоВыдаче.ПроцентИзноса";
	//---АсТБ_Alexey_103065_*******************************************************************
	
	Запрос.УстановитьПараметр("Ссылка",	ДокументСсылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

Процедура ОбменСредствЗащитыСотрудника_ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка,ТаблицаДвижений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОбменСредствЗащитыСотрудникаТовары.НомерСтроки,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Организация,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Сотрудник,
	|	ОбменСредствЗащитыСотрудникаТовары.НормаВыдачи,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураНормыДляВозврата КАК НоменклатураНормы,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураДляВозврата КАК Номенклатура,
	|	ОбменСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатурыДляВозврата КАК ХарактеристикаНоменклатуры,
	|	ОбменСредствЗащитыСотрудникаТовары.Количество,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК Период,
	|	ОбменСредствЗащитыСотрудникаТовары.ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_РасходПовыданнымСИЗ
	|ИЗ
	|	Документ.ОбменСредствЗащитыСотрудника.Товары КАК ОбменСредствЗащитыСотрудникаТовары
	|ГДЕ
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОбменСредствЗащитыСотрудникаТовары.НомерСтроки,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Организация,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Сотрудник,
	|	ОбменСредствЗащитыСотрудникаТовары.НормаВыдачи,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураНормыДляВыдачи КАК НоменклатураНормы,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураДляВыдачи КАК Номенклатура,
	|	ОбменСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатурыДляВыдачи КАК ХарактеристикаНоменклатуры,
	|	ОбменСредствЗащитыСотрудникаТовары.Количество,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК Период,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ПриходПоВыданнымСИЗ
	|ИЗ
	|	Документ.ОбменСредствЗащитыСотрудника.Товары КАК ОбменСредствЗащитыСотрудникаТовары
	|ГДЕ
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходПовыданнымСИЗ.НомерСтроки,
	|	ВТ_РасходПовыданнымСИЗ.Период,
	|	ВТ_РасходПовыданнымСИЗ.ВидДвижения КАК ВидДвижения,
	|	ВТ_РасходПовыданнымСИЗ.Организация КАК Организация,
	|	ВТ_РасходПовыданнымСИЗ.Сотрудник КАК Сотрудник,
	|	ВТ_РасходПовыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_РасходПовыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_РасходПовыданнымСИЗ.Номенклатура КАК Номенклатура,
	|	ВТ_РасходПовыданнымСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_РасходПовыданнымСИЗ.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_РасходПовыданнымСИЗ.Количество
	|ИЗ
	|	ВТ_РасходПовыданнымСИЗ КАК ВТ_РасходПовыданнымСИЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПриходПоВыданнымСИЗ.НомерСтроки,
	|	ВТ_ПриходПоВыданнымСИЗ.Период,
	|	ВТ_ПриходПоВыданнымСИЗ.ВидДвижения,
	|	ВТ_ПриходПоВыданнымСИЗ.Организация,
	|	ВТ_ПриходПоВыданнымСИЗ.Сотрудник,
	|	ВТ_ПриходПоВыданнымСИЗ.НормаВыдачи,
	|	ВТ_ПриходПоВыданнымСИЗ.НоменклатураНормы,
	|	ВТ_ПриходПоВыданнымСИЗ.Номенклатура,
	|	ВТ_ПриходПоВыданнымСИЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ПриходПоВыданнымСИЗ.ДатаВыдачи,
	|	ВТ_ПриходПоВыданнымСИЗ.Количество
	|ИЗ
	|	ВТ_ПриходПоВыданнымСИЗ КАК ВТ_ПриходПоВыданнымСИЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	НормаВыдачи,
	|	ВидДвижения УБЫВ";
	
	
	Запрос.УстановитьПараметр("Ссылка",	ДокументСсылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

Процедура СписаниеСредствЗащитыСотрудника_ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка,ТаблицаДвижений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК Период,
	|	СписаниеСредствЗащитыСотрудникаТовары.НомерСтроки,
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка.Организация,
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка.Сотрудник,
	|	СписаниеСредствЗащитыСотрудникаТовары.НормаВыдачи КАК НормаВыдачи,
	|	СписаниеСредствЗащитыСотрудникаТовары.НоменклатураНормы,
	|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура,
	|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры,
	|	СписаниеСредствЗащитыСотрудникаТовары.Количество,
	|	СписаниеСредствЗащитыСотрудникаТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	СписаниеСредствЗащитыСотрудникаТовары.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	Документ.СписаниеСредствЗащитыСотрудника.Товары КАК СписаниеСредствЗащитыСотрудникаТовары
	|ГДЕ
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

Процедура ПолучитьСтруктуруТаблицДвиженийПоЗачетуУпрощеннойВыдачи(ДокументСсылка,СтруктураТаблицДвижений) Экспорт
	
	ТаблицаВыданныеСредстваЗащиты 	= СтруктураТаблицДвижений.ТаблицаВыданныеСредстваЗащиты;
	ТаблицаПотребностьВыдачиСИЗ 	= СтруктураТаблицДвижений.ТаблицаПотребностьВыдачиСИЗ;
	ТаблицаВыдачаПоПотребности 		= СтруктураТаблицДвижений.ТаблицаВыдачаПоПотребности;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗачетУпрощеннойВыдачиТовары.Сотрудник КАК Сотрудник,
	|	ЗачетУпрощеннойВыдачиТовары.НормаВыдачи КАК НормаВыдачи,
	|	ЗачетУпрощеннойВыдачиТовары.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ЗачетУпрощеннойВыдачиТовары.ДатаПотребности КАК ДатаПотребности,
	|	ЗачетУпрощеннойВыдачиТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ЗачетУпрощеннойВыдачиТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ЗачетУпрощеннойВыдачиТовары.Номенклатура КАК Номенклатура,
	|	ЗачетУпрощеннойВыдачиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗачетУпрощеннойВыдачиТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ЗачетУпрощеннойВыдачиТовары.Количество КАК Количество,
	|	ЗачетУпрощеннойВыдачиТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ЗачетУпрощеннойВыдачиТовары.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.ЗачетУпрощеннойВыдачи.Товары КАК ЗачетУпрощеннойВыдачиТовары
	|ГДЕ
	|	ЗачетУпрощеннойВыдачиТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество,
	|	ВТ_ТаблицаДокумента.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ВТ_ТаблицаДокумента.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаДокумента.КоличествоПотребность КАК КоличествоПотребность,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВТ_ТаблицаДокумента.НоменклатураНормыПотребности = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ТаблицаДокумента.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаДокумента.НоменклатураНормыПотребности = ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаДокумента.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И НЕ ВТ_ТаблицаДокумента.КоличествоПотребность = 0
	|	И НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация";
	
	Запрос.УстановитьПараметр("Ссылка",		ДокументСсылка);
	Запрос.УстановитьПараметр("Организация",ДокументСсылка.Организация);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаВыдачи 		= Результат[1].Выгрузить();
	ТаблицаПотребности 	= Результат[2].Выгрузить();
	ТаблицаДокумента 	= ДокументСсылка.Товары.Выгрузить();
	
	Для Каждого СтрокаТаблицыВыдачи Из ТаблицаВыдачи Цикл
		
		СтруктураПоиска = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыВыдачи);
		
		НайденныеСтрокиДокумента = ТаблицаДокумента.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтрокиДокумента.Количество() = 0 Тогда //нет потребности для зачета
			Продолжить;
		КонецЕсли;	
		
		ОсталосьЗачесть = СтрокаТаблицыВыдачи.Количество;
		
		Для Каждого НайденнаяСтрокаДокумента Из НайденныеСтрокиДокумента Цикл
			
			СтруктураПоиска = НОВЫЙ Структура;
			СтруктураПоиска.Вставить("Сотрудник",					НайденнаяСтрокаДокумента.Сотрудник);
			СтруктураПоиска.Вставить("НормаВыдачи",					НайденнаяСтрокаДокумента.НормаВыдачи);
			СтруктураПоиска.Вставить("НоменклатураНормыПотребности",НайденнаяСтрокаДокумента.НоменклатураНормыПотребности);
			СтруктураПоиска.Вставить("ДатаПотребности",				НайденнаяСтрокаДокумента.ДатаПотребности);
			
			НайденныеСтрокиПотребности = ТаблицаПотребности.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрокаПотребности Из НайденныеСтрокиПотребности Цикл
				
				Если ОсталосьЗачесть = 0 ИЛИ НайденнаяСтрокаПотребности.КоличествоПотребность = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НайденнаяСтрокаПотребности.ПроцентИзноса) Тогда
					
					Множитель = (100 - НайденнаяСтрокаПотребности.ПроцентИзноса.Код) / 100;
										
				Иначе
					
					Множитель = 1;
					
				КонецЕсли;	
				
				НоваяДатаПотребности = ?(НайденнаяСтрокаПотребности.ПериодичностьВыдачи.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,
										ДобавитьМесяц(СтрокаТаблицыВыдачи.ДатаВыдачи,НайденнаяСтрокаПотребности.ПериодичностьВыдачи.КоличествоПериодов * 12 * Множитель),
										ДобавитьМесяц(СтрокаТаблицыВыдачи.ДатаВыдачи,НайденнаяСтрокаПотребности.ПериодичностьВыдачи.КоличествоПериодов * Множитель));
										
				Если ОсталосьЗачесть <= НайденнаяСтрокаПотребности.КоличествоПотребность Тогда
					
					//списание выдачи
					НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= Справочники.НормыВыдачиСИЗ.ПустаяСсылка();
					НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыВыдачи.НоменклатураНормы;
					НоваяСтрока.Номенклатура 				= СтрокаТаблицыВыдачи.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТаблицыВыдачи.ХарактеристикаНоменклатуры;
					НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыВыдачи.ДатаВыдачи;
					НоваяСтрока.ПроцентИзноса 				= СтрокаТаблицыВыдачи.ПроцентИзноса;
					НоваяСтрока.Количество                  = ОсталосьЗачесть;
					
					//оприходование выдачи
					НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.Номенклатура 				= СтрокаТаблицыВыдачи.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТаблицыВыдачи.ХарактеристикаНоменклатуры;
					НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыВыдачи.ДатаВыдачи;
					НоваяСтрока.ПроцентИзноса 				= СтрокаТаблицыВыдачи.ПроцентИзноса;
					НоваяСтрока.Количество                  = ОсталосьЗачесть;
					
					//списание потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.ДатаПотребности				= НайденнаяСтрокаПотребности.ДатаПотребности;
					НоваяСтрока.Количество                  = ОсталосьЗачесть;
					Если ЗначениеЗаполнено(СтрокаТаблицыВыдачи.ПроцентИзноса) Тогда
						НоваяСтрока.ПроцентИзноса 			= СтрокаТаблицыВыдачи.ПроцентИзноса.Код;
					КонецЕсли;
					
					//оприходование потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
					НоваяСтрока.Количество                  = ОсталосьЗачесть;
					Если ЗначениеЗаполнено(СтрокаТаблицыВыдачи.ПроцентИзноса) Тогда
						НоваяСтрока.ПроцентИзноса 			= СтрокаТаблицыВыдачи.ПроцентИзноса.Код;
					КонецЕсли;
					
					//оприходование выдачи по потребности
					НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
					НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыВыдачи.ДатаВыдачи;
					НоваяСтрока.Количество                  = ОсталосьЗачесть;
					Если ЗначениеЗаполнено(СтрокаТаблицыВыдачи.ПроцентИзноса) Тогда
						НоваяСтрока.ПроцентИзноса 			= СтрокаТаблицыВыдачи.ПроцентИзноса.Код;
					КонецЕсли;
								
					НайденнаяСтрокаПотребности.КоличествоПотребность = НайденнаяСтрокаПотребности.КоличествоПотребность - ОсталосьЗачесть;
					ОсталосьЗачесть = 0;
					
				Иначе
					
					//списание выдачи
					НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= Справочники.НормыВыдачиСИЗ.ПустаяСсылка();
					НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыВыдачи.НоменклатураНормы;
					НоваяСтрока.Номенклатура 				= СтрокаТаблицыВыдачи.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТаблицыВыдачи.ХарактеристикаНоменклатуры;
					НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыВыдачи.ДатаВыдачи;
					НоваяСтрока.ПроцентИзноса 				= СтрокаТаблицыВыдачи.ПроцентИзноса;
					НоваяСтрока.Количество                  = НайденнаяСтрокаПотребности.КоличествоПотребность;
					
					//оприходование выдачи
					НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.Номенклатура 				= СтрокаТаблицыВыдачи.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТаблицыВыдачи.ХарактеристикаНоменклатуры;
					НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыВыдачи.ДатаВыдачи;
					НоваяСтрока.ПроцентИзноса 				= СтрокаТаблицыВыдачи.ПроцентИзноса;
					НоваяСтрока.Количество                  = НайденнаяСтрокаПотребности.КоличествоПотребность;
					
					//списание потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.ДатаПотребности				= НайденнаяСтрокаПотребности.ДатаПотребности;
					НоваяСтрока.Количество                  = НайденнаяСтрокаПотребности.КоличествоПотребность;
					Если ЗначениеЗаполнено(СтрокаТаблицыВыдачи.ПроцентИзноса) Тогда
						НоваяСтрока.ПроцентИзноса 			= СтрокаТаблицыВыдачи.ПроцентИзноса.Код;
					КонецЕсли;
					
					//оприходование потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
					НоваяСтрока.Количество                  = НайденнаяСтрокаПотребности.КоличествоПотребность;
					Если ЗначениеЗаполнено(СтрокаТаблицыВыдачи.ПроцентИзноса) Тогда
						НоваяСтрока.ПроцентИзноса 			= СтрокаТаблицыВыдачи.ПроцентИзноса.Код;
					КонецЕсли;
					
					//оприходование выдачи по потребности
					НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыВыдачи.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрокаПотребности.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрокаПотребности.НоменклатураНормыПотребности;
					НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
					НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыВыдачи.ДатаВыдачи;
					НоваяСтрока.Количество                  = НайденнаяСтрокаПотребности.КоличествоПотребность;
					Если ЗначениеЗаполнено(СтрокаТаблицыВыдачи.ПроцентИзноса) Тогда
						НоваяСтрока.ПроцентИзноса 			= СтрокаТаблицыВыдачи.ПроцентИзноса.Код;
					КонецЕсли;
					
					ОсталосьЗачесть = ОсталосьЗачесть - НайденнаяСтрокаПотребности.КоличествоПотребность;
					НайденнаяСтрокаПотребности.КоличествоПотребность = 0;
					
				КонецЕсли	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	СтруктураТаблицДвижений = Новый Структура("ТаблицаВыданныеСредстваЗащиты, ТаблицаПотребностьВыдачиСИЗ, ТаблицаВыдачаПоПотребности", ТаблицаВыданныеСредстваЗащиты, ТаблицаПотребностьВыдачиСИЗ, ТаблицаВыдачаПоПотребности);
	
КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_26412
Процедура ПроверитьИСкорректироватьКоличествоПотребность(ТаблицаПотребности)
	
	//ТаблицаПотребности = Новый ТаблицаЗначений; //отладка
	
	КопируемыеСтроки = "";
	
	Для Каждого Колонка Из ТаблицаПотребности.Колонки Цикл
		КопируемыеСтроки = КопируемыеСтроки + Колонка.Имя + ",";
	КонецЦикла;
	
	КопируемыеСтроки = Лев(КопируемыеСтроки, СтрДлина(КопируемыеСтроки)-1);
	КопируемыеСтроки = СтрЗаменить(КопируемыеСтроки, "ПроцентИзноса,", "");
	
	ТаблицаДляПроверки = ТаблицаПотребности.Скопировать(,КопируемыеСтроки);
	КолонкиСвертки = СтрЗаменить(КопируемыеСтроки, "КоличествоПотребность,", "");
	ТаблицаДляПроверки.Свернуть(КолонкиСвертки, "КоличествоПотребность");
	
	Для Каждого СтрокаДляПроверки ИЗ ТаблицаДляПроверки Цикл
	
		СтруктураПоиска = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаДляПроверки);
		СтруктураПоиска.Удалить("КоличествоПотребность");
		
		СтрокиПотребности = ТаблицаПотребности.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаПотребности ИЗ СтрокиПотребности Цикл
			
			//АсТБ_Alexey_48970********************************************************************
			//Если НЕ СтрокаПотребности.КоличествоПотребность = СтрокаДляПроверки.КоличествоПотребность Тогда
			Если НЕ СтрокаПотребности.КоличествоПотребность = СтрокаДляПроверки.КоличествоПотребность 
				И НЕ СтрокаДляПроверки.КоличествоПотребность = 0
				И НЕ СтрокаПотребности.КоличествоПотребность = 0 Тогда
			//АсТБ_Alexey_48970********************************************************************	
				
				Коэффициент = СтрокаДляПроверки.КоличествоПотребность / СтрокаПотребности.КоличествоПотребность;
				ПравильноеКоличествоПотребности = СтрокаПотребности.КоличествоПотребность / Коэффициент;
				СтрокаПотребности.КоличествоПотребность = ПравильноеКоличествоПотребности;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_26412


//***НСК Трегубов А.А.*** -- №73822 --  23.06.2021
//
Функция ТаблицыВыданныхПоПотребностиСПривязкойВыданныхСИЗ(ПериодРасчета,МассивСотрудников,Организация,Период) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА ВТ_СоставНормы.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВыдачаПоПотребностиОстатки.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов * 12)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыдачаПоПотребностиОстатки.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов)
	|			КОНЕЦ, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ЕСТЬNULL(ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код, 0) КАК ПроцентИзносаКод,
	|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И ПроцентИзноса <> ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВыданныеСредстваЗащитыОстатки.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА ВТ_СоставНормы.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов * 12)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.ПериодичностьВыдачиКоличествоПериодов)
	|			КОНЕЦ, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса,
	|	ЕСТЬNULL(ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код, 0)";
	
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаВыдачаПоПотребности    = РезультатЗапроса[1].Выгрузить();	
	ТаблицаВыданныеСредстваЗащиты = РезультатЗапроса[2].Выгрузить();
	
	Копия_ТаблицаВыдачаПоПотребности = ТаблицаВыдачаПоПотребности.Скопировать();
	Копия_ТаблицаВыдачаПоПотребности.Очистить();
	
	Для Каждого СтрокаТаблицыВВП из ТаблицаВыдачаПоПотребности Цикл 
		
		СтруктураПоиска = Новый Структура("Сотрудник,НормаВыдачи,НоменклатураНормы,ДатаВыдачи");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТаблицыВВП);
		
		МассивНайденныхСтрок = ТаблицаВыданныеСредстваЗащиты.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() = 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Копия_ТаблицаВыдачаПоПотребности.Добавить(),СтрокаТаблицыВВП);
			
		Иначе
			
			НужноРаспределить = СтрокаТаблицыВВП.Количество;
			
			Для Каждого НайденнаяСтрока из МассивНайденныхСтрок Цикл 
				
				Распределяем = Мин(НужноРаспределить,НайденнаяСтрока.Количество);
				Если Распределяем > 0 Тогда
					
					НоваяСтрокаВПП = Копия_ТаблицаВыдачаПоПотребности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВПП,СтрокаТаблицыВВП);
					НоваяСтрокаВПП.ПроцентИзноса = НайденнаяСтрока.ПроцентИзносаКод;
					НоваяСтрокаВПП.Количество = Распределяем;
					
					НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Распределяем;
					НужноРаспределить = НужноРаспределить - Распределяем;
					
					Если НужноРаспределить <= 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НужноРаспределить > 0 Тогда
				НоваяСтрокаВПП = Копия_ТаблицаВыдачаПоПотребности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВПП,СтрокаТаблицыВВП);	
				НоваяСтрокаВПП.Количество = НужноРаспределить;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаВыдачаПоПотребности = Копия_ТаблицаВыдачаПоПотребности.Скопировать();
	Копия_ТаблицаВыдачаПоПотребности.Очистить();
	
	//второй проход, ищем по номенклатуре нормы
	//если была выдача с разной нормой по одной одной номенклатуре нормы в одну дату, то нужно искать так

	Для Каждого СтрокаТаблицыВВП из ТаблицаВыдачаПоПотребности Цикл 
		
		Если ЗначениеЗаполнено(СтрокаТаблицыВВП.ПроцентИзноса) Тогда 
			ЗаполнитьЗначенияСвойств(Копия_ТаблицаВыдачаПоПотребности.Добавить(),СтрокаТаблицыВВП);
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Сотрудник,НоменклатураНормы,ДатаВыдачи");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТаблицыВВП);
		
		МассивНайденныхСтрок = ТаблицаВыданныеСредстваЗащиты.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() = 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Копия_ТаблицаВыдачаПоПотребности.Добавить(),СтрокаТаблицыВВП);
			
		Иначе
			
			НужноРаспределить = СтрокаТаблицыВВП.Количество;
			
			Для Каждого НайденнаяСтрока из МассивНайденныхСтрок Цикл 
				
				//уже распределено
				Если НайденнаяСтрока.Количество <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Распределяем = Мин(НужноРаспределить,НайденнаяСтрока.Количество);
				Если Распределяем > 0 Тогда
					
					НоваяСтрокаВПП = Копия_ТаблицаВыдачаПоПотребности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВПП,СтрокаТаблицыВВП);
					НоваяСтрокаВПП.ПроцентИзноса = НайденнаяСтрока.ПроцентИзносаКод;
					НоваяСтрокаВПП.Количество = Распределяем;
					
					НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Распределяем;
					НужноРаспределить = НужноРаспределить - Распределяем;
					
					Если НужноРаспределить <= 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НужноРаспределить > 0 Тогда
				НоваяСтрокаВПП = Копия_ТаблицаВыдачаПоПотребности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВПП,СтрокаТаблицыВВП);	
				НоваяСтрокаВПП.Количество = НужноРаспределить;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Копия_ТаблицаВыдачаПоПотребности;
	
КонецФункции // ТаблицыВыданныхПоПотребностиСПривязкойВыданныхСИЗ()
