
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 И ЭтотОбъект.Модифицированность() Тогда //это удаление
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаписиНаСклад.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЗаписиНаСклад КАК ЗаписиНаСклад
		|ГДЕ
		|	ЗаписиНаСклад.Склад = &Склад
		|	И ЗаписиНаСклад.День = &День";
		
		Запрос.УстановитьПараметр("Склад",	ЭтотОбъект.Отбор.Склад.Значение);
		Запрос.УстановитьПараметр("День",	ЭтотОбъект.Отбор.День.Значение);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "На эту дату существуют записи! Удаление невозможно!";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	