////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьВыполнить()

	ЗаполнитьБазуТоваров();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВыполнить()

	ОчиститьСообщения();
	
	ТаблицаЗагрузкиТоваров = Новый Массив;
	Для Каждого Товар ИЗ ТаблицаВыгрузки Цикл
		ТаблицаЗагрузкиТоваров.Добавить(Новый Структура("Код, Штрихкод, Номенклатура, ЕдиницаИзмерения, ХарактеристикаНоменклатуры, СерияНоменклатуры, Качество, Цена, Остаток",
		Товар.SKU, Товар.Штрихкод, Товар.Наименование, Товар.ЕдиницаИзмерения, Товар.Характеристика, Товар.Серия, Товар.Качество, Товар.Цена, 0));
	КонецЦикла;
	МенеджерОборудованияКлиент.ВыгрузитьДанныеВТСД(УникальныйИдентификатор, ТаблицаЗагрузкиТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокТоваров(Команда)
	
	ОчиститьСообщения();
	
	МенеджерОборудованияКлиент.ОчиститьДанныеВТСД(УникальныйИдентификатор);
	           
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьБазуТоваров()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник.Наименование КАК НаименованиеСотрудника,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник.ТабельныйНомер КАК ТабельныйНомерСотрудника,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.КодСинхронизации КАК КодСинхронизацииНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.Артикул КАК АртикулНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры.Наименование КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеСотрудника,
	|	НаименованиеНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры.КодSAP,
	|	ДатаВыдачи";
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТаблицаВыгрузки");

КонецПроцедуры
