
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов",
		"ВедомостьПоВыдачеСИзносом",
		Новый Структура("Организация", ПараметрКоманды),
		Истина,
		Ложь);    		
		
	ОткрытьФорму(
		"Отчет.ВедомостьПоВыдачеСУчетомИзноса.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);    		
				
КонецПроцедуры

