////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ПодразделениеСотрудник", ПараметрКоманды);
	
	ОткрытьФорму(
		"Обработка.СкладыВыдачи.Форма.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.СкладыВыдачи.Форма.Форма" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
