
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЕстьСсылкиВРегистрах() Тогда
			ЭтаФорма.ТолькоПросмотр = ИСТИНА;
			Элементы.ГруппаПредупреждение.Видимость = Истина;
		Иначе
			Элементы.ГруппаПредупреждение.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЕстьСсылкиВРегистрах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриказыНаИнструктажи.Инструктаж КАК Инструктаж
	|ИЗ
	|	РегистрСведений.ПриказыНаИнструктажи КАК ПриказыНаИнструктажи
	|ГДЕ
	|	ПриказыНаИнструктажи.Инструктаж = &Инструктаж
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнструктажиСотрудников.Инструктаж
	|ИЗ
	|	РегистрСведений.ИнструктажиСотрудников КАК ИнструктажиСотрудников
	|ГДЕ
	|	ИнструктажиСотрудников.Инструктаж = &Инструктаж";
	
	Запрос.УстановитьПараметр("Инструктаж",Объект.Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ВидИнструктажа = Перечисления.ВидыИнструктажей.Повторный Тогда
		
		Элементы.ГруппаДляПовторногоИнструктажа.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаДляПовторногоИнструктажа.Видимость = Ложь;
		
	КонецЕсли;
	    	
КонецПроцедуры	

&НаКлиенте
Процедура ПервичныйИнструктажПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйИнструктажНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("Отбор",              Новый Структура("ВидИнструктажа", ПредопределенноеЗначение("Перечисление.ВидыИнструктажей.Первичный")));
	
	ОткрытьФорму("Справочник.Инструктажи.Форма.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Инструктажи.Форма.ФормаВыбора" Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			
			Объект.ПервичныйИнструктаж = ВыбранноеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИнструктажаПриИзменении(Элемент)
	
	ВидИнструктажаПриИзмененииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ВидИнструктажаПриИзмененииНаСервере()
	
	Если НЕ Объект.ВидИнструктажа = Перечисления.ВидыИнструктажей.Повторный Тогда
		Объект.ПервичныйИнструктаж 	= Справочники.Инструктажи.ПустаяСсылка();
		Объект.Периодичность 		= Справочники.ПериодичностьВыдачиСИЗ.ПустаяСсылка();
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов();

КонецПроцедуры
