
&НаСервере
Функция ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды)
		
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") 
		ИЛИ ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ВыдачаДежурныхСредствЗащиты")
		ИЛИ ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.УстановкаШтрихкодовНоменклатуры") Тогда
		Возврат Документы[ПараметрКоманды[0].Метаданные().Имя].ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды);
	Иначе
		Возврат Справочники[ПараметрКоманды[0].Метаданные().Имя].ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	АдресВХранилище = ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды);
		
	СтруктураПараметры 					= Новый Структура("АдресВХранилище");
	СтруктураПараметры.АдресВХранилище  = АдресВХранилище;

	ОткрытьФорму("Обработка.ПечатьЭтикетокДляВыданныхСИЗ.Форма.Форма", СтруктураПараметры,	, Новый УникальныйИдентификатор);
	
КонецПроцедуры
