#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("ОтветственноеЛицо");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Возвращает описание блокируемых реквизитов
// Возвращаемое значение: массив
// Элемент массива: строка в формате
//		ИмяРеквизита[;ИмяЭлементаФормы,...]
// где	ИмяРеквизита - имя реквизита объекта
//		ИмяЭлементаФормы - имя элемента формы, связанного с реквизитом
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("ФизическоеЛицо");
	БлокируемыеРеквизиты.Добавить("ТабельныйНомер");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛичнаяКарточка") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЛичнаяКарточка",
			"Личная карточка",
			СформироватьПечатнуюФормуЛичнойКарточки(МассивОбъектов, ОбъектыПечати),,"Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточка");
				
	КонецЕсли;	
	
	//АСТБ_Овсянников_---------------------------------------------------------------------
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛичнаяКарточкаДСИЗ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЛичнаяКарточкаДСИЗ",
			"Личная карточка ДСИЗ",
			СформироватьПечатнуюФормуЛичнойКарточкиДСИЗ(МассивОбъектов, ОбъектыПечати),,"Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточкаДСИЗ");

	КонецЕсли;
	//АСТБ_Овсянников_---------------------------------------------------------------------	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛичнаяКарточкаДежурные") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЛичнаяКарточкаДежурные",
			"Личная карточка (дежурные)",
			СформироватьПечатнуюФормуДежурнойЛичнойКарточки(МассивОбъектов, ОбъектыПечати),,"Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточкаДежурные");
				
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛичнаяКарточкаПрохожденияОбученияБезопасностиТруда") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЛичнаяКарточкаПрохожденияОбученияБезопасностиТруда",
			"Личная карточка прохождения обучения безопасности труда",
			СформироватьПечатнуюФормуЛичнойКарточкиПрохожденияОбученияБезопасностиТруда(МассивОбъектов, ОбъектыПечати),,"Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточкаПрохожденияОбученияБезопасностиТруда");
				
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечатнуюФормуЛичнойКарточки(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЛичнаяКарточка_ЛичнаяКарточка";
	
	Если МассивОбъектов.Количество() > 0 Тогда
		Организация = МассивОбъектов[0].Владелец;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Неопределено);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивОбъектов,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"),Неопределено);
	//110181, Четаев С.В.{
	//ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	СоставПолей = "Сотрудник,Подразделение,ЭтоЗима,НормаВыдачи,НоменклатураНормы,ТипПериода,КоличествоПериодов,КоличествоВПериоде,Использовать,УсловиеНормы";
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа,СоставПолей);
	//}110181, Четаев С.В.
	
	Запрос = Новый Запрос;
	//АсТБ_Alexey_84651_********************************************************************
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	|				И Организация = &Организация) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Период КАК Период,
	|	ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	ЗанятыеРабочиеМеста.Должность КАК Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ПриемНаРаботу
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|ГДЕ
	|	ЗанятыеРабочиеМеста.Организация = &Организация
	|	И ЗанятыеРабочиеМеста.Сотрудник = &Сотрудник
	|	И ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//+++АсТБ_Alexey_113789_********************************************************************
	|	И ЗанятыеРабочиеМеста.Регистратор ССЫЛКА Документ.ПриемНаРаботу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Период КАК Период,
	|	ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	ЗанятыеРабочиеМеста.Должность КАК Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_КадровоеПеремещение
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|ГДЕ
	|	ЗанятыеРабочиеМеста.Организация = &Организация
	|	И ЗанятыеРабочиеМеста.Сотрудник = &Сотрудник
	|	И ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ЗанятыеРабочиеМеста.Регистратор ССЫЛКА Документ.КадровоеПеремещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(МИНИМУМ(ВТ_ПриемНаРаботу.Период), ДЕНЬ) КАК ДатаПринятия
	|ПОМЕСТИТЬ ВТ_ДатаПриема
	|ИЗ
	|	ВТ_ПриемНаРаботу КАК ВТ_ПриемНаРаботу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПриемНаРаботу.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КадровоеПеремещение.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ВТ_КадровоеПеремещение.Период), ДЕНЬ) КАК ДатаПеревода
	|ПОМЕСТИТЬ ВТ_ДатаПеревода
	|ИЗ
	|	ВТ_КадровоеПеремещение КАК ВТ_КадровоеПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КадровоеПеремещение.Сотрудник
	|;
	|
	//---АсТБ_Alexey_113789_********************************************************************
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияАнтропометрическихСвойств.ВидСвойства КАК ВидСвойства,
	|	ЗначенияАнтропометрическихСвойств.Сотрудник КАК Сотрудник,
	|	ЗначенияАнтропометрическихСвойств.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_Антропометрия
	|ИЗ
	|	РегистрСведений.ЗначенияАнтропометрическихСвойств КАК ЗначенияАнтропометрическихСвойств
	|ГДЕ
	|	ЗначенияАнтропометрическихСвойств.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ФИОФизлица
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо) КАК ФИОФизическихЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерГоловногоУбора
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерГоловногоУбора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерОбуви
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерОбуви)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерОдежды
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерОдежды)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерПерчаток
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерПерчаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерПротивогаза
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерПротивогаза)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерРубашки
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерРубашки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_Рост
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.Рост)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Период КАК Период,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Регистратор КАК Регистратор,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.НормаВыдачи КАК НормаВыдачи,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВыданныеСредстваЗащитыПоВедомостиОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	ВТ_ОсновноеМестоРаботы.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОборотыВыдачиПоВедомости
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащитыПоВедомости.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК ВыданныеСредстваЗащитыПоВедомостиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВыданныеСредстваЗащитыПоВедомостиОбороты.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|ГДЕ
	|	НЕ ВыданныеСредстваЗащитыПоВедомостиОбороты.НоменклатураНормы.ВидСИЗ.Дерматологический
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Номенклатура,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Регистратор,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Период,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.НормаВыдачи,
	|	ВТ_ОсновноеМестоРаботы.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыВыдачиПоВедомости.Период КАК Период,
	|	ВТ_ОборотыВыдачиПоВедомости.Регистратор КАК Регистратор,
	|	ВТ_ОборотыВыдачиПоВедомости.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ОборотыВыдачиПоВедомости.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ОборотыВыдачиПоВедомости.Номенклатура КАК Номенклатура,
	|	ВТ_ОборотыВыдачиПоВедомости.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВТ_ОборотыВыдачиПоВедомости1.Период) КАК ПериодПрошлойВыдачи,
	|	ВТ_ОборотыВыдачиПоВедомости.КоличествоОборот КАК КоличествоОборот
	|ПОМЕСТИТЬ ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости
	|ИЗ
	|	ВТ_ОборотыВыдачиПоВедомости КАК ВТ_ОборотыВыдачиПоВедомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотыВыдачиПоВедомости КАК ВТ_ОборотыВыдачиПоВедомости1
	|		ПО ВТ_ОборотыВыдачиПоВедомости.Период > ВТ_ОборотыВыдачиПоВедомости1.Период
	|			И ВТ_ОборотыВыдачиПоВедомости.НормаВыдачи = ВТ_ОборотыВыдачиПоВедомости1.НормаВыдачи
	|			И ВТ_ОборотыВыдачиПоВедомости.НоменклатураНормы = ВТ_ОборотыВыдачиПоВедомости1.НоменклатураНормы
	|			И ВТ_ОборотыВыдачиПоВедомости.Номенклатура = ВТ_ОборотыВыдачиПоВедомости1.Номенклатура
	|			И ВТ_ОборотыВыдачиПоВедомости.ХарактеристикаНоменклатуры = ВТ_ОборотыВыдачиПоВедомости1.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОборотыВыдачиПоВедомости.Период,
	|	ВТ_ОборотыВыдачиПоВедомости.Регистратор,
	|	ВТ_ОборотыВыдачиПоВедомости.НормаВыдачи,
	|	ВТ_ОборотыВыдачиПоВедомости.НоменклатураНормы,
	|	ВТ_ОборотыВыдачиПоВедомости.Номенклатура,
	|	ВТ_ОборотыВыдачиПоВедомости.ХарактеристикаНоменклатуры,
	|	ВТ_ОборотыВыдачиПоВедомости.КоличествоОборот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыВыдачиПоВедомости.Номенклатура КАК Номенклатура,
	|	ВТ_ОборотыВыдачиПоВедомости.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ОборотыВыдачиПоВедомости.Период КАК ДатаВыдачиРег,
	|	ВТ_ОборотыВыдачиПоВедомости.Период КАК ДатаВыдачи,
	|	ВТ_ОборотыВыдачиПоВедомости.Регистратор КАК ДокументВыдачи,
	|	ВТ_ОборотыВыдачиПоВедомости.КоличествоОборот КАК КоличествоВыданных,
	|	ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.Период КАК ДатаВозврата,
	|	ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.Регистратор КАК ДокументВозврата,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.Регистратор ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОборотыВыдачиПоВедомости.КоличествоОборот
	|	КОНЕЦ КАК КоличествоВозвращенных,
	|	0 КАК ПроцентИзносаВыданных,
	|	0 КАК ПроцентИзносаВозвращенных,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|	ВТ_ОборотыВыдачиПоВедомости.НормаВыдачи КАК НормаВыдачи,
	|	0 КАК ПроцентИзносаВСЗ
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|ПОМЕСТИТЬ ВТ_ВыдачаПоВедомости
	|ИЗ
	|	ВТ_ОборотыВыдачиПоВедомости КАК ВТ_ОборотыВыдачиПоВедомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости КАК ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости
	|		ПО (ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.ПериодПрошлойВыдачи = ВТ_ОборотыВыдачиПоВедомости.Период)
	|			И (ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.НормаВыдачи = ВТ_ОборотыВыдачиПоВедомости.НормаВыдачи)
	|			И (ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.НоменклатураНормы = ВТ_ОборотыВыдачиПоВедомости.НоменклатураНормы)
	|			И (ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.Номенклатура = ВТ_ОборотыВыдачиПоВедомости.Номенклатура)
	|			И (ВТ_ТаблицаПериодовПредпоследнейВыдачиПоВедомости.ХарактеристикаНоменклатуры = ВТ_ОборотыВыдачиПоВедомости.ХарактеристикаНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащиты.Период КАК Период,
	|	ВыданныеСредстваЗащиты.Регистратор КАК Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи КАК ДатаВыдачи,
	|	МАКСИМУМ(ВыданныеСредстваЗащиты.Количество) КАК Количество,
	|	ВыданныеСредстваЗащиты.ВидДвижения КАК ВидДвижения,
	|	ВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|	МАКСИМУМ(ЕСТЬNULL(ВыдачаПоПотребности.ПроцентИзноса, 0)) КАК ПроцентИзноса,
	|	ВыданныеСредстваЗащиты.ПроцентИзноса КАК ПроцентИзносаВСЗ
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|ПОМЕСТИТЬ ВТ_ВыдачаСИЗ
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВыданныеСредстваЗащиты.Период) КАК Период,
	|		ВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
	|		ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВыданныеСредстваЗащиты.ДатаВыдачи КАК ДатаВыдачи,
	|		ВыданныеСредстваЗащиты.Количество КАК Количество,
	|		ВыданныеСредстваЗащиты.ВидДвижения КАК ВидДвижения
	|	ИЗ
	|		РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
	|	ГДЕ
	|		ВыданныеСредстваЗащиты.Организация = &Организация
	|		И ВыданныеСредстваЗащиты.Сотрудник = &Сотрудник
	|		И НЕ ВыданныеСредстваЗащиты.Номенклатура.ВидСИЗ.Дерматологический
	|		И ВЫБОР
	|				КОГДА ВыданныеСредстваЗащиты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|						И ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ НЕ ВыданныеСредстваЗащиты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|			КОНЕЦ
	|		И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ВыдачаДежурныхСредствЗащиты
	|		И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ЗачетВыданныхСредствЗащиты
	|		И ВЫБОР
	|				КОГДА ВыданныеСредстваЗащиты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ НЕ ВыданныеСредстваЗащиты.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|			КОНЕЦ
	|		И ВыданныеСредстваЗащиты.Активность
	|		И НЕ ВыданныеСредстваЗащиты.НеВыводитьВыдачуВ_ЛК
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВыданныеСредстваЗащиты.Номенклатура,
	|		ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
	|		ВыданныеСредстваЗащиты.ДатаВыдачи,
	|		ВыданныеСредстваЗащиты.Количество,
	|		ВыданныеСредстваЗащиты.ВидДвижения) КАК ВЗ_ВыданныеСредстваЗащиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
	|		ПО ВЗ_ВыданныеСредстваЗащиты.Период = ВыданныеСредстваЗащиты.Период
	|			И ВЗ_ВыданныеСредстваЗащиты.Номенклатура = ВыданныеСредстваЗащиты.Номенклатура
	|			И ВЗ_ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры = ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры
	|			И ВЗ_ВыданныеСредстваЗащиты.ДатаВыдачи = ВыданныеСредстваЗащиты.ДатаВыдачи
	|			И ВЗ_ВыданныеСредстваЗащиты.Количество = ВыданныеСредстваЗащиты.Количество
	|			И ВЗ_ВыданныеСредстваЗащиты.ВидДвижения = ВыданныеСредстваЗащиты.ВидДвижения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВыдачаПоПотребности.Регистратор КАК Регистратор,
	|			ВыдачаПоПотребности.Организация КАК Организация,
	|			ВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|			ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|			ВыдачаПоПотребности.ВидДвижения КАК ВидДвижения,
	|			ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|			ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|			ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|			ВыдачаПоПотребности.Активность КАК Активность
	|		ИЗ
	|			РегистрНакопления.ВыдачаПоПотребности КАК ВыдачаПоПотребности
	|		ГДЕ
	|			ВыдачаПоПотребности.Организация = &Организация
	|			И ВыдачаПоПотребности.Сотрудник = &Сотрудник
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВыдачаПоПотребности.Регистратор,
	|			ВыдачаПоПотребности.ДатаВыдачи,
	|			ВыдачаПоПотребности.ВидДвижения,
	|			ВыдачаПоПотребности.НормаВыдачи,
	|			ВыдачаПоПотребности.ПроцентИзноса,
	|			ВыдачаПоПотребности.НоменклатураНормы,
	|			ВыдачаПоПотребности.Активность,
	|			ВыдачаПоПотребности.Сотрудник,
	|			ВыдачаПоПотребности.Организация) КАК ВыдачаПоПотребности
	|		ПО (ВыданныеСредстваЗащиты.Регистратор = ВыдачаПоПотребности.Регистратор)
	|			И (ВыданныеСредстваЗащиты.ВидДвижения = ВыдачаПоПотребности.ВидДвижения)
	|			И (ВыданныеСредстваЗащиты.НоменклатураНормы = ВыдачаПоПотребности.НоменклатураНормы)
	|			И (ВыданныеСредстваЗащиты.ДатаВыдачи = ВыдачаПоПотребности.ДатаВыдачи)
	|			И (ВыданныеСредстваЗащиты.Организация = ВыдачаПоПотребности.Организация)
	|			И (ВыданныеСредстваЗащиты.Сотрудник = ВыдачаПоПотребности.Сотрудник)
	|ГДЕ
	|	ВыданныеСредстваЗащиты.Организация = &Организация
	|	И ВыданныеСредстваЗащиты.Сотрудник = &Сотрудник
	|	И НЕ ВыданныеСредстваЗащиты.Номенклатура.ВидСИЗ.Дерматологический
	|	И ВЫБОР
	|			КОГДА ВыданныеСредстваЗащиты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|					И ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ВыданныеСредстваЗащиты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|		КОНЕЦ
	|	И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ВыдачаДежурныхСредствЗащиты
	|	И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ЗачетВыданныхСредствЗащиты
	|	И ВЫБОР
	|			КОГДА ВыданныеСредстваЗащиты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ВыданныеСредстваЗащиты.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|		КОНЕЦ
	|	И ВыданныеСредстваЗащиты.Активность
	|	И НЕ ВыданныеСредстваЗащиты.НеВыводитьВыдачуВ_ЛК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащиты.Период,
	|	ВыданныеСредстваЗащиты.Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи,
	|	ВыданныеСредстваЗащиты.ВидДвижения,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|	ВыданныеСредстваЗащиты.НормаВыдачи,
	|	ВыданныеСредстваЗащиты.ПроцентИзноса
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка КАК Ссылка,
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Номенклатура КАК Номенклатура,
	|	ВозвратСредствЗащитыОтСотрудникаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВозвратСредствЗащитыОтСотрудникаТовары.ПроцентИзноса КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ДокументыВозврата
	|ИЗ
	|	Документ.ВозвратСредствЗащитыОтСотрудника.Товары КАК ВозвратСредствЗащитыОтСотрудникаТовары
	|ГДЕ
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка.Организация = &Организация
	|	И ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка.Сотрудник = &Сотрудник
	|	И ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСИЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСИЗ.ДатаВыдачи КАК ДатаВыдачиРег,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСИЗ.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВТ_ВыдачаСИЗ.ДатаВыдачи
	|		ИНАЧЕ ВТ_ВыдачаСИЗ.Период
	|	КОНЕЦ КАК ДатаВыдачи,
	|	ВТ_ВыдачаСИЗ.Регистратор КАК ДокументВыдачи,
	|	ВТ_ВыдачаСИЗ.Количество КАК КоличествоВыданных,
	|	NULL КАК ДатаВозврата,
	|	NULL КАК ДокументВозврата,
	|	NULL КАК КоличествоВозвращенных,
	|	ВТ_ВыдачаСИЗ.ПроцентИзноса КАК ПроцентИзносаВыданных,
	|	NULL КАК ПроцентИзносаВозвращенных,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|	ВТ_ВыдачаСИЗ.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаСИЗ.ПроцентИзносаВСЗ КАК ПроцентИзносаВСЗ
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|ПОМЕСТИТЬ ВТ_ВыдачаВозврат
	|ИЗ
	|	ВТ_ВыдачаСИЗ КАК ВТ_ВыдачаСИЗ
	|ГДЕ
	|	ВТ_ВыдачаСИЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСИЗ.Номенклатура,
	|	ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСИЗ.ДатаВыдачи,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ВыдачаСИЗ.Период,
	|	ЕСТЬNULL(ВТ_ДокументыВозврата.Ссылка, ВТ_ВыдачаСИЗ.Регистратор),
	|	ВТ_ВыдачаСИЗ.Количество,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСИЗ.Регистратор.Организация.ИспользоватьПроцентИзноса
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ДокументыВозврата.ПроцентИзноса ЕСТЬ NULL
	|						ТОГДА 100
	|					ИНАЧЕ ВТ_ДокументыВозврата.ПроцентИзноса.Код
	|				КОНЕЦ
	|		ИНАЧЕ 100
	|	КОНЕЦ,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|	ВТ_ВыдачаСИЗ.НормаВыдачи,
	|	NULL
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|ИЗ
	|	ВТ_ВыдачаСИЗ КАК ВТ_ВыдачаСИЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыВозврата КАК ВТ_ДокументыВозврата
	|		ПО ВТ_ВыдачаСИЗ.Регистратор = ВТ_ДокументыВозврата.ДокументОснование
	|			И ВТ_ВыдачаСИЗ.Номенклатура = ВТ_ДокументыВозврата.Номенклатура
	|			И ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры = ВТ_ДокументыВозврата.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ВТ_ВыдачаСИЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоВедомости.Номенклатура,
	|	ВТ_ВыдачаПоВедомости.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаПоВедомости.ДатаВыдачиРег,
	|	ВТ_ВыдачаПоВедомости.ДатаВыдачи,
	|	ВТ_ВыдачаПоВедомости.ДокументВыдачи,
	|	ВТ_ВыдачаПоВедомости.КоличествоВыданных,
	|	ВТ_ВыдачаПоВедомости.ДатаВозврата,
	|	ВТ_ВыдачаПоВедомости.ДокументВозврата,
	|	ВТ_ВыдачаПоВедомости.КоличествоВозвращенных,
	|	ВТ_ВыдачаПоВедомости.ПроцентИзносаВыданных,
	|	ВТ_ВыдачаПоВедомости.ПроцентИзносаВозвращенных,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|	ВТ_ВыдачаПоВедомости.НормаВыдачи,
	|	ВТ_ВыдачаПоВедомости.ПроцентИзносаВСЗ
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|ИЗ
	|	ВТ_ВыдачаПоВедомости КАК ВТ_ВыдачаПоВедомости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНорм.Сотрудник КАК Сотрудник,
	|	ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	//110181, Четаев С.В.{
	|	ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ТаблицаНорм.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_НормыСотрудников
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм
	|ГДЕ
	|	ТаблицаНорм.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	НормыВыдачиСИЗСоставНормы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормыВыдачиСИЗСоставНормы.УчитыватьВПотребности КАК УчитыватьВПотребности,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьДляЛичнойКарточки КАК ПериодичностьДляЛичнойКарточки,
	|	ВЫБОР
	|		КОГДА НормыВыдачиСИЗСоставНормы.Ссылка.ОснованиеНормы ССЫЛКА Справочник.ПунктыТОН
	|			ТОГДА НормыВыдачиСИЗСоставНормы.Ссылка.ОснованиеНормы.Владелец.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТОН
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСотрудников.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	//110181, Четаев С.В.{
	|	ВТ_НормыСотрудников.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ВТ_ОсновноеМестоРаботы.Должность КАК Должность,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВТ_ОсновноеМестоРаботы.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_НормаСотрудникаИОсновнаяДолжность
	|ИЗ
	|	ВТ_НормыСотрудников КАК ВТ_НормыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_НормыСотрудников.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Организация = &Организация
	|	И УточненныеОснованияНормВыдачи.НормаВыдачи В(&МассивНормВыдачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоставНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	//110181, Четаев С.В.{
	|	ВТ_НормаСотрудникаИОсновнаяДолжность.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ВЫБОР
	|		КОГДА ВТ_СоставНормы.ПериодичностьДляЛичнойКарточки = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Период)
	|						ТОГДА ВТ_СоставНормы.ПериодичностьВыдачи
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.ДоИзноса)
	|								ТОГДА ""До износа""
	|							ИНАЧЕ ВТ_СоставНормы.НормаВыдачи.ВидРасчета
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СоставНормы.ПериодичностьДляЛичнойКарточки
	|	КОНЕЦ КАК ПериодичностьВыдачи,
	|	ВТ_СоставНормы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|															ТОГДА ВЫБОР
	|																	КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																		ТОГДА ВЫБОР
	|																				КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|																					ТОГДА ВЫБОР
	|																							КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																								ТОГДА ВТ_СоставНормы.НормаВыдачи.ОснованиеНормы
	|																							ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|																						КОНЕЦ
	|																				ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание
	|																			КОНЕЦ
	|																	ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание
	|																КОНЕЦ
	|														ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание
	|													КОНЕЦ
	|											ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание
	|	КОНЕЦ КАК ПорядковыйНомерТОН
	|ПОМЕСТИТЬ ВТ_ЛицеваяСторона_Строки
	|ИЗ
	|	ВТ_НормаСотрудникаИОсновнаяДолжность КАК ВТ_НормаСотрудникаИосновнаяДолжность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	|ГДЕ
	|	НЕ ВТ_СоставНормы.НоменклатураНормы.ВидСИЗ.Дерматологический
	|	И НЕ ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник КАК Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение КАК Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность КАК Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаЗанятыхРабочихМест
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ФизическоеЛицо.Пол КАК Пол
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.Подразделение.Наименование, """") КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Должность.Наименование ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Должность.Наименование + "" (основная)""
	|	КОНЕЦ КАК Должность1,
	|	ВТ_Сотрудники.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ВЫБОР
	|		КОГДА ВТ_Сотрудники.Сотрудник.ДатаПриемаДляЛичнойКарточки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//+++АсТБ_Alexey_113789_********************************************************************
	|			ТОГДА ВТ_ДатаПриема.ДатаПринятия
	//---АсТБ_Alexey_113789_********************************************************************
	|		ИНАЧЕ ВТ_Сотрудники.Сотрудник.ДатаПриемаДляЛичнойКарточки
	|	КОНЕЦ КАК ДатаПринятия,
	|	ВТ_Сотрудники.Пол КАК Пол,
	|	ВТ_ФИОФизлица.Фамилия КАК Фамилия,
	|	ВТ_ФИОФизлица.Имя КАК Имя,
	|	ВТ_ФИОФизлица.Отчество КАК Отчество,
	|	ВТ_РазмерГоловногоУбора.ЗначениеСвойства КАК РазмерГоловногоУбора,
	|	ВТ_РазмерОбуви.ЗначениеСвойства КАК РазмерОбуви,
	|	ВТ_РазмерОдежды.ЗначениеСвойства КАК РазмерОдежды,
	|	ВТ_РазмерПерчаток.ЗначениеСвойства КАК РазмерПерчаток,
	|	ВТ_РазмерПротивогаза.ЗначениеСвойства КАК РазмерПротивогаза,
	|	ВТ_РазмерРубашки.ЗначениеСвойства КАК РазмерРубашки,
	|	ВТ_Рост.ЗначениеСвойства КАК Рост,
	|	"""" КАК РазмерРеспиратора,
	|	"""" КАК РазмерРукавиц,
	//+++АсТБ_Alexey_113789_********************************************************************
	|	ЕСТЬNULL(ВТ_ДатаПеревода.ДатаПеревода, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПеревода,
	//---АсТБ_Alexey_113789_********************************************************************
	|	"""" КАК Основание,
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель.Наименование, """") КАК Руководитель
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	//+++АсТБ_Alexey_113789_********************************************************************
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПриема КАК ВТ_ДатаПриема
	|			ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_ДатаПриема.Сотрудник
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПеревода КАК ВТ_ДатаПеревода
	|			ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_ДатаПеревода.Сотрудник
	//---АсТБ_Alexey_113789_********************************************************************
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИОФизлица КАК ВТ_ФИОФизлица
	|		ПО ВТ_Сотрудники.ФизическоеЛицо = ВТ_ФИОФизлица.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерГоловногоУбора КАК ВТ_РазмерГоловногоУбора
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерГоловногоУбора.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерОбуви КАК ВТ_РазмерОбуви
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерОбуви.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерОдежды КАК ВТ_РазмерОдежды
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерОдежды.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерПерчаток КАК ВТ_РазмерПерчаток
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерПерчаток.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерПротивогаза КАК ВТ_РазмерПротивогаза
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерПротивогаза.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерРубашки КАК ВТ_РазмерРубашки
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерРубашки.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рост КАК ВТ_Рост
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_Рост.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЛицеваяСторона_Строки.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ЛицеваяСторона_Строки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ЛицеваяСторона_Строки.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ЛицеваяСторона_Строки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//110181, Четаев С.В.{
	|	ВТ_ЛицеваяСторона_Строки.УсловиеНормы КАК УсловиеНормы,
	|	СпрУсловияНорм.ГруппаУсловия КАК ГруппаУсловия,
	//}110181, Четаев С.В.
	|	ВТ_ЛицеваяСторона_Строки.ПорядковыйНомерТОН КАК ПорядковыйНомерТОН
	|ИЗ
	|	ВТ_ЛицеваяСторона_Строки КАК ВТ_ЛицеваяСторона_Строки
	//110181, Четаев С.В.{
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияНорм КАК СпрУсловияНорм
	|		ПО ВТ_ЛицеваяСторона_Строки.УсловиеНормы = СпрУсловияНорм.Ссылка
	//}110181, Четаев С.В.
	|
	|УПОРЯДОЧИТЬ ПО
	//110181, Четаев С.В.{
	|	СпрУсловияНорм.ГруппаУсловия,
	//}110181, Четаев С.В.
	|	ВТ_ЛицеваяСторона_Строки.НоменклатураНормы.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаВозврат.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаВозврат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаВозврат.ДатаВыдачиРег КАК ДатаВыдачиРег,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДатаВыдачи) КАК ДатаВыдачи,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДокументВыдачи) КАК ДокументВыдачи,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.КоличествоВыданных) КАК КоличествоВыданных,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДатаВозврата) КАК ДатаВозврата,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДокументВозврата) КАК ДокументВозврата,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.КоличествоВозвращенных) КАК КоличествоВозвращенных,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ПроцентИзносаВыданных) КАК ПроцентИзносаВыданных,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ПроцентИзносаВозвращенных) КАК ПроцентИзносаВозвращенных,
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)>>>
	|	ВТ_ВыдачаВозврат.НормаВыдачи КАК НормаВыдачи,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ПроцентИзносаВСЗ) КАК ПроцентИзносаВСЗ
	// Мадатов Ю.А. --#120550  "Процент износа в ЛК"-- (22.09.21)<<<
	|ИЗ
	|	ВТ_ВыдачаВозврат КАК ВТ_ВыдачаВозврат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаВозврат.Номенклатура,
	|	ВТ_ВыдачаВозврат.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаВозврат.ДатаВыдачиРег,
	|	ВТ_ВыдачаВозврат.НормаВыдачи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|															ТОГДА ВЫБОР
	|																	КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																		ТОГДА ВЫБОР
	|																				КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|																					ТОГДА ВЫБОР
	|																							КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																								ТОГДА ВТ_СоставНормы.ТОН
	|																							ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|																						КОНЕЦ
	|																				ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание.Владелец.Наименование
	|																			КОНЕЦ
	|																	ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|																КОНЕЦ
	|														ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание.Владелец.Наименование
	|													КОНЕЦ
	|											ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание.Владелец.Наименование
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание.Владелец.Наименование
	|	КОНЕЦ КАК ТОН
	|ИЗ
	|	ВТ_НормаСотрудникаИОсновнаяДолжность КАК ВТ_НормаСотрудникаИОсновнаяДолжность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	|ГДЕ
	|	НЕ ВТ_СоставНормы.НоменклатураНормы.ВидСИЗ.Дерматологический
	|	И НЕ ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТОН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаЗанятыхРабочихМест.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаЗанятыхРабочихМест.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаЗанятыхРабочихМест.Должность КАК Должность,
	|	ВТ_ТаблицаЗанятыхРабочихМест.РабочееМесто КАК РабочееМесто
	|ИЗ
	|	ВТ_ТаблицаЗанятыхРабочихМест КАК ВТ_ТаблицаЗанятыхРабочихМест
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_ТаблицаЗанятыхРабочихМест.Подразделение = ВТ_ОсновноеМестоРаботы.Подразделение
	|			И ВТ_ТаблицаЗанятыхРабочихМест.Должность = ВТ_ОсновноеМестоРаботы.Должность
	|			И ВТ_ТаблицаЗанятыхРабочихМест.РабочееМесто = ВТ_ОсновноеМестоРаботы.РабочееМесто
	|ГДЕ
	|	ВТ_ТаблицаЗанятыхРабочихМест.Сотрудник = &Сотрудник
	|	И ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL";
	//АсТБ_Alexey_84651_********************************************************************
	
	ПервыйДокумент = Истина;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("Сотрудник", 					ЭлементМассива);
		Запрос.УстановитьПараметр("ТаблицаНорм", 				ТаблицаСНормами);
		Запрос.УстановитьПараметр("ФизическоеЛицо", 			ЭлементМассива.ФизическоеЛицо);
		Запрос.УстановитьПараметр("Период", 					ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", 				ЭлементМассива.Владелец);
		Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
		//АсТБ_Alexey_84651_********************************************************************
		Запрос.УстановитьПараметр("МассивНормВыдачи", 			ТаблицаСНормами.ВыгрузитьКолонку("НормаВыдачи"));
		//АсТБ_Alexey_84651_********************************************************************
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточка");
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		//+++АсТБ_Alexey_113789_********************************************************************
		//АсТБ_Alexey_84651_********************************************************************
		//ЛицеваяСторона_Шапка 	= ПакетЗапросов[33].Выгрузить();
		//ЛицеваяСторона_Строки 	= ПакетЗапросов[34].Выгрузить();
		//ОборотнаяСторона_Строки = ПакетЗапросов[35].Выгрузить();
		//ТаблицаТОН 				= ПакетЗапросов[36].Выгрузить();
		//НеОсновныеМестаРаботы   = ПакетЗапросов[37].Выгрузить();
		ЛицеваяСторона_Шапка 	= ПакетЗапросов[35].Выгрузить();
		ЛицеваяСторона_Строки 	= ПакетЗапросов[36].Выгрузить();
		ОборотнаяСторона_Строки = ПакетЗапросов[37].Выгрузить();
		// Мадатов Ю.А. --#120550 "Процент износа в ЛК"-- (17.09.21)<<<
		Если Организация.ИспользоватьАлгоритм_0_0_0_4 Тогда 
			ОборотнаяСторона_Строки.Колонки.Удалить("ПроцентИзносаВыданных");
			ОборотнаяСторона_Строки.Колонки.ПроцентИзносаВСЗ.Имя = "ПроцентИзносаВыданных";
		КонецЕсли;
		// Мадатов Ю.А. --#120550 "Процент износа в ЛК"-- (17.09.21)>>>
		ТаблицаТОН 				= ПакетЗапросов[38].Выгрузить();
		НеОсновныеМестаРаботы   = ПакетЗапросов[39].Выгрузить();
		//АсТБ_Alexey_84651_********************************************************************
		//---АсТБ_Alexey_113789_********************************************************************
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Шапка");
		Если ЛицеваяСторона_Шапка.Количество() > 0 Тогда
			Область.Параметры.Заполнить(ЛицеваяСторона_Шапка[0]);
			Основание = "";
			Для Каждого СтрокаТаблицыТОН Из ТаблицаТОН Цикл
				Если ЗначениеЗаполнено(Основание) Тогда
					Основание = Основание + ", " + СокрЛП(СтрокаТаблицыТОН.ТОН);
				Иначе
					Основание = СокрЛП(СтрокаТаблицыТОН.ТОН);
				КонецЕсли;
			КонецЦикла;
			Область.Параметры.Основание 	= Основание;
			Область.Параметры.ДатаПринятия 	= Формат(ЛицеваяСторона_Шапка[0].ДатаПринятия, "ДЛФ=Д");
			Область.Параметры.ДатаПеревода 	= ?(ЗначениеЗаполнено(ЛицеваяСторона_Шапка[0].ДатаПеревода),Формат(ЛицеваяСторона_Шапка[0].ДатаПеревода, "ДЛФ=Д"),"");
			Сч = 2;
			Для Каждого НеОсновноеМестоРаботы Из НеОсновныеМестаРаботы Цикл
				Если Сч = 2 Тогда
					Область.Параметры.Должность2 = Строка(НеОсновноеМестоРаботы.Должность);
				ИначеЕсли Сч = 3 Тогда
					Область.Параметры.Должность3 = Строка(НеОсновноеМестоРаботы.Должность);	
				Иначе //больше 3-х мест работы не влезет на форму
					Прервать;
				КонецЕсли;
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
		
		ТекущаяНормаВыдачи = "";
		
		//110181, Четаев С.В.{
		ТекущаяГруппаУсловий = Неопределено;
		ОбъединитьНомеклатуруНормы = Ложь;
		//}110181, Четаев С.В.
		
		Для Каждого СтрокаЛицевойСтороны Из ЛицеваяСторона_Строки Цикл
			
			//110181, Четаев С.В.{
			НаименованиеОбъединеннойНомеклатурыНормы = "";
			
			Если ЗначениеЗаполнено(СтрокаЛицевойСтороны.ГруппаУсловия) И СтрокаЛицевойСтороны.ГруппаУсловия = ТекущаяГруппаУсловий Тогда
				//Область = Макет.ПолучитьОбласть("ЛицеваяСторона_ИЛИ");
				//ТабличныйДокумент.Вывести(Область);
				
				// Наименование взаимозаменяемых номенклатур нормы требуется прописать в одной ячейке
				ОбъединитьНомеклатуруНормы = Истина;
				
				НаименованиеОбъединеннойНомеклатурыНормы = ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы,
															2, 
															ТабличныйДокумент.ВысотаТаблицы, 
															29).Текст;
				НаименованиеОбъединеннойНомеклатурыНормы = НаименованиеОбъединеннойНомеклатурыНормы + Символы.ПС + 
												"ИЛИ" + Символы.ПС + 
												СтрокаЛицевойСтороны.НоменклатураНормы.Наименование;
												
				// Будем удалять предыдущую строку и формировать новую с объединенным наименованием номенклатуры нормы.
				// Заполнение остальных ячеек оставляем как есть. По словам аналитика значения (ед. измерения, количество и пр.) для всех объединеных строк будут одинаковые.
				УдаляемаяОбласть = ТабличныйДокумент.Область("R"+Строка(ТабличныйДокумент.ВысотаТаблицы));
				ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
				
				// Другой вариант - объединение ячеек (Область.Объединить()).
				// Воспользуемся вариантом через удаление строк.
												
			КонецЕсли;
			ТекущаяГруппаУсловий = СтрокаЛицевойСтороны.ГруппаУсловия;
			//}110181, Четаев С.В.
			
			Если СтрокаЛицевойСтороны.НормаВыдачи = ТекущаяНормаВыдачи Тогда
			    Область = Макет.ПолучитьОбласть("ЛицеваяСторона_ИЛИ");
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			ТекущаяНормаВыдачи = СтрокаЛицевойСтороны.НормаВыдачи;
			
			Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Строка");
			Область.Параметры.Заполнить(СтрокаЛицевойСтороны);
			
			//110181, Четаев С.В.{
			Если ОбъединитьНомеклатуруНормы Тогда
				Область.Параметры.НоменклатураНормы = НаименованиеОбъединеннойНомеклатурыНормы;
				ОбъединитьНомеклатуруНормы = Ложь;
			КонецЕсли;
			//}110181, Четаев С.В.
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Подвал");
		Область.Параметры.Руководитель = ?(ЗначениеЗаполнено(ЛицеваяСторона_Шапка[0].Руководитель),ФизическиеЛица.ФамилияИнициалыФизЛица(ЛицеваяСторона_Шапка[0].Руководитель),"");
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Область = Макет.ПолучитьОбласть("ОборотнаяСторона_Шапка");
		ТабличныйДокумент.Вывести(Область);
		
		Для Каждого СтрокаОборотнойСтороны Из ОборотнаяСторона_Строки Цикл
			
			//+++АСТБ_Горюшин_Алексей_19561
			Если СтрокаОборотнойСтороны.ДатаВыдачи = NULL Тогда
				Продолжить;
			КонецЕсли;
			//---АСТБ_Горюшин_Алексей_19561
			
			Область = Макет.ПолучитьОбласть("ОборотнаяСторона_Строка");
			Область.Параметры.Заполнить(СтрокаОборотнойСтороны);
			Область.Параметры.НоменклатураВыдачи 		= ?(ЗначениеЗаполнено(СтрокаОборотнойСтороны.ХарактеристикаНоменклатуры),СтрокаОборотнойСтороны.Номенклатура.Наименование + " (" + СтрокаОборотнойСтороны.ХарактеристикаНоменклатуры.Наименование + ")",СтрокаОборотнойСтороны.Номенклатура.Наименование);
			Область.Параметры.СертификатСоответствия 	= ПроцедурыРаботыСНормамиСервер.ПолучитьНомерСертификатаНоменклатуры(СтрокаОборотнойСтороны.Номенклатура,СтрокаОборотнойСтороны.ДатаВыдачиРег);
			
			Если Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда
				Если ТипЗнч(СтрокаОборотнойСтороны.ДокументВыдачи) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
					Если ЗначениеЗаполнено(СтрокаОборотнойСтороны.ДокументВыдачи.ДокументОснование) Тогда
						Область.Параметры.ДокументВыдачи = Строка(СтрокаОборотнойСтороны.ДокументВыдачи) + " по ведомости №" + СтрокаОборотнойСтороны.ДокументВыдачи.ДокументОснование.Номер + " от " + Формат(СтрокаОборотнойСтороны.ДокументВыдачи.ДокументОснование.Дата,"ДФ=dd.MM.yyyy");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ЭлементМассива);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуДежурнойЛичнойКарточки(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЛичнаяКарточкаДежурные_ЛичнаяКарточкаДежурные";
	
	Если МассивОбъектов.Количество() > 0 Тогда
		Организация = МассивОбъектов[0].Владелец;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Неопределено);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивОбъектов,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"),Неопределено);
	
	//ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	//110181, Четаев С.В.{
	СоставПолей = "Сотрудник,Подразделение,ЭтоЗима,НормаВыдачи,НоменклатураНормы,ТипПериода,КоличествоПериодов,КоличествоВПериоде,Использовать,УсловиеНормы";	
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа,СоставПолей);
	//}110181, Четаев С.В.
	
	Запрос = Новый Запрос;
	//АсТБ_Alexey_84651_********************************************************************
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	|				И Организация = &Организация) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Организация = &Организация
	|	И УточненныеОснованияНормВыдачи.НормаВыдачи В(&МассивНормВыдачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Период КАК Период,
	|	ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	ЗанятыеРабочиеМеста.Должность КАК Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ПриемНаРаботу
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|ГДЕ
	|	ЗанятыеРабочиеМеста.Организация = &Организация
	|	И ЗанятыеРабочиеМеста.Сотрудник = &Сотрудник
	|	И ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//+++АсТБ_Alexey_113789_********************************************************************
	|	И ЗанятыеРабочиеМеста.Регистратор ССЫЛКА Документ.ПриемНаРаботу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Период КАК Период,
	|	ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	ЗанятыеРабочиеМеста.Должность КАК Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_КадровоеПеремещение
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|ГДЕ
	|	ЗанятыеРабочиеМеста.Организация = &Организация
	|	И ЗанятыеРабочиеМеста.Сотрудник = &Сотрудник
	|	И ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ЗанятыеРабочиеМеста.Регистратор ССЫЛКА Документ.КадровоеПеремещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(МИНИМУМ(ВТ_ПриемНаРаботу.Период), ДЕНЬ) КАК ДатаПринятия
	|ПОМЕСТИТЬ ВТ_ДатаПриема
	|ИЗ
	|	ВТ_ПриемНаРаботу КАК ВТ_ПриемНаРаботу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПриемНаРаботу.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КадровоеПеремещение.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ВТ_КадровоеПеремещение.Период), ДЕНЬ) КАК ДатаПеревода
	|ПОМЕСТИТЬ ВТ_ДатаПеревода
	|ИЗ
	|	ВТ_КадровоеПеремещение КАК ВТ_КадровоеПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КадровоеПеремещение.Сотрудник
	|;
	|
	//---АсТБ_Alexey_113789_********************************************************************
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияАнтропометрическихСвойств.ВидСвойства КАК ВидСвойства,
	|	ЗначенияАнтропометрическихСвойств.Сотрудник КАК Сотрудник,
	|	ЗначенияАнтропометрическихСвойств.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_Антропометрия
	|ИЗ
	|	РегистрСведений.ЗначенияАнтропометрическихСвойств КАК ЗначенияАнтропометрическихСвойств
	|ГДЕ
	|	ЗначенияАнтропометрическихСвойств.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ФИОФизлица
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо) КАК ФИОФизическихЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерГоловногоУбора
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерГоловногоУбора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерОбуви
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерОбуви)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерОдежды
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерОдежды)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерПерчаток
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерПерчаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерПротивогаза
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерПротивогаза)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РазмерРубашки
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РазмерРубашки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Антропометрия.Сотрудник КАК Сотрудник,
	|	ВТ_Антропометрия.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_Рост
	|ИЗ
	|	ВТ_Антропометрия КАК ВТ_Антропометрия
	|ГДЕ
	|	ВТ_Антропометрия.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.Рост)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащиты.Период КАК Период,
	|	ВыданныеСредстваЗащиты.Регистратор КАК Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащиты.Количество) КАК Количество,
	|	ВыданныеСредстваЗащиты.ВидДвижения КАК ВидДвижения,
	|	ВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
	|ГДЕ
	|	ВыданныеСредстваЗащиты.Организация = &Организация
	|	И ВыданныеСредстваЗащиты.Сотрудник = &Сотрудник
	|	И НЕ ВыданныеСредстваЗащиты.Номенклатура.ВидСИЗ.Дерматологический
	|	И ВЫБОР
	|			КОГДА ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику
	|				ТОГДА НЕ(ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача)
	|							ИЛИ ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.УпрощеннаяВыдача))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ВыдачаДежурныхСредствЗащиты
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыданныеСредстваЗащиты.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|		КОНЕЦ
	|	И ВыданныеСредстваЗащиты.Активность
	|	И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ЗачетВыданныхСредствЗащиты
	|	И НЕ ВыданныеСредстваЗащиты.НеВыводитьВыдачуВ_ЛК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащиты.Период,
	|	ВыданныеСредстваЗащиты.Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи,
	|	ВыданныеСредстваЗащиты.ВидДвижения,
	|	ВыданныеСредстваЗащиты.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащиты.Период КАК Период,
	|	ВыданныеСредстваЗащиты.Регистратор КАК Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащиты.Количество) КАК Количество,
	|	ВыданныеСредстваЗащиты.ВидДвижения КАК ВидДвижения,
	|	ВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи
	|ПОМЕСТИТЬ ВТ_СписаниеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
	|ГДЕ
	|	ВыданныеСредстваЗащиты.Организация = &Организация
	|	И ВыданныеСредстваЗащиты.Сотрудник = &Сотрудник
	|	И НЕ ВыданныеСредстваЗащиты.Номенклатура.ВидСИЗ.Дерматологический
	|	И ВЫБОР
	|			КОГДА ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику
	|				ТОГДА НЕ(ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача)
	|							ИЛИ ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.УпрощеннаяВыдача))
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.СписаниеСредствЗащитыСотрудника
	|	И ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача)
	|	И ВыданныеСредстваЗащиты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|	И ВыданныеСредстваЗащиты.Активность
	|	И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ЗачетВыданныхСредствЗащиты
	|	И НЕ ВыданныеСредстваЗащиты.НеВыводитьВыдачуВ_ЛК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащиты.Период,
	|	ВыданныеСредстваЗащиты.Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи,
	|	ВыданныеСредстваЗащиты.ВидДвижения,
	|	ВыданныеСредстваЗащиты.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСИЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСИЗ.ДатаВыдачи КАК ДатаВыдачиРег,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСИЗ.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВТ_ВыдачаСИЗ.ДатаВыдачи
	|		ИНАЧЕ ВТ_ВыдачаСИЗ.Период
	|	КОНЕЦ КАК ДатаВыдачи,
	|	ВТ_ВыдачаСИЗ.Регистратор КАК ДокументВыдачи,
	|	ВТ_ВыдачаСИЗ.Количество КАК КоличествоВыданных,
	|	NULL КАК ДатаВозврата,
	|	NULL КАК ДокументВозврата,
	|	0 КАК КоличествоВозвращенных,
	|	0 КАК ПроцентИзносаВыданных,
	|	0 КАК ПроцентИзносаВозвращенных,
	|	ВТ_ВыдачаСИЗ.НормаВыдачи КАК НормаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаВозврат_ДляДополненияСписаниями
	|ИЗ
	|	ВТ_ВыдачаСИЗ КАК ВТ_ВыдачаСИЗ
	|ГДЕ
	|	ВТ_ВыдачаСИЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСИЗ.Номенклатура,
	|	ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСИЗ.ДатаВыдачи,
	|	NULL,
	|	NULL,
	|	0,
	|	ВТ_ВыдачаСИЗ.Период,
	|	ВТ_ВыдачаСИЗ.Регистратор,
	|	ВТ_ВыдачаСИЗ.Количество,
	|	0,
	|	0,
	|	ВТ_ВыдачаСИЗ.НормаВыдачи
	|ИЗ
	|	ВТ_ВыдачаСИЗ КАК ВТ_ВыдачаСИЗ
	|ГДЕ
	|	ВТ_ВыдачаСИЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ДатаВыдачиРег КАК ДатаВыдачиРег,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ДокументВыдачи КАК ДокументВыдачи,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.КоличествоВыданных КАК КоличествоВыданных,
	|	ЕСТЬNULL(ВТ_СписаниеСИЗ.Период, ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ДатаВозврата) КАК ДатаВозврата,
	|	ЕСТЬNULL(ВТ_СписаниеСИЗ.Регистратор, ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ДокументВозврата) КАК ДокументВозврата,
	|	ЕСТЬNULL(ВТ_СписаниеСИЗ.Количество, ВТ_ВыдачаВозврат_ДляДополненияСписаниями.КоличествоВозвращенных) КАК КоличествоВозвращенных,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ПроцентИзносаВыданных КАК ПроцентИзносаВыданных,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ПроцентИзносаВозвращенных КАК ПроцентИзносаВозвращенных,
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями.НормаВыдачи КАК НормаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаВозврат
	|ИЗ
	|	ВТ_ВыдачаВозврат_ДляДополненияСписаниями КАК ВТ_ВыдачаВозврат_ДляДополненияСписаниями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписаниеСИЗ КАК ВТ_СписаниеСИЗ
	|		ПО ВТ_ВыдачаВозврат_ДляДополненияСписаниями.Номенклатура = ВТ_СписаниеСИЗ.Номенклатура
	|			И ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ХарактеристикаНоменклатуры = ВТ_СписаниеСИЗ.ХарактеристикаНоменклатуры
	|			И ВТ_ВыдачаВозврат_ДляДополненияСписаниями.ДатаВыдачиРег = ВТ_СписаниеСИЗ.ДатаВыдачи
	|			И ВТ_ВыдачаВозврат_ДляДополненияСписаниями.НормаВыдачи = ВТ_СписаниеСИЗ.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНорм.Сотрудник КАК Сотрудник,
	|	ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	//110181, Четаев С.В.{
	|	ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ТаблицаНорм.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_НормыСотрудников
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм
	|ГДЕ
	|	ТаблицаНорм.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	НормыВыдачиСИЗСоставНормы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьДляЛичнойКарточки КАК ПериодичностьДляЛичнойКарточки,
	|	ВЫБОР
	|		КОГДА НормыВыдачиСИЗСоставНормы.Ссылка.ОснованиеНормы ССЫЛКА Справочник.ПунктыТОН
	|			ТОГДА НормыВыдачиСИЗСоставНормы.Ссылка.ОснованиеНормы.Владелец.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТОН
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСотрудников.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	//110181, Четаев С.В.{
	|	ВТ_НормыСотрудников.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ВТ_ОсновноеМестоРаботы.Должность КАК Должность,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВТ_ОсновноеМестоРаботы.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_НормаСотрудникаИОсновнаяДолжность
	|ИЗ
	|	ВТ_НормыСотрудников КАК ВТ_НормыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_НормыСотрудников.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник КАК Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение КАК Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность КАК Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаЗанятыхРабочихМест
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ФизическоеЛицо.Пол КАК Пол,
	|	Сотрудники.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.Подразделение.Наименование, """") КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Должность.Наименование ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Должность.Наименование + "" (основная)""
	|	КОНЕЦ КАК Должность1,
	|	ВТ_Сотрудники.ТабельныйНомер КАК ТабельныйНомер,
	|	ВЫБОР
	|		КОГДА ВТ_Сотрудники.Сотрудник.ДатаПриемаДляЛичнойКарточки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//+++АсТБ_Alexey_113789_********************************************************************
	|			ТОГДА ВТ_ДатаПриема.ДатаПринятия
	//---АсТБ_Alexey_113789_********************************************************************
	|		ИНАЧЕ ВТ_Сотрудники.Сотрудник.ДатаПриемаДляЛичнойКарточки
	|	КОНЕЦ КАК ДатаПринятия,
	|	ВТ_Сотрудники.Пол КАК Пол,
	|	ВТ_ФИОФизлица.Фамилия КАК Фамилия,
	|	ВТ_ФИОФизлица.Имя КАК Имя,
	|	ВТ_ФИОФизлица.Отчество КАК Отчество,
	|	ВТ_РазмерГоловногоУбора.ЗначениеСвойства КАК РазмерГоловногоУбора,
	|	ВТ_РазмерОбуви.ЗначениеСвойства КАК РазмерОбуви,
	|	ВТ_РазмерОдежды.ЗначениеСвойства КАК РазмерОдежды,
	|	ВТ_РазмерПерчаток.ЗначениеСвойства КАК РазмерПерчаток,
	|	ВТ_РазмерПротивогаза.ЗначениеСвойства КАК РазмерПротивогаза,
	|	ВТ_РазмерРубашки.ЗначениеСвойства КАК РазмерРубашки,
	|	ВТ_Рост.ЗначениеСвойства КАК Рост,
	|	"""" КАК РазмерРеспиратора,
	|	"""" КАК РазмерРукавиц,
	//+++АсТБ_Alexey_113789_********************************************************************
	|	ЕСТЬNULL(ВТ_ДатаПеревода.ДатаПеревода, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПеревода,
	//---АсТБ_Alexey_113789_********************************************************************
	|	"""" КАК Основание,
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель.Наименование, """") КАК Руководитель
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	//+++АсТБ_Alexey_113789_********************************************************************
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПриема КАК ВТ_ДатаПриема
	|			ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_ДатаПриема.Сотрудник
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПеревода КАК ВТ_ДатаПеревода
	|			ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_ДатаПеревода.Сотрудник
	//---АсТБ_Alexey_113789_********************************************************************
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИОФизлица КАК ВТ_ФИОФизлица
	|		ПО ВТ_Сотрудники.ФизическоеЛицо = ВТ_ФИОФизлица.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерГоловногоУбора КАК ВТ_РазмерГоловногоУбора
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерГоловногоУбора.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерОбуви КАК ВТ_РазмерОбуви
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерОбуви.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерОдежды КАК ВТ_РазмерОдежды
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерОдежды.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерПерчаток КАК ВТ_РазмерПерчаток
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерПерчаток.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерПротивогаза КАК ВТ_РазмерПротивогаза
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерПротивогаза.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмерРубашки КАК ВТ_РазмерРубашки
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РазмерРубашки.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рост КАК ВТ_Рост
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_Рост.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоставНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	//110181, Четаев С.В.{
	|	ВТ_НормаСотрудникаИОсновнаяДолжность.УсловиеНормы КАК УсловиеНормы,
	|	СпрУсловияНорм.ГруппаУсловия КАК ГруппаУсловия,
	//}110181, Четаев С.В.
	|	ВЫБОР
	|		КОГДА ВТ_СоставНормы.ПериодичностьДляЛичнойКарточки = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Период)
	|						ТОГДА ВТ_СоставНормы.ПериодичностьВыдачи
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.ДоИзноса)
	|								ТОГДА ""До износа""
	|							ИНАЧЕ ВТ_СоставНормы.НормаВыдачи.ВидРасчета
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СоставНормы.ПериодичностьДляЛичнойКарточки
	|	КОНЕЦ КАК ПериодичностьВыдачи,
	|	ВТ_СоставНормы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|															ТОГДА ВЫБОР
	|																	КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																		ТОГДА ВЫБОР
	|																				КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|																					ТОГДА ВЫБОР
	|																							КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																								ТОГДА ВТ_СоставНормы.НормаВыдачи.ОснованиеНормы
	|																							ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|																						КОНЕЦ
	|																				ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание
	|																			КОНЕЦ
	|																	ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание
	|																КОНЕЦ
	|														ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание
	|													КОНЕЦ
	|											ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание
	|	КОНЕЦ КАК ПорядковыйНомерТОН
	|ИЗ
	|	ВТ_НормаСотрудникаИОсновнаяДолжность КАК ВТ_НормаСотрудникаИОсновнаяДолжность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	//110181, Четаев С.В.{
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияНорм КАК СпрУсловияНорм
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.УсловиеНормы = СпрУсловияНорм.Ссылка
	//}110181, Четаев С.В.
	|ГДЕ
	|	ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|
	|УПОРЯДОЧИТЬ ПО
	//110181, Четаев С.В.{
	|	СпрУсловияНорм.ГруппаУсловия,
	//}110181, Четаев С.В.
	|	ВТ_СоставНормы.НоменклатураНормы.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаВозврат.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаВозврат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаВозврат.ДатаВыдачиРег КАК ДатаВыдачиРег,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДатаВыдачи) КАК ДатаВыдачи,
	|	ВТ_ВыдачаВозврат.ДокументВыдачи КАК ДокументВыдачи,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.КоличествоВыданных) КАК КоличествоВыданных,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДатаВозврата) КАК ДатаВозврата,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ДокументВозврата) КАК ДокументВозврата,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.КоличествоВозвращенных) КАК КоличествоВозвращенных,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ПроцентИзносаВыданных) КАК ПроцентИзносаВыданных,
	|	МАКСИМУМ(ВТ_ВыдачаВозврат.ПроцентИзносаВозвращенных) КАК ПроцентИзносаВозвращенных,
	|	ВТ_ВыдачаВозврат.НормаВыдачи КАК НормаВыдачи
	|ИЗ
	|	ВТ_ВыдачаВозврат КАК ВТ_ВыдачаВозврат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаВозврат.Номенклатура,
	|	ВТ_ВыдачаВозврат.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаВозврат.ДатаВыдачиРег,
	|	ВТ_ВыдачаВозврат.ДокументВыдачи,
	|	ВТ_ВыдачаВозврат.НормаВыдачи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|															ТОГДА ВЫБОР
	|																	КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																		ТОГДА ВЫБОР
	|																				КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|																					ТОГДА ВЫБОР
	|																							КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																								ТОГДА ВТ_СоставНормы.ТОН
	|																							ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|																						КОНЕЦ
	|																				ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание.Владелец.Наименование
	|																			КОНЕЦ
	|																	ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|																КОНЕЦ
	|														ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание.Владелец.Наименование
	|													КОНЕЦ
	|											ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание.Владелец.Наименование
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание.Владелец.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание.Владелец.Наименование
	|	КОНЕЦ КАК ТОН
	|ИЗ
	|	ВТ_НормаСотрудникаИОсновнаяДолжность КАК ВТ_НормаСотрудникаИОсновнаяДолжность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИОсновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИОсновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	|ГДЕ
	|	ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТОН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЗанятыхРабочихМест.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаЗанятыхРабочихМест.Должность КАК Должность
	|ИЗ
	|	ВТ_ТаблицаЗанятыхРабочихМест КАК ВТ_ТаблицаЗанятыхРабочихМест
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_ТаблицаЗанятыхРабочихМест.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|			И ВТ_ТаблицаЗанятыхРабочихМест.Подразделение = ВТ_ОсновноеМестоРаботы.Подразделение
	|			И ВТ_ТаблицаЗанятыхРабочихМест.Должность = ВТ_ОсновноеМестоРаботы.Должность
	|			И ВТ_ТаблицаЗанятыхРабочихМест.РабочееМесто = ВТ_ОсновноеМестоРаботы.РабочееМесто
	|ГДЕ
	|	ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL";
	//АсТБ_Alexey_84651_********************************************************************
	
	ПервыйДокумент = Истина;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("Сотрудник", 					ЭлементМассива);
		Запрос.УстановитьПараметр("ТаблицаНорм", 				ТаблицаСНормами);
		Запрос.УстановитьПараметр("ФизическоеЛицо", 			ЭлементМассива.ФизическоеЛицо);
		Запрос.УстановитьПараметр("Период", 					ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", 				ЭлементМассива.Владелец);
		Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
		//АсТБ_Alexey_84651_********************************************************************
		Запрос.УстановитьПараметр("МассивНормВыдачи", 			ТаблицаСНормами.ВыгрузитьКолонку("НормаВыдачи"));
		//АсТБ_Alexey_84651_********************************************************************
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточкаДежурные");
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		//+++АсТБ_Alexey_113789_********************************************************************
		//+++АСТБ_Горюшин_Алексей_63501
		//АсТБ_Alexey_84651_********************************************************************
		//ЛицеваяСторона_Шапка 	= ПакетЗапросов[30].Выгрузить();
		//ЛицеваяСторона_Строки 	= ПакетЗапросов[31].Выгрузить();
		//ОборотнаяСторона_Строки = ПакетЗапросов[32].Выгрузить();
		//ТаблицаТОН 				= ПакетЗапросов[33].Выгрузить();
		//НеОсновныеМестаРаботы   = ПакетЗапросов[34].Выгрузить();
		//АсТБ_Alexey_84651_********************************************************************
		//было
		//ЛицеваяСторона_Шапка 	= ПакетЗапросов[20].Выгрузить();
		//ЛицеваяСторона_Строки 	= ПакетЗапросов[21].Выгрузить();
		//ОборотнаяСторона_Строки = ПакетЗапросов[22].Выгрузить();
		//ТаблицаТОН 				= ПакетЗапросов[23].Выгрузить();
		//НеОсновныеМестаРаботы   = ПакетЗапросов[24].Выгрузить();
		//---АСТБ_Горюшин_Алексей_63501
		ЛицеваяСторона_Шапка 	= ПакетЗапросов[32].Выгрузить();
		ЛицеваяСторона_Строки 	= ПакетЗапросов[33].Выгрузить();
		ОборотнаяСторона_Строки = ПакетЗапросов[34].Выгрузить();
		ТаблицаТОН 				= ПакетЗапросов[35].Выгрузить();
		НеОсновныеМестаРаботы   = ПакетЗапросов[36].Выгрузить();
		//+++АсТБ_Alexey_113789_********************************************************************
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Шапка");
		Если ЛицеваяСторона_Шапка.Количество() > 0 Тогда
			Область.Параметры.Заполнить(ЛицеваяСторона_Шапка[0]);
			Основание = "";
			Для Каждого СтрокаТаблицыТОН Из ТаблицаТОН Цикл
				Если ЗначениеЗаполнено(Основание) Тогда
					Основание = Основание + ", " + СокрЛП(СтрокаТаблицыТОН.ТОН);
				Иначе
					Основание = СокрЛП(СтрокаТаблицыТОН.ТОН);
				КонецЕсли;
			КонецЦикла;
			Область.Параметры.Основание 	= Основание;
			Область.Параметры.ДатаПринятия 	= Формат(ЛицеваяСторона_Шапка[0].ДатаПринятия, "ДЛФ=Д");
			Область.Параметры.ДатаПеревода 	= ?(ЗначениеЗаполнено(ЛицеваяСторона_Шапка[0].ДатаПеревода),Формат(ЛицеваяСторона_Шапка[0].ДатаПеревода, "ДЛФ=Д"),"");
			Сч = 2;
			Для Каждого НеОсновноеМестоРаботы Из НеОсновныеМестаРаботы Цикл
				Если Сч = 2 Тогда
					Область.Параметры.Должность2 = Строка(НеОсновноеМестоРаботы.Должность);
				ИначеЕсли Сч = 3 Тогда
					Область.Параметры.Должность3 = Строка(НеОсновноеМестоРаботы.Должность);	
				Иначе //больше 3-х мест работы не влезет на форму
					Прервать;
				КонецЕсли;
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
		
		ТекущаяНормаВыдачи = "";
		
		//110181, Четаев С.В.{
		ТекущаяГруппаУсловий = Неопределено;
		ОбъединитьНомеклатуруНормы = Ложь;
		//}110181, Четаев С.В.
		
		Для Каждого СтрокаЛицевойСтороны Из ЛицеваяСторона_Строки Цикл
			
			//110181, Четаев С.В.{
			НаименованиеОбъединеннойНомеклатурыНормы = "";
			
			Если ЗначениеЗаполнено(СтрокаЛицевойСтороны.ГруппаУсловия) И СтрокаЛицевойСтороны.ГруппаУсловия = ТекущаяГруппаУсловий Тогда
				//Область = Макет.ПолучитьОбласть("ЛицеваяСторона_ИЛИ");
				//ТабличныйДокумент.Вывести(Область);
				
				// Наименование взаимозаменяемых номенклатур нормы требуется прописать в одной ячейке
				ОбъединитьНомеклатуруНормы = Истина;
				
				НаименованиеОбъединеннойНомеклатурыНормы = ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы,
															2, 
															ТабличныйДокумент.ВысотаТаблицы, 
															29).Текст;
				НаименованиеОбъединеннойНомеклатурыНормы = НаименованиеОбъединеннойНомеклатурыНормы + Символы.ПС + 
												"ИЛИ" + Символы.ПС + 
												СтрокаЛицевойСтороны.НоменклатураНормы.Наименование;
												
				// Будем удалять предыдущую строку и формировать новую с объединенным наименованием номенклатуры нормы.
				// Заполнение остальных ячеек оставляем как есть. По словам аналитика значения (ед. измерения, количество и пр.) для всех объединеных строк будут одинаковые.
				УдаляемаяОбласть = ТабличныйДокумент.Область("R"+Строка(ТабличныйДокумент.ВысотаТаблицы));
				ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
			ТекущаяГруппаУсловий = СтрокаЛицевойСтороны.ГруппаУсловия;
			//}110181, Четаев С.В.
			
			Если СтрокаЛицевойСтороны.НормаВыдачи = ТекущаяНормаВыдачи Тогда
			    Область = Макет.ПолучитьОбласть("ЛицеваяСторона_ИЛИ");
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			ТекущаяНормаВыдачи = СтрокаЛицевойСтороны.НормаВыдачи;
			
			Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Строка");
			Область.Параметры.Заполнить(СтрокаЛицевойСтороны);
			
			//110181, Четаев С.В.{
			Если ОбъединитьНомеклатуруНормы Тогда
				Область.Параметры.НоменклатураНормы = НаименованиеОбъединеннойНомеклатурыНормы;
				ОбъединитьНомеклатуруНормы = Ложь;
			КонецЕсли;
			//}110181, Четаев С.В.
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Подвал");
		Область.Параметры.Руководитель = ?(ЗначениеЗаполнено(ЛицеваяСторона_Шапка[0].Руководитель),ФизическиеЛица.ФамилияИнициалыФизЛица(ЛицеваяСторона_Шапка[0].Руководитель),"");
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Область = Макет.ПолучитьОбласть("ОборотнаяСторона_Шапка");
		ТабличныйДокумент.Вывести(Область);
		
		Для Каждого СтрокаОборотнойСтороны Из ОборотнаяСторона_Строки Цикл
			
			Если СтрокаОборотнойСтороны.КоличествоВыданных = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			//+++АСТБ_Горюшин_Алексей_19561
			Если СтрокаОборотнойСтороны.ДатаВыдачи = NULL Тогда
				Продолжить;
			КонецЕсли;
			//---АСТБ_Горюшин_Алексей_19561
			
			Область = Макет.ПолучитьОбласть("ОборотнаяСторона_Строка");
			Область.Параметры.Заполнить(СтрокаОборотнойСтороны);
			Область.Параметры.НоменклатураВыдачи 		= ?(ЗначениеЗаполнено(СтрокаОборотнойСтороны.ХарактеристикаНоменклатуры),СтрокаОборотнойСтороны.Номенклатура.Наименование + " (" + СтрокаОборотнойСтороны.ХарактеристикаНоменклатуры.Наименование + ")",СтрокаОборотнойСтороны.Номенклатура.Наименование);
			Область.Параметры.СертификатСоответствия 	= ПроцедурыРаботыСНормамиСервер.ПолучитьНомерСертификатаНоменклатуры(СтрокаОборотнойСтороны.Номенклатура,СтрокаОборотнойСтороны.ДатаВыдачиРег);
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ЭлементМассива);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//АСТБ_Овсянников_---------------------------------------------------------------------

Функция СформироватьПечатнуюФормуЛичнойКарточкиДСИЗ(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЛичнаяКарточка_ЛичнаяКарточка";
	
	Если МассивОбъектов.Количество() > 0 Тогда
		Организация = МассивОбъектов[0].Владелец;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Неопределено);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивОбъектов,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"),Неопределено);
	
	//110181, Четаев С.В.{
	//ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	СоставПолей = "Сотрудник,Подразделение,ЭтоЗима,НормаВыдачи,НоменклатураНормы,ТипПериода,КоличествоПериодов,КоличествоВПериоде,Использовать,УсловиеНормы";
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа,СоставПолей);
	//}110181, Четаев С.В.
	
	Запрос = Новый Запрос;
	//АсТБ_Alexey_84651_********************************************************************
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	|				И Организация = &Организация) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Организация = &Организация
	|	И УточненныеОснованияНормВыдачи.НормаВыдачи В(&МассивНормВыдачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Подразделение КАК Подразделение,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	НЕ ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.Должность КАК Должность,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.РабочееМесто КАК РабочееМесто,
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УточненныеОснования.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_УточненныеОснования.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	ВТ_УточненныеОснования КАК ВТ_УточненныеОснования
	|ГДЕ
	|	ВТ_УточненныеОснования.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И ВТ_УточненныеОснования.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Период КАК Период,
	|	ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	ЗанятыеРабочиеМеста.Должность КАК Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ПриемНаРаботу
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|ГДЕ
	|	ЗанятыеРабочиеМеста.Организация = &Организация
	|	И ЗанятыеРабочиеМеста.Сотрудник = &Сотрудник
	|	И ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//+++АсТБ_Alexey_113789_********************************************************************
	|	И ЗанятыеРабочиеМеста.Регистратор ССЫЛКА Документ.ПриемНаРаботу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Период КАК Период,
	|	ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	ЗанятыеРабочиеМеста.Должность КАК Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_КадровоеПеремещение
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста КАК ЗанятыеРабочиеМеста
	|ГДЕ
	|	ЗанятыеРабочиеМеста.Организация = &Организация
	|	И ЗанятыеРабочиеМеста.Сотрудник = &Сотрудник
	|	И ЗанятыеРабочиеМеста.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ЗанятыеРабочиеМеста.Регистратор ССЫЛКА Документ.КадровоеПеремещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(МИНИМУМ(ВТ_ПриемНаРаботу.Период), ДЕНЬ) КАК ДатаПринятия
	|ПОМЕСТИТЬ ВТ_ДатаПриема
	|ИЗ
	|	ВТ_ПриемНаРаботу КАК ВТ_ПриемНаРаботу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПриемНаРаботу.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КадровоеПеремещение.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ВТ_КадровоеПеремещение.Период), ДЕНЬ) КАК ДатаПеревода
	|ПОМЕСТИТЬ ВТ_ДатаПеревода
	|ИЗ
	|	ВТ_КадровоеПеремещение КАК ВТ_КадровоеПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КадровоеПеремещение.Сотрудник
	|;
	|
	//---АсТБ_Alexey_113789_********************************************************************
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ФИОФизлица
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо) КАК ФИОФизическихЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащиты.Период КАК Период,
	|	ВыданныеСредстваЗащиты.Регистратор КАК Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащиты.Количество) КАК Количество,
	|	ВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
	|ГДЕ
	|	ВыданныеСредстваЗащиты.Организация = &Организация
	|	И ВыданныеСредстваЗащиты.Сотрудник = &Сотрудник
	|	И ВыданныеСредстваЗащиты.Номенклатура.ВидСИЗ.Дерматологический
	|	И ВыданныеСредстваЗащиты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ВЫБОР
	|			КОГДА ВыданныеСредстваЗащиты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|					И ВыданныеСредстваЗащиты.Регистратор.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ВыданныеСредстваЗащиты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВыданныеСредстваЗащиты.Активность
	|	И НЕ ВыданныеСредстваЗащиты.Регистратор ССЫЛКА Документ.ЗачетВыданныхСредствЗащиты
	|	И НЕ ВыданныеСредстваЗащиты.НеВыводитьВыдачуВ_ЛК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащиты.Период,
	|	ВыданныеСредстваЗащиты.Регистратор,
	|	ВыданныеСредстваЗащиты.Номенклатура,
	|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащиты.ДатаВыдачи,
	|	ВыданныеСредстваЗащиты.НормаВыдачи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Период,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Регистратор,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Номенклатура,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.ХарактеристикаНоменклатуры,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Период,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.КоличествоОборот,
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.НормаВыдачи
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащитыПоВедомости.Обороты(, , Регистратор, ) КАК ВыданныеСредстваЗащитыПоВедомостиОбороты
	|ГДЕ
	|	ВыданныеСредстваЗащитыПоВедомостиОбороты.Организация = &Организация
	|	И ВыданныеСредстваЗащитыПоВедомостиОбороты.Сотрудник = &Сотрудник
	|	И ВыданныеСредстваЗащитыПоВедомостиОбороты.Номенклатура.ВидСИЗ.Дерматологический
	|	И НЕ ВыданныеСредстваЗащитыПоВедомостиОбороты.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНорм.Сотрудник КАК Сотрудник,
	|	ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	//110181, Четаев С.В.{
	|	ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ТаблицаНорм.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_НормыСотрудников
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм
	|ГДЕ
	|	ТаблицаНорм.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормыСотрудников.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НормыСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	//110181, Четаев С.В.{
	|	ВТ_НормыСотрудников.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ВТ_ОсновноеМестоРаботы.Должность КАК Должность,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВТ_ОсновноеМестоРаботы.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_НормаСотрудникаИОсновнаяДолжность
	|ИЗ
	|	ВТ_НормыСотрудников КАК ВТ_НормыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_НормыСотрудников.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	НормыВыдачиСИЗСоставНормы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьДляЛичнойКарточки КАК ПериодичностьДляЛичнойКарточки
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоставНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	//110181, Четаев С.В.{
	|	ВТ_НормаСотрудникаИОсновнаяДолжность.УсловиеНормы КАК УсловиеНормы,
	//}110181, Четаев С.В.
	|	ВЫБОР
	|		КОГДА ВТ_СоставНормы.ПериодичностьДляЛичнойКарточки = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Период)
	|						ТОГДА ВТ_СоставНормы.ПериодичностьВыдачи
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.ДоИзноса)
	|								ТОГДА ""До износа""
	|							ИНАЧЕ ВТ_СоставНормы.НормаВыдачи.ВидРасчета
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СоставНормы.ПериодичностьДляЛичнойКарточки
	|	КОНЕЦ КАК ПериодичностьВыдачи,
	|	ВТ_СоставНормы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|															ТОГДА ВЫБОР
	|																	КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																		ТОГДА ВЫБОР
	|																				КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|																					ТОГДА ВЫБОР
	|																							КОГДА ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																								ТОГДА ВТ_СоставНормы.НормаВыдачи.ОснованиеНормы
	|																							ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|																						КОНЕЦ
	|																				ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.Основание
	|																			КОНЕЦ
	|																	ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание
	|																КОНЕЦ
	|														ИНАЧЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Основание
	|													КОНЕЦ
	|											ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Основание
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Основание
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Основание
	|	КОНЕЦ КАК ПорядковыйНомерТОН
	|ПОМЕСТИТЬ ВТ_ЛицеваяСторона_Строки
	|ИЗ
	|	ВТ_НормаСотрудникаИОсновнаяДолжность КАК ВТ_НормаСотрудникаИосновнаяДолжность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.Подразделение
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.Должность
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Должность = ВТ_УточненныеОснования_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.РабочееМесто = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_НормаСотрудникаИосновнаяДолжность.НормаВыдачи = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_НормаСотрудникаИосновнаяДолжность.Подразделение = ВТ_УточненныеОснования_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	|ГДЕ
	|	ВТ_СоставНормы.НоменклатураНормы.ВидСИЗ.Дерматологический
	|	И НЕ ВТ_СоставНормы.НормаВыдачи.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Дежурный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ФизическоеЛицо.Пол КАК Пол,
	|	Сотрудники.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник КАК Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение КАК Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность КАК Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаЗанятыхРабочихМест
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.Подразделение.Наименование, """") КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Должность.Наименование ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Должность.Наименование + "" (основная)""
	|	КОНЕЦ КАК Должность1,
	|	ВТ_Сотрудники.ТабельныйНомер КАК ТабельныйНомер,
	|	ВЫБОР
	|		КОГДА ВТ_Сотрудники.Сотрудник.ДатаПриемаДляЛичнойКарточки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//+++АсТБ_Alexey_113789_********************************************************************
	|			ТОГДА ВТ_ДатаПриема.ДатаПринятия
	//---АсТБ_Alexey_113789_********************************************************************
	|		ИНАЧЕ ВТ_Сотрудники.Сотрудник.ДатаПриемаДляЛичнойКарточки
	|	КОНЕЦ КАК ДатаПринятия,
	|	ВТ_Сотрудники.Пол КАК Пол,
	|	ВТ_ФИОФизлица.Фамилия КАК Фамилия,
	|	ВТ_ФИОФизлица.Имя КАК Имя,
	|	ВТ_ФИОФизлица.Отчество КАК Отчество,
	//+++АсТБ_Alexey_113789_********************************************************************
	|	ЕСТЬNULL(ВТ_ДатаПеревода.ДатаПеревода, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПеревода,
	//---АсТБ_Alexey_113789_********************************************************************
	|	"""" КАК Основание,
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.Подразделение.Руководитель.Наименование, """") КАК Руководитель
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	//+++АсТБ_Alexey_113789_********************************************************************
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПриема КАК ВТ_ДатаПриема
	|			ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_ДатаПриема.Сотрудник
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПеревода КАК ВТ_ДатаПеревода
	|			ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_ДатаПеревода.Сотрудник
	//---АсТБ_Alexey_113789_********************************************************************
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИОФизлица КАК ВТ_ФИОФизлица
	|		ПО ВТ_Сотрудники.ФизическоеЛицо = ВТ_ФИОФизлица.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЛицеваяСторона_Строки.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ЛицеваяСторона_Строки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ЛицеваяСторона_Строки.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ЛицеваяСторона_Строки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//110181, Четаев С.В.{
	|	ВТ_ЛицеваяСторона_Строки.УсловиеНормы КАК УсловиеНормы,
	|	СпрУсловияНорм.ГруппаУсловия КАК ГруппаУсловия,
	//}110181, Четаев С.В.
	|	ВТ_ЛицеваяСторона_Строки.ПорядковыйНомерТОН КАК ПорядковыйНомерТОН
	|ИЗ
	|	ВТ_ЛицеваяСторона_Строки КАК ВТ_ЛицеваяСторона_Строки
	//110181, Четаев С.В.{
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияНорм КАК СпрУсловияНорм
	|		ПО ВТ_ЛицеваяСторона_Строки.УсловиеНормы = СпрУсловияНорм.Ссылка
	//}110181, Четаев С.В.
	|
	|УПОРЯДОЧИТЬ ПО
	//110181, Четаев С.В.{
	|	СпрУсловияНорм.ГруппаУсловия,
	//}110181, Четаев С.В.
	|	ВТ_ЛицеваяСторона_Строки.НормаВыдачи.Наименование,
	|	ВТ_ЛицеваяСторона_Строки.НоменклатураНормы.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСИЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВТ_ВыдачаСИЗ.ДатаВыдачи) КАК ДатаВыдачиРег,
	|	ВТ_ВыдачаСИЗ.Регистратор КАК ДокументВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСИЗ.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВТ_ВыдачаСИЗ.ДатаВыдачи
	|		ИНАЧЕ ВТ_ВыдачаСИЗ.Период
	|	КОНЕЦ КАК ДатаВыдачи,
	|	ВТ_ВыдачаСИЗ.Количество КАК КоличествоВыданных,
	|	ВТ_ВыдачаСИЗ.НормаВыдачи КАК НормаВыдачи,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ВыдачаСИЗ.Номенклатура.ВидСИЗ.СпособВыдачиСИЗ) КАК СпособВыдачи
	|ИЗ
	|	ВТ_ВыдачаСИЗ КАК ВТ_ВыдачаСИЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаСИЗ.Номенклатура,
	|	ВТ_ВыдачаСИЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСИЗ.Регистратор,
	|	ВТ_ВыдачаСИЗ.Количество,
	|	ВТ_ВыдачаСИЗ.НормаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСИЗ.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВТ_ВыдачаСИЗ.ДатаВыдачи
	|		ИНАЧЕ ВТ_ВыдачаСИЗ.Период
	|	КОНЕЦ,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ВыдачаСИЗ.Номенклатура.ВидСИЗ.СпособВыдачиСИЗ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаЗанятыхРабочихМест.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаЗанятыхРабочихМест.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаЗанятыхРабочихМест.Должность КАК Должность,
	|	ВТ_ТаблицаЗанятыхРабочихМест.РабочееМесто КАК РабочееМесто
	|ИЗ
	|	ВТ_ТаблицаЗанятыхРабочихМест КАК ВТ_ТаблицаЗанятыхРабочихМест
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_ТаблицаЗанятыхРабочихМест.Подразделение = ВТ_ОсновноеМестоРаботы.Подразделение
	|			И ВТ_ТаблицаЗанятыхРабочихМест.Должность = ВТ_ОсновноеМестоРаботы.Должность
	|			И ВТ_ТаблицаЗанятыхРабочихМест.РабочееМесто = ВТ_ОсновноеМестоРаботы.РабочееМесто
	|ГДЕ
	|	ВТ_ТаблицаЗанятыхРабочихМест.Сотрудник = &Сотрудник
	|	И ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL";
	//АсТБ_Alexey_84651_********************************************************************
	
	ПервыйДокумент = Истина;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("Сотрудник", 					ЭлементМассива);
		Запрос.УстановитьПараметр("ТаблицаНорм", 				ТаблицаСНормами);
		Запрос.УстановитьПараметр("ФизическоеЛицо", 			ЭлементМассива.ФизическоеЛицо);
		Запрос.УстановитьПараметр("Период", 					ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", 				ЭлементМассива.Владелец);
		Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
		//АсТБ_Alexey_84651_********************************************************************
		Запрос.УстановитьПараметр("МассивНормВыдачи", 			ТаблицаСНормами.ВыгрузитьКолонку("НормаВыдачи"));
		//АсТБ_Alexey_84651_********************************************************************
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточкаДСИЗ");
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		//+++АсТБ_Alexey_113789_********************************************************************
		//АсТБ_Alexey_84651_********************************************************************
		//ЛицеваяСторона_Шапка 	= ПакетЗапросов[20].Выгрузить();
		//ЛицеваяСторона_Строки 	= ПакетЗапросов[21].Выгрузить();
		//ОборотнаяСторона_Строки = ПакетЗапросов[22].Выгрузить();
		//НеОсновныеМестаРаботы   = ПакетЗапросов[23].Выгрузить();
		ЛицеваяСторона_Шапка 	= ПакетЗапросов[22].Выгрузить();
		ЛицеваяСторона_Строки 	= ПакетЗапросов[23].Выгрузить();
		ОборотнаяСторона_Строки = ПакетЗапросов[24].Выгрузить();
		НеОсновныеМестаРаботы   = ПакетЗапросов[25].Выгрузить();
		//АсТБ_Alexey_84651_********************************************************************
		//---АсТБ_Alexey_113789_********************************************************************
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Шапка");
		Если ЛицеваяСторона_Шапка.Количество() > 0 Тогда
			Область.Параметры.Заполнить(ЛицеваяСторона_Шапка[0]);
			Область.Параметры.ДатаПринятия = Формат(ЛицеваяСторона_Шапка[0].ДатаПринятия, "ДЛФ=Д");
			Область.Параметры.ДатаПеревода = ?(ЗначениеЗаполнено(ЛицеваяСторона_Шапка[0].ДатаПеревода),Формат(ЛицеваяСторона_Шапка[0].ДатаПеревода, "ДЛФ=Д"),"");
			Сч = 2;
			Для Каждого НеОсновноеМестоРаботы Из НеОсновныеМестаРаботы Цикл
				Если Сч = 2 Тогда
					Область.Параметры.Должность2 = Строка(НеОсновноеМестоРаботы.Должность);
				ИначеЕсли Сч = 3 Тогда
					Область.Параметры.Должность3 = Строка(НеОсновноеМестоРаботы.Должность);	
				Иначе //больше 3-х мест работы не влезет на форму
					Прервать;
				КонецЕсли;
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
		
		ТекущаяНормаВыдачи = "";
		//110181, Четаев С.В.{
		ТекущаяГруппаУсловий = Неопределено;
		ОбъединитьНомеклатуруНормы = Ложь;
		//}110181, Четаев С.В.
		
		Для Каждого СтрокаЛицевойСтороны Из ЛицеваяСторона_Строки Цикл
			
			//110181, Четаев С.В.{
			НаименованиеОбъединеннойНомеклатурыНормы = "";
			
			Если ЗначениеЗаполнено(СтрокаЛицевойСтороны.ГруппаУсловия) И СтрокаЛицевойСтороны.ГруппаУсловия = ТекущаяГруппаУсловий Тогда
				//Область = Макет.ПолучитьОбласть("ЛицеваяСторона_ИЛИ");
				//ТабличныйДокумент.Вывести(Область);
				
				// Наименование взаимозаменяемых номенклатур нормы требуется прописать в одной ячейке
				ОбъединитьНомеклатуруНормы = Истина;
				
				НаименованиеОбъединеннойНомеклатурыНормы = ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы,
															2, 
															ТабличныйДокумент.ВысотаТаблицы, 
															29).Текст;
				НаименованиеОбъединеннойНомеклатурыНормы = НаименованиеОбъединеннойНомеклатурыНормы + Символы.ПС + 
												"ИЛИ" + Символы.ПС + 
												СтрокаЛицевойСтороны.НоменклатураНормы.Наименование;
												
				// Будем удалять предыдущую строку и формировать новую с объединенным наименованием номенклатуры нормы.
				// Заполнение остальных ячеек оставляем как есть. По словам аналитика значения (ед. измерения, количество и пр.) для всех объединеных строк будут одинаковые.
				УдаляемаяОбласть = ТабличныйДокумент.Область("R"+Строка(ТабличныйДокумент.ВысотаТаблицы));
				ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
			ТекущаяГруппаУсловий = СтрокаЛицевойСтороны.ГруппаУсловия;
			//}110181, Четаев С.В.
			
			Если СтрокаЛицевойСтороны.НормаВыдачи = ТекущаяНормаВыдачи Тогда
			    Область = Макет.ПолучитьОбласть("ЛицеваяСторона_ИЛИ");
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			ТекущаяНормаВыдачи = СтрокаЛицевойСтороны.НормаВыдачи;
			
			Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Строка");
			Область.Параметры.Заполнить(СтрокаЛицевойСтороны);
			
			//110181, Четаев С.В.{
			Если ОбъединитьНомеклатуруНормы Тогда
				Область.Параметры.НоменклатураНормы = НаименованиеОбъединеннойНомеклатурыНормы;
				ОбъединитьНомеклатуруНормы = Ложь;
			КонецЕсли;
			//}110181, Четаев С.В.
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ЛицеваяСторона_Подвал");
		Область.Параметры.Руководитель = ?(ЗначениеЗаполнено(ЛицеваяСторона_Шапка[0].Руководитель),ФизическиеЛица.ФамилияИнициалыФизЛица(ЛицеваяСторона_Шапка[0].Руководитель),"");
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Область = Макет.ПолучитьОбласть("ОборотнаяСторона_Шапка");
		ТабличныйДокумент.Вывести(Область);
		
		Для Каждого СтрокаОборотнойСтороны Из ОборотнаяСторона_Строки Цикл
			
			//+++АСТБ_Горюшин_Алексей_19561
			Если СтрокаОборотнойСтороны.ДатаВыдачи = NULL Тогда
				Продолжить;
			КонецЕсли;
			//---АСТБ_Горюшин_Алексей_19561
			
			Область = Макет.ПолучитьОбласть("ОборотнаяСторона_Строка");
			Область.Параметры.Заполнить(СтрокаОборотнойСтороны);
			Область.Параметры.НоменклатураВыдачи 		= ?(ЗначениеЗаполнено(СтрокаОборотнойСтороны.ХарактеристикаНоменклатуры),СтрокаОборотнойСтороны.Номенклатура.Наименование + " (" + СтрокаОборотнойСтороны.ХарактеристикаНоменклатуры.Наименование + ")",СтрокаОборотнойСтороны.Номенклатура.Наименование);
			Область.Параметры.СертификатСоответствия 	= ПроцедурыРаботыСНормамиСервер.ПолучитьНомерСертификатаНоменклатуры(СтрокаОборотнойСтороны.Номенклатура,СтрокаОборотнойСтороны.ДатаВыдачиРег);
			
			
			Если ТипЗнч(СтрокаОборотнойСтороны.ДокументВыдачи) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
				Если СтрокаОборотнойСтороны.ДокументВыдачи.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда
					Если ЗначениеЗаполнено(СтрокаОборотнойСтороны.ДокументВыдачи.ДокументОснование) Тогда
						Область.Параметры.ДокументВыдачи = Строка(СтрокаОборотнойСтороны.ДокументВыдачи) + " по ведомости №" + СтрокаОборотнойСтороны.ДокументВыдачи.ДокументОснование.Номер + " от " + Формат(СтрокаОборотнойСтороны.ДокументВыдачи.ДокументОснование.Дата,"ДФ=dd.MM.yyyy");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ЭлементМассива);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//АСТБ_Овсянников_---------------------------------------------------------------------

Функция СформироватьПечатнуюФормуЛичнойКарточкиПрохожденияОбученияБезопасностиТруда(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПАРАМЕТРЫ_ПЕЧАТИ_ЛичнаяКарточка_ЛичнаяКарточкаПрохожденияОбученияБезопасностиТруда";
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_ЛичнаяКарточкаПрохожденияОбученияБезопасностиТруда");
	
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(&ДатаАнализа, ) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнструктажиСотрудников.Подразделение КАК Подразделение,
	|	ИнструктажиСотрудников.Должность КАК Должность,
	|	ИнструктажиСотрудников.Инструктаж КАК Инструктаж,
	|	ИнструктажиСотрудников.ДатаИнструктажа КАК ДатаИнструктажа,
	|	ИнструктажиСотрудников.Регистратор.ВидИнструктажа КАК РегистраторВидИнструктажа,
	|	ИнструктажиСотрудников.Регистратор.ПричинаПроведения КАК РегистраторПричинаПроведения,
	|	ИнструктажиСотрудников.Ответственный КАК Ответственный,
	|	ИнструктажиСотрудников.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Инструктажи
	|ИЗ
	|	РегистрСведений.ИнструктажиСотрудников КАК ИнструктажиСотрудников
	|ГДЕ
	|	ИнструктажиСотрудников.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА Сотрудники.ФизическоеЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ ГОД(Сотрудники.ФизическоеЛицо.ДатаРождения)
	|	КОНЕЦ КАК ГодРождения
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудник.Сотрудник КАК ПредставлениеСотрудника,
	|	ВТ_Сотрудник.ГодРождения КАК ГодРождения,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВТ_ОсновноеМестоРаботы.Должность КАК Должность,
	|	ВТ_ОсновноеМестоРаботы.Период КАК ДатаПриема,
	|	ЕСТЬNULL(ВложенныйЗапрос.ДатаИнструктажа, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводногоИнструктажа,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Инструктор ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВложенныйЗапрос.Инструктор.Наименование
	|	КОНЕЦ КАК Инструктор,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ДолжностьИнструктора ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВложенныйЗапрос.ДолжностьИнструктора.Наименование
	|	КОНЕЦ КАК ДолжностьИнструктора
	|ИЗ
	|	ВТ_Сотрудник КАК ВТ_Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_Сотрудник.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_Инструктажи.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ВТ_Инструктажи.ДатаИнструктажа) КАК ДатаИнструктажа,
	|			ВТ_Инструктажи.Ответственный КАК Инструктор,
	|			ВТ_ОсновноеМестоРаботы.Должность КАК ДолжностьИнструктора
	|		ИЗ
	|			ВТ_Инструктажи КАК ВТ_Инструктажи
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|				ПО ВТ_Инструктажи.Ответственный = ВТ_ОсновноеМестоРаботы.Сотрудник
	|		ГДЕ
	|			ВТ_Инструктажи.РегистраторВидИнструктажа = ЗНАЧЕНИЕ(Перечисление.ВидыИнструктажей.Вводный)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_Инструктажи.Ответственный,
	|			ВТ_Инструктажи.Сотрудник,
	|			ВТ_ОсновноеМестоРаботы.Должность) КАК ВложенныйЗапрос
	|		ПО ВТ_Сотрудник.Сотрудник = ВложенныйЗапрос.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Инструктажи.ДатаИнструктажа КАК ДатаИнструктажа,
	|	ВТ_Инструктажи.Подразделение КАК МестоРаботы,
	|	ВТ_Инструктажи.Должность КАК Должность,
	|	ВТ_Инструктажи.РегистраторВидИнструктажа КАК ВидИнструктажа,
	|	ВТ_Инструктажи.РегистраторПричинаПроведения КАК ПричинаИнструктажа,
	|	ЕСТЬNULL(ВТ_Инструктажи.Ответственный.Наименование, """") КАК Инструктор,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновноеМестоРаботы.Должность ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ОсновноеМестоРаботы.Должность.Наименование
	|	КОНЕЦ КАК ДолжностьИнструктора
	|ИЗ
	|	ВТ_Инструктажи КАК ВТ_Инструктажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_Инструктажи.Ответственный = ВТ_ОсновноеМестоРаботы.Сотрудник
	|ГДЕ
	|	(ВТ_Инструктажи.РегистраторВидИнструктажа = ЗНАЧЕНИЕ(Перечисление.ВидыИнструктажей.Первичный)
	|			ИЛИ ВТ_Инструктажи.РегистраторВидИнструктажа = ЗНАЧЕНИЕ(Перечисление.ВидыИнструктажей.Повторный)
	|			ИЛИ ВТ_Инструктажи.РегистраторВидИнструктажа = ЗНАЧЕНИЕ(Перечисление.ВидыИнструктажей.Внеплановый))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИнструктажа";
	
	Запрос.УстановитьПараметр("Сотрудник",	МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ДатаАнализа",ТекущаяДата());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДляПервогоЛиста = Результат[3].Выгрузить();
	ДляВторогоЛиста = Результат[4].Выгрузить();
	
	//первый лист
	Область = Макет.ПолучитьОбласть("ПервыйЛист");
	Область.Параметры.Заполнить(ДляПервогоЛиста[0]);
	ПредставлениеИнструктора = ФизическиеЛица.ФамилияИнициалыФизЛица(ДляПервогоЛиста[0].Инструктор);
	Если ЗначениеЗаполнено(ДляПервогоЛиста[0].ДолжностьИнструктора) Тогда
		ПредставлениеИнструктора = ПредставлениеИнструктора + ", " + ДляПервогоЛиста[0].ДолжностьИнструктора;
	КонецЕсли;
	Область.Параметры.ПредставлениеВводногоИнструктажа = ПредставлениеИнструктора;
	Область.Параметры.ДатаПриема = Формат(ДляПервогоЛиста[0].ДатаПриема,"ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(Область);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	//второй лист
	Область = Макет.ПолучитьОбласть("ВторойЛист");
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Область);
	
	Для Каждого ТекущийИнструктаж Из ДляВторогоЛиста Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(ТекущийИнструктаж);
		ПредставлениеИнструктора = ФизическиеЛица.ФамилияИнициалыФизЛица(ТекущийИнструктаж.Инструктор);
		Если ЗначениеЗаполнено(ТекущийИнструктаж.ДолжностьИнструктора) Тогда
			ПредставлениеИнструктора = ПредставлениеИнструктора + ", " + ТекущийИнструктаж.ДолжностьИнструктора;
		КонецЕсли;
		Область.Параметры.ПредставлениеИнструктора 	= ПредставлениеИнструктора;
		Область.Параметры.ДатаИнструктажа 			= Формат(ТекущийИнструктаж.ДатаИнструктажа,"ДФ=dd.MM.yyyy");
	    ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;	
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	//третий лист
	Область = Макет.ПолучитьОбласть("ТретийЛист");
	ТабличныйДокумент.Вывести(Область);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати 					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 	= "Справочник.Сотрудники";
	КомандаПечати.Идентификатор 	= "ЛичнаяКарточка";
	КомандаПечати.Представление 	= НСтр("ru = 'Личная карточка'");
	
	//АСТБ_Овсянников_---------------------------------------------------------------------
	КомандаПечати 					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 	= "Справочник.Сотрудники";
	КомандаПечати.Идентификатор 	= "ЛичнаяКарточкаДСИЗ";
	КомандаПечати.Представление 	= НСтр("ru = 'Личная карточка ДСИЗ'");
	//АСТБ_Овсянников_---------------------------------------------------------------------
	
	КомандаПечати 					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 	= "Справочник.Сотрудники";
	КомандаПечати.Идентификатор 	= "ЛичнаяКарточкаДежурные";
	КомандаПечати.Представление 	= НСтр("ru = 'Личная карточка (дежурные)'");
	
	КомандаПечати 						= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 		= "Справочник.Сотрудники";
	КомандаПечати.Идентификатор 		= "ЛичнаяКарточкаПрохожденияОбученияБезопасностиТруда";
	КомандаПечати.Представление 		= НСтр("ru = 'Личная карточка прохождения обучения безопасности труда'");
	КомандаПечати.ФункциональныеОпции 	= "ИспользоватьПодсистемуОТиТБ";
	
КонецПроцедуры

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище
//
Функция ПолучитьДанныеДляПечатиЭтикеток(МассивСотрудников) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник КАК Сотрудник,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Подразделение КАК Подразделение,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.МВЗ КАК МВЗ,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|ГДЕ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник В(&МассивСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка КАК Комплект,
	|	НоменклатураКомплектующие.Номенклатура
	|ПОМЕСТИТЬ ВТ_Комплектующие
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|ГДЕ
	|	НоменклатураКомплектующие.Номенклатура.ИспользоватьШтрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаОкончанияИспользования
	|ПОМЕСТИТЬ ВТ_ВыдачаСПериодичностью
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(, Сотрудник В (&МассивСотрудников)) КАК ВыданныеСредстваЗащитыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВыданныеСредстваЗащитыОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВыданныеСредстваЗащитыОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСПериодичностью.Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСПериодичностью.Номенклатура.Комплект
	|			ТОГДА ВТ_Комплектующие.Номенклатура
	|		ИНАЧЕ ВТ_ВыдачаСПериодичностью.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВТ_ВыдачаСПериодичностью.ДатаВыдачи,
	|	ВТ_ВыдачаСПериодичностью.ДатаОкончанияИспользования
	|ПОМЕСТИТЬ ВТ_ВыдачаСКомплектующими
	|ИЗ
	|	ВТ_ВыдачаСПериодичностью КАК ВТ_ВыдачаСПериодичностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
	|		ПО ВТ_ВыдачаСПериодичностью.Номенклатура = ВТ_Комплектующие.Комплект
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВыдачаСПериодичностью.Номенклатура.Комплект
	|				ТОГДА НЕ ВТ_Комплектующие.Номенклатура ЕСТЬ NULL 
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Штрихкоды.Штрихкод,
	|	ВТ_Штрихкоды.Сотрудник,
	|	ВТ_Штрихкоды.Подразделение,
	|	ВТ_Штрихкоды.МВЗ,
	|	ВТ_Штрихкоды.Номенклатура,
	|	ВТ_Штрихкоды.ХарактеристикаНоменклатуры,
	|	ВТ_Штрихкоды.ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_Штрихкоды.Сотрудник.Владелец.ОтображатьДатуОкончанияСрокаНоскиНаЭтикетках
	|			ТОГДА ЕСТЬNULL(ВТ_ВыдачаСКомплектующими.ДатаОкончанияИспользования, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаОкончанияИспользования
	|ИЗ
	|	ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаСКомплектующими КАК ВТ_ВыдачаСКомплектующими
	|		ПО ВТ_Штрихкоды.Сотрудник = ВТ_ВыдачаСКомплектующими.Сотрудник
	|			И ВТ_Штрихкоды.Номенклатура = ВТ_ВыдачаСКомплектующими.Номенклатура
	|			И ВТ_Штрихкоды.ДатаВыдачи = ВТ_ВыдачаСКомплектующими.ДатаВыдачи";
	
	Запрос.УстановитьПараметр("МассивСотрудников", 	МассивСотрудников);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ИсходныеДанные", Запрос.Выполнить().Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресатовSMS(МассивСотрудников) Экспорт
	
	МассивАдресатов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК НомерТелефона,
	|	Сотрудники.Наименование КАК Наименование,
	|	ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивСотрудников)
	|	И ВЫБОР
	|			КОГДА ФизическиеЛицаКонтактнаяИнформация.НомерТелефона ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕ ФизическиеЛицаКонтактнаяИнформация.НомерТелефона = """"
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование";
	
	Запрос.УстановитьПараметр("МассивСотрудников",МассивСотрудников);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		МассивАдресатов.Добавить(Новый Структура("Телефон, НомерДляОтправки, Представление, ИсточникКонтактнойИнформации",
									ПолучитьНомерТелефонаДляСМС(СтрокаТаблицыЗапроса.ЗначенияПолей,"Телефон"),
									ПолучитьНомерТелефонаДляСМС(СтрокаТаблицыЗапроса.ЗначенияПолей,"НомерДляОтправки"),
									СтрокаТаблицыЗапроса.Наименование, 
									СтрокаТаблицыЗапроса.ФизическоеЛицо));
		
	КонецЦикла;	
	
    Возврат МассивАдресатов;
	
КонецФункции	

&НаСервере
Функция ПолучитьНомерТелефонаДляСМС(ЗначенияПолей, ВариантНомера)
	
	XDTOТелефон = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Телефон, Новый Структура);
	
	Если ВариантНомера = "Телефон" Тогда
		Возврат XDTOТелефон.Состав.КодСтраны + " (" + XDTOТелефон.Состав.КодГорода + ") " + XDTOТелефон.Состав.Номер;
	ИначеЕсли ВариантНомера = "НомерДляОтправки" Тогда
		Возврат XDTOТелефон.Состав.КодСтраны + XDTOТелефон.Состав.КодГорода + XDTOТелефон.Состав.Номер;
	Иначе
		Возврат "";
	КонецЕсли;	
		
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресатовEmail(МассивСотрудников) Экспорт
	
	МассивАдресатов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Наименование КАК Наименование,
	|	ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК Представление,
	|	ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивСотрудников)
	|	И ВЫБОР
	|			КОГДА ФизическиеЛицаКонтактнаяИнформация.АдресЭП ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕ ФизическиеЛицаКонтактнаяИнформация.АдресЭП = """"
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование";
	
	Запрос.УстановитьПараметр("МассивСотрудников",МассивСотрудников);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		МассивАдресатов.Добавить(Новый Структура("Адрес, Представление, ИсточникКонтактнойИнформации",
									СтрокаТаблицыЗапроса.АдресЭП,
									СтрокаТаблицыЗапроса.Представление, 
									СтрокаТаблицыЗапроса.ФизическоеЛицо));
		
	КонецЦикла;	
	
    Возврат МассивАдресатов;
	
КонецФункции

#КонецЕсли