
&НаСервере
Функция ПроверитьПодключениеППСНаСервере(ОписаниеОшибки)
	
	Возврат РегистрыСведений.НастройкиПараметровОбменаСАП.ПолучитьПроксиДляВыгрузкиППС(Запись.Организация, ОписаниеОшибки, Истина);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеППС(Команда)
	
	ОписаниеОшибки = "";
	
	Сообщение = Новый СообщениеПользователю;
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда	
		Сообщение.Текст = "Не заполнена организация!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Сообщение.Текст = "Перед проверкой подключения необходимо записать настройки!";
		Сообщение.Сообщить();
		Возврат;		
	КонецЕсли;
	
	ПодключениеУстановлено = ПроверитьПодключениеППСНаСервере(ОписаниеОшибки);
	
	Если ПодключениеУстановлено Тогда
		Сообщение.Текст = "Подключение установлено.";
	Иначе
		Сообщение.Текст = ОписаниеОшибки;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

//АсТБ_Alexey_57850_********************************************************************
&НаСервере
Функция ПроверитьПодключениеКомплектыИзППСНаСервере(ОписаниеОшибки)
	
	Возврат РегистрыСведений.НастройкиПараметровОбменаСАП.ПолучитьПроксиДляВыгрузкиКомплектовИзППС(Запись.Организация, ОписаниеОшибки, Истина);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеКомплектыИзППС(Команда)
	
	ОписаниеОшибки = "";
	
	Сообщение = Новый СообщениеПользователю;
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда	
		Сообщение.Текст = "Не заполнена организация!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Сообщение.Текст = "Перед проверкой подключения необходимо записать настройки!";
		Сообщение.Сообщить();
		Возврат;		
	КонецЕсли;
	
	ПодключениеУстановлено = ПроверитьПодключениеКомплектыИзППСНаСервере(ОписаниеОшибки);
	
	Если ПодключениеУстановлено Тогда
		Сообщение.Текст = "Подключение установлено.";
	Иначе
		Сообщение.Текст = ОписаниеОшибки;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры
//АсТБ_Alexey_57850_********************************************************************

// {ЮМадатов (26.07.21): <#102611 >

&НаСервереБезКонтекста
Функция ПроверкаСоединенияСВССАП(Организация)
	Возврат Интеграция_САП_Сервер.ПроверкаПодключенияКВебСервисуСАП(Организация);
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеСАП(Команда)
	РезультатПроверкиПОдключения = "";
	Сообщение = Новый СообщениеПользователю;
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда	
		Сообщение.Текст = "Не заполнена организация!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Сообщение.Текст = "Перед проверкой подключения необходимо записать настройки!";
		Сообщение.Сообщить();
		Возврат;		
	КонецЕсли;
	
	ПодключениеУстановлено = ПроверкаСоединенияСВССАП(Запись.Организация);
	РезультатПроверкиПОдключения = ?(ЗначениеЗаполнено(ПодключениеУстановлено), ПодключениеУстановлено, "Подключение установлено."); 
	Сообщение.Текст = РезультатПроверкиПОдключения;
	Сообщение.Сообщить();
КонецПроцедуры


// } ЮМадатов (26.07.21): <#102611 >
