
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Парам = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПарамДатаКон = Новый ПараметрКомпоновкиДанных("ДатаКон");
	ПарамДатаНач = Новый ПараметрКомпоновкиДанных("ДатаНач");
	
	Отчет.ДатаОкончания = ?(ТипЗнч(Парам.НайтиЗначениеПараметра(ПарамДатаКон).Значение) = Тип("СтандартнаяДатаНачала"), Парам.НайтиЗначениеПараметра(ПарамДатаКон).Значение.Дата, Парам.НайтиЗначениеПараметра(ПарамДатаКон).Значение);	
	Отчет.ДатаНачала = ?(ТипЗнч(Парам.НайтиЗначениеПараметра(ПарамДатаНач).Значение) = Тип("СтандартнаяДатаНачала"), Парам.НайтиЗначениеПараметра(ПарамДатаНач).Значение.Дата, Парам.НайтиЗначениеПараметра(ПарамДатаНач).Значение);
КонецПроцедуры
	

