
&НаСервере
Процедура ОтправитьУведомлениеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Модифицированность Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Перед отправкой уведомления необходимо записать документ!";
			СообщениеПользователю.Сообщить();
		Иначе
			Уведомление = Новый ДоставляемоеУведомление;
			Уведомление.Данные = "ОбратнаяСвязь";
			Уведомление.Текст = "Обработано Ваше обращение №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
			ОтправкаPUSHВызовСервера.ОтправитьУведомление(Уведомление,Объект.СоздательДокумента.ОбъектАвторизации, Объект.ВидУведомления);
			Объект.Отправлено = Истина;
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Перед отправкой уведомления необходимо записать документ!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	
	ОтправитьУведомлениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтправитьУведомление.Доступность = НЕ Объект.Отправлено;
	
КонецПроцедуры
