#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновоеСоглашениеТовары.Ссылка.Дата КАК Период,
	|	ЦеновоеСоглашениеТовары.Ссылка.Организация,
	|	ЦеновоеСоглашениеТовары.Ссылка.Поставщик,
	|	ЦеновоеСоглашениеТовары.Номенклатура,
	|	ЦеновоеСоглашениеТовары.Цена
	|ИЗ
	|	Документ.ЦеновоеСоглашение.Товары КАК ЦеновоеСоглашениеТовары
	|ГДЕ
	|	ЦеновоеСоглашениеТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры", Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

Процедура ПересчитатьДокументы(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновоеСоглашениеТовары.Ссылка.Дата КАК Дата,
	|	ЦеновоеСоглашениеТовары.Номенклатура КАК Номенклатура,
	|	ЦеновоеСоглашениеТовары.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	Документ.ЦеновоеСоглашение.Товары КАК ЦеновоеСоглашениеТовары
	|ГДЕ
	|	ЦеновоеСоглашениеТовары.Ссылка.Проведен
	|	И ЦеновоеСоглашениеТовары.Ссылка.Организация = &Организация
	|	И ЦеновоеСоглашениеТовары.Ссылка.Поставщик = &Поставщик
	|	И ЦеновоеСоглашениеТовары.Ссылка.Дата > &ДатаДокумента
	|	И ЦеновоеСоглашениеТовары.Номенклатура В(&МассивНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Цены.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ВТ_Цены.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_МинимальныеДаты
	|ИЗ
	|	ВТ_Цены КАК ВТ_Цены
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Цены.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МинимальныеДаты.Номенклатура КАК Номенклатура,
	|	ВТ_МинимальныеДаты.Дата КАК Дата,
	|	ВТ_Цены.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_МинимальныеДаты КАК ВТ_МинимальныеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_МинимальныеДаты.Номенклатура = ВТ_Цены.Номенклатура
	|			И ВТ_МинимальныеДаты.Дата = ВТ_Цены.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеновоеСоглашениеТовары.Номенклатура КАК Номенклатура,
	|	ЦеновоеСоглашениеТовары.Цена КАК Цена,
	|	ЕСТЬNULL(ВТ_Результат.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаСледующейЦены
	|ИЗ
	|	Документ.ЦеновоеСоглашение.Товары КАК ЦеновоеСоглашениеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Результат КАК ВТ_Результат
	|		ПО ЦеновоеСоглашениеТовары.Номенклатура = ВТ_Результат.Номенклатура
	|ГДЕ
	|	ЦеновоеСоглашениеТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Поставщик",			ТекущийОбъект.Поставщик);
	Запрос.УстановитьПараметр("ДатаДокумента",		ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("МассивНоменклатуры",	ТекущийОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Ссылка",				ТекущийОбъект.Ссылка);
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ДатаСледующейЦены КАК ДатаСледующейЦены,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	&ТаблицаЦен КАК ТаблицаЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ДокументыДляПересчета
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата >= &Дата
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗТовары.Ссылка,
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗТовары.Номенклатура,
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗТовары.Цена
	|ИЗ
	|	Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ.Товары КАК ЗаявкаНаПроизвольнуюВыдачуСИЗТовары
	|ГДЕ
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ЗаявкаНаПроизвольнуюВыдачуСИЗТовары.Ссылка.Дата >= &Дата
	|	И ЗаявкаНаПроизвольнуюВыдачуСИЗТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеНоменклатурыТовары.Ссылка,
	|	ПеремещениеНоменклатурыТовары.Номенклатура,
	|	ПеремещениеНоменклатурыТовары.Цена
	|ИЗ
	|	Документ.ПеремещениеНоменклатуры.Товары КАК ПеремещениеНоменклатурыТовары
	|ГДЕ
	|	ПеремещениеНоменклатурыТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ПеремещениеНоменклатурыТовары.Ссылка.Дата >= &Дата
	|	И ПеремещениеНоменклатурыТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНоменклатурыТовары.Ссылка,
	|	ПоступлениеНоменклатурыТовары.Номенклатура,
	|	ПоступлениеНоменклатурыТовары.Цена
	|ИЗ
	|	Документ.ПоступлениеНоменклатуры.Товары КАК ПоступлениеНоменклатурыТовары
	|ГДЕ
	|	ПоступлениеНоменклатурыТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ПоступлениеНоменклатурыТовары.Ссылка.Дата >= &Дата
	|	И ПоступлениеНоменклатурыТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеНоменклатурыТовары.Ссылка,
	|	СписаниеНоменклатурыТовары.Номенклатура,
	|	СписаниеНоменклатурыТовары.Цена
	|ИЗ
	|	Документ.СписаниеНоменклатуры.Товары КАК СписаниеНоменклатурыТовары
	|ГДЕ
	|	СписаниеНоменклатурыТовары.Номенклатура В(&МассивНоменклатуры)
	|	И СписаниеНоменклатурыТовары.Ссылка.Дата >= &Дата
	|	И СписаниеНоменклатурыТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратНоменклатурыПоставщикуТовары.Ссылка,
	|	ВозвратНоменклатурыПоставщикуТовары.Номенклатура,
	|	ВозвратНоменклатурыПоставщикуТовары.Цена
	|ИЗ
	|	Документ.ВозвратНоменклатурыПоставщику.Товары КАК ВозвратНоменклатурыПоставщикуТовары
	|ГДЕ
	|	ВозвратНоменклатурыПоставщикуТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ВозвратНоменклатурыПоставщикуТовары.Ссылка.Дата >= &Дата
	|	И ВозвратНоменклатурыПоставщикуТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка,
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Номенклатура,
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Цена
	|ИЗ
	|	Документ.ВозвратСредствЗащитыОтСотрудника.Товары КАК ВозвратСредствЗащитыОтСотрудникаТовары
	|ГДЕ
	|	ВозвратСредствЗащитыОтСотрудникаТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка.Дата >= &Дата
	|	И ВозвратСредствЗащитыОтСотрудникаТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратСредствЗащитыСХраненияТовары.Ссылка,
	|	ВозвратСредствЗащитыСХраненияТовары.Номенклатура,
	|	ВозвратСредствЗащитыСХраненияТовары.Цена
	|ИЗ
	|	Документ.ВозвратСредствЗащитыСХранения.Товары КАК ВозвратСредствЗащитыСХраненияТовары
	|ГДЕ
	|	ВозвратСредствЗащитыСХраненияТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ВозвратСредствЗащитыСХраненияТовары.Ссылка.Дата >= &Дата
	|	И ВозвратСредствЗащитыСХраненияТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Ссылка,
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Номенклатура,
	|	NULL
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыПоВедомости.Товары КАК ВыдачаСредствЗащитыПоВедомостиТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ВыдачаСредствЗащитыПоВедомостиТовары.Ссылка.Дата >= &Дата
	|	И ВыдачаСредствЗащитыПоВедомостиТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Цена
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ЗаказПоставщикуТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПоставщикуТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовПоставщикуТовары.Ссылка,
	|	ЗакрытиеЗаказовПоставщикуТовары.Номенклатура,
	|	ЗакрытиеЗаказовПоставщикуТовары.Цена
	|ИЗ
	|	Документ.ЗакрытиеЗаказовПоставщику.Товары КАК ЗакрытиеЗаказовПоставщикуТовары
	|ГДЕ
	|	ЗакрытиеЗаказовПоставщикуТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ЗакрытиеЗаказовПоставщикуТовары.Ссылка.Дата >= &Дата
	|	И ЗакрытиеЗаказовПоставщикуТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнвентаризацияНоменклатурыТовары.Ссылка,
	|	ИнвентаризацияНоменклатурыТовары.Номенклатура,
	|	ИнвентаризацияНоменклатурыТовары.Цена
	|ИЗ
	|	Документ.ИнвентаризацияНоменклатуры.Товары КАК ИнвентаризацияНоменклатурыТовары
	|ГДЕ
	|	ИнвентаризацияНоменклатурыТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ИнвентаризацияНоменклатурыТовары.Ссылка.Дата >= &Дата
	|	И ИнвентаризацияНоменклатурыТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КомплектацияНоменклатурыТовары.Ссылка,
	|	КомплектацияНоменклатурыТовары.Номенклатура,
	|	КомплектацияНоменклатурыТовары.Цена
	|ИЗ
	|	Документ.КомплектацияНоменклатуры.Товары КАК КомплектацияНоменклатурыТовары
	|ГДЕ
	|	КомплектацияНоменклатурыТовары.Номенклатура В(&МассивНоменклатуры)
	|	И КомплектацияНоменклатурыТовары.Ссылка.Дата >= &Дата
	|	И КомплектацияНоменклатурыТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеНоменклатурыТовары.Ссылка,
	|	ОприходованиеНоменклатурыТовары.Номенклатура,
	|	ОприходованиеНоменклатурыТовары.Цена
	|ИЗ
	|	Документ.ОприходованиеНоменклатуры.Товары КАК ОприходованиеНоменклатурыТовары
	|ГДЕ
	|	ОприходованиеНоменклатурыТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ОприходованиеНоменклатурыТовары.Ссылка.Дата >= &Дата
	|	И ОприходованиеНоменклатурыТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеСредствЗащитыНаХраненииТовары.Ссылка,
	|	ПеремещениеСредствЗащитыНаХраненииТовары.Номенклатура,
	|	ПеремещениеСредствЗащитыНаХраненииТовары.Цена
	|ИЗ
	|	Документ.ПеремещениеСредствЗащитыНаХранении.Товары КАК ПеремещениеСредствЗащитыНаХраненииТовары
	|ГДЕ
	|	ПеремещениеСредствЗащитыНаХраненииТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ПеремещениеСредствЗащитыНаХраненииТовары.Ссылка.Дата >= &Дата
	|	И ПеремещениеСредствЗащитыНаХраненииТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемСредствЗащитыНаХранениеТовары.Ссылка,
	|	ПриемСредствЗащитыНаХранениеТовары.Номенклатура,
	|	ПриемСредствЗащитыНаХранениеТовары.Цена
	|ИЗ
	|	Документ.ПриемСредствЗащитыНаХранение.Товары КАК ПриемСредствЗащитыНаХранениеТовары
	|ГДЕ
	|	ПриемСредствЗащитыНаХранениеТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ПриемСредствЗащитыНаХранениеТовары.Ссылка.Дата >= &Дата
	|	И ПриемСредствЗащитыНаХранениеТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереходПраваСобственностиТовары.Ссылка,
	|	ПереходПраваСобственностиТовары.Номенклатура,
	|	ПереходПраваСобственностиТовары.Цена
	|ИЗ
	|	Документ.ПереходПраваСобственности.Товары КАК ПереходПраваСобственностиТовары
	|ГДЕ
	|	ПереходПраваСобственностиТовары.Номенклатура В(&МассивНоменклатуры)
	|	И ПереходПраваСобственностиТовары.Ссылка.Дата >= &Дата
	|	И ПереходПраваСобственностиТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредварительныйПереходПраваСобственностиТовары.Ссылка,
	|	ПредварительныйПереходПраваСобственностиТовары.Номенклатура,
	|	ПредварительныйПереходПраваСобственностиТовары.Цена
	|ИЗ
	|	Документ.ПредварительныйПереходПраваСобственности.Товары КАК ПредварительныйПереходПраваСобственностиТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыДляПересчета.Ссылка КАК Ссылка,
	|	ВТ_ДокументыДляПересчета.Номенклатура КАК Номенклатура,
	|	ВТ_Цены.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Цены КАК ВТ_Цены
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыДляПересчета КАК ВТ_ДокументыДляПересчета
	|		ПО ВТ_Цены.Номенклатура = ВТ_ДокументыДляПересчета.Номенклатура
	|			И ВТ_Цены.Цена <> ВТ_ДокументыДляПересчета.Цена
	|			И (ВЫБОР
	|				КОГДА ВТ_Цены.ДатаСледующейЦены = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_Цены.ДатаСледующейЦены > ВТ_ДокументыДляПересчета.Ссылка.Дата
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ ВТ_ДокументыДляПересчета.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Ссылка КАК Ссылка,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.Цена КАК Цена
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("ТаблицаЦен",			ТаблицаЦен);
	Запрос.УстановитьПараметр("МассивНоменклатуры",	ТекущийОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Дата",				ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаДокументов 	= Результат[3].Выгрузить();
	ТаблицаЦен			= Результат[4].Выгрузить();
	
	Для Каждого СтрокаТаблицыДокументов Из ТаблицаДокументов Цикл
		
		ДокументОбъект = СтрокаТаблицыДокументов.Ссылка.ПолучитьОбъект();
		
		ДокументПересчитан = Ложь;
		
		СтруктураПоискаДокумента = Новый Структура("Ссылка",СтрокаТаблицыДокументов.Ссылка);
		
		НайденныеСтрокиЦен = ТаблицаЦен.НайтиСтроки(СтруктураПоискаДокумента);
		
		Для Каждого НайденнаяСтрокаЦен Из НайденныеСтрокиЦен Цикл
			
			Если НЕ НайденнаяСтрокаЦен.Номенклатура.Поставщик = ТекущийОбъект.Поставщик Тогда
			    Продолжить;
			КонецЕсли;	
			
			СтруктураПоиска = Новый Структура("Номенклатура",НайденнаяСтрокаЦен.Номенклатура);
			
			НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				НайденнаяСтрока.Цена 	= НайденнаяСтрокаЦен.Цена;
				НайденнаяСтрока.Сумма 	= НайденнаяСтрокаЦен.Цена * НайденнаяСтрока.Количество;
				
				ДокументПересчитан = Истина;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если ДокументПересчитан Тогда
			ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
			
	КонецЦикла;		
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Пересчет закончен.";
	Сообщение.Сообщить();
	
КонецПроцедуры	

#КонецЕсли