//Andrey_NSK***********************************************************************

// Функция получает значения реквизитов выбранного контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//  Структура - реквизиты выбранного контрагента
//
Функция РеквизитыПоставщика(Поставщик) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Поставщики.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Поставщики.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
	|	Поставщики.ИНН КАК ИНН,
	|	Поставщики.КПП КАК КПП
	|ИЗ
	|	Справочник.Контрагенты КАК Поставщики
	|ГДЕ
	|	Поставщики.Ссылка = &Поставщик
	|");
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление	= ?(Не ПустаяСтрока(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование);
		Наименование	= ?(Не ПустаяСтрока(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование);
		ИНН				= Выборка.ИНН;
		КПП				= Выборка.КПП;
	Иначе
		Представление	= "";
		Наименование	= "";
		ИНН				= "";
		КПП				= "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Представление, Наименование, ИНН, КПП",
		Представление,
		Наименование,
		ИНН,
		КПП
	);
	
	Возврат СтруктураРеквизитов;

КонецФункции 

//Andrey_NSK***********************************************************************
// {ЮМадатов (28.07.21): <#102611 >
Функция ПоставщикПоИНН(ИНН) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат  ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;

КонецФункции
// } ЮМадатов (28.07.21): <#102611 >
