////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается из переопределяемого модуля
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Истина;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Анкета", 				 		 		 "Дата", "Анкетирование", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратИзЧистки", 				 		 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратНоменклатурыПоставщику", 			 "Дата", "ВозвратПоставщику", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратСредствЗащитыОтСотрудника", 		 "Дата", "Списание",				"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратСредствЗащитыСХранения", 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаДежурныхСредствЗащиты", 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаСредствЗащитыСотруднику", 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаСредствЗащитыПоВедомости",			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", 						 "Дата", "ЗаказПоставщику", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеЗаказовПоставщику", 				 "Дата", "ЗаказПоставщику", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаписьНаСклад", 			 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗачетВыданныхСредствЗащиты", 			 "Дата", "Нормы", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗачетУпрощеннойВыдачи", 				 	 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаВыдачу", 			 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ", 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияНоменклатуры", 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнструктажСотрудников", 			 		 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КадровоеПеремещение", 					 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КомплектацияНоменклатуры", 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаРегистров", 				 "Дата", "Корректировка", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НазначениеОпросов", 				 		 "Дата", "Анкетирование", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОбменСредствЗащитыСотрудника", 			 "Дата", "Обмен", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОбращениеНаСклад", 			 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеНоменклатуры", 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтсутствиеНаРабочемМесте", 				 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаВЧистку", 				 		 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаСИЗвУтилизацию", 				 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеНоменклатуры", 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеСредствЗащитыНаХранении", 	 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереносЗимнейПотребности",	 			 "Дата", "Зима", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереходПраваСобственности", 				 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеНоменклатуры", 				 "Дата", "Поступление", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемНаРаботу", 					 		 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемСредствЗащитыНаХранение", 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказПоНормамВыдачиСИЗ", 				 "Дата", "Приказ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПродлениеСрокаЭксплуатации", 		 	 "Дата", "ОбеспечениеСотрудников",	"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СогласиеНаИнформирование", 		 		 "Дата", "СогласиеНаИнформирование","");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СообщениеSMS", 		 	 				 "Дата", "Администрирование",		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеНоменклатуры", 					 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеСредствЗащитыСотрудника", 		 "Дата", "Списание",				"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ТранспортнаяПоставка", 		 			 "Дата", "Склад",					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Уведомление", 							 "Дата", "Администрирование", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Увольнение", 							 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаСоответствийНоменклатурыВыдачи", "Дата", "СоответствиеНоменклатуры","");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаУсловийРаботыСотрудника", 		 "Дата", "УсловияРаботыСотрудника", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаПериодаЗимы", 		 			 "Дата", "Зима", 					"");
	//АсТБ_Alexey_71263_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаМВЗДолжностей", 		 		 "Дата", "МВЗ", 					"");
	//АсТБ_Alexey_71263_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаМВЗПодразделений", 		 		 "Дата", "МВЗ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаОсновногоМестаРаботыСотрудника", "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаФККОНоменклатуры", 				 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаШтрихкодовНоменклатуры", 		 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЦеновоеСоглашение", 						 "Дата", "Цены", 					"");
	//АсТБ_Alexey_72252_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыполненныеРаботыПоРемонту",		 		 "Дата", "Обслуживание", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РемонтСредствЗащиты", 			 		 "Дата", "Обслуживание", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЦеновоеСоглашениеПоРемонту", 			 "Дата", "Обслуживание", 			"");
	//АсТБ_Alexey_72252_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МедицинскийОсмотр",		 	 			 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НаправлениеНаМедицинскийОсмотр",		 	 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеИнструктажей", 		 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПроверкаЗнанийСотрудника", 				 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеПроверкиЗнаний", 		 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеМедицинскихОсмотров", 	 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СпециальнаяОценкаРабочихМест", 		 	 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЭлектронноеПисьмоИсходящее", 		 	 "Дата", "Администрирование",		"");
	//+++АСТБ_Горюшин_Алексей_17125
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПредварительныйПереходПраваСобственности","Дата", "Выдача", 					"");
	//---АСТБ_Горюшин_Алексей_17125
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, УзелПланаОбмена, СообщитьОЗапрете) Экспорт
	
	
КонецПроцедуры