
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Сотрудник <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Параметры.ИмяРегистраНакопления) Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма[Параметры.ИмяРегистраНакопления],"Сотрудник",Параметры.Сотрудник,Истина);
			ЭтаФорма.Элементы[Параметры.ИмяРегистраНакопления].Видимость = Истина;
			ЭтаФорма.Элементы["ГруппаКоманднаяПанель" + Параметры.ИмяРегистраНакопления].Видимость = Истина;
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по сотруднику (" + Метаданные.РегистрыНакопления[Параметры.ИмяРегистраНакопления].Синоним + ")";
			
			//Если Параметры.ИмяРегистраНакопления = "ВыдачаПоПотребности" ИЛИ Параметры.ИмяРегистраНакопления = "ПотребностьВыдачиСИЗ" Тогда
			//	
			//	Если Параметры.Сотрудник.Владелец.ИспользоватьПроцентИзноса Тогда
			//		ЭтаФорма.Элементы[Параметры.ИмяРегистраНакопления].ПодчиненныеЭлементы[Параметры.ИмяРегистраНакопления + "ПроцентИзноса"].Видимость = Истина;
			//	Иначе
			//		ЭтаФорма.Элементы[Параметры.ИмяРегистраНакопления].ПодчиненныеЭлементы[Параметры.ИмяРегистраНакопления + "ПроцентИзноса"].Видимость = Ложь;
			//	КонецЕсли;
			//	
			//КонецЕсли;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма[Параметры.ИмяРегистраСведений],"Сотрудник",Параметры.Сотрудник,Истина);
			ЭтаФорма.Элементы[Параметры.ИмяРегистраСведений].Видимость = Истина;
			ЭтаФорма.Элементы["ГруппаКоманднаяПанель" + Параметры.ИмяРегистраСведений].Видимость = Истина;
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по сотруднику (" + Метаданные.РегистрыСведений[Параметры.ИмяРегистраСведений].Синоним + ")";
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры