//АСТБ_Овсянников --------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////
// Выполнение регламентных заданий

// Загружает кадровые данные из одного файла
//
Процедура ЗагрузитьКадровыеДанные(ФайлДанных) Экспорт
	Перем ПротоколЗагрузки;
	
	ПротоколЗагрузки = "";
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru = 'Кадры.Загрузка кадровых данных'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,	,  ,
								"Начата регламентная загрузка кадровых данных из файла ("+СокрЛП(ФайлДанных)+" )"); //запись заголовка загрузки файла в журнал пока оставляю
	
	ТекущаяДата = ТекущаяДатаСеанса();
	СостояниеЗагрузки = Неопределено;
	ПриЗагрузкеВозниклиОшибки = Неопределено;
	
	ПротоколЗагрузки = ПротоколЗагрузки + СокрЛП(ТекущаяДата()) + Символы.ПС + "Файл: "+СокрЛП(ФайлДанных)+ Символы.ПС;
	
	ОбработкаЗагрузки = Обработки.ЗагрузкаКадровойИнформации.Создать();
	ОбработкаЗагрузки.ИзменятьКодСинхронизацииМВЗ = ИСТИНА;
	ОбработкаЗагрузки.ФайлДанных = ФайлДанных;
	ПротоколЗагрузки = ПротоколЗагрузки + ОбработкаЗагрузки.АвтозапускЗагрузкиКадровыхДанныхПоРасписанию();                         
	ПротоколЗагрузки = ПротоколЗагрузки + "Загрузка из файла ("+СокрЛП(ФайлДанных)+" ) завершена." + Символы.ПС 
	+ "--------------------------------------------------------------------------------------------------------" + Символы.ПС;   
	//ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,	,  , ПротоколЗагрузки);
	//АдресаРассылки =  ПолучитьАдресаРассылки();
	Письмо = ПодготовитьПараметрыПисьма(ПротоколЗагрузки);
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Письмо.УчетнаяЗапись, Письмо.ПараметрыПисьма);
		
КонецПроцедуры

Функция ПолучитьКаталогАрхива(РабочийКаталог)
	
	ИмяКаталога = РабочийКаталог + "Загружено\";
	Создатькаталог(ИмяКаталога);
	Возврат ИмяКаталога;
	
КонецФункции	

Процедура ЗагрузкаКадровыхДанныхИзКаталогаОбмена() Экспорт
	
	//АСТБ_ALEX_**************************************************************	
	Если ОбщегоНазначенияПереопределяемый.ЭтоКопияБД(Метаданные.РегламентныеЗадания.РегламентнаяЗагрузкаКадровыхДанных,"Регламентная загрузка кадровых данных отменена, т.к. база данных является копией.") = Истина Тогда
		Возврат;
	КонецЕсли;
	//АСТБ_ALEX_**************************************************************
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	ИмяСобытия = НСтр("ru = 'Кадры.Загрузка кадровых данных'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	ПапкиЗагрузки = Новый СписокЗначений;
	КаталогЗагрузки = "";
	
	ВидЗагрузки = Справочники.ПапкиФайлов.ЗагрузкаКадровыхДанных;  //может слететь при обновлении БСП!
	КаталогЗагрузки = РаботаСФайламиСлужебныйВызовСервера.РабочийКаталогПапки(ВидЗагрузки);
	Если  ЗначениеЗаполнено(КаталогЗагрузки) Тогда
		ПапкиЗагрузки.Добавить(КаталогЗагрузки);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПапкиФайлов.Ссылка
		|ИЗ
		|	Справочник.ПапкиФайлов КАК ПапкиФайлов
		|ГДЕ
		|	ПапкиФайлов.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", ВидЗагрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КаталогЗагрузки = РаботаСФайламиСлужебныйВызовСервера.РабочийКаталогПапки(ВыборкаДетальныеЗаписи.Ссылка);
		Если ЗначениеЗаполнено(КаталогЗагрузки) Тогда
			Если ПапкиЗагрузки.НайтиПоЗначению(КаталогЗагрузки) = Неопределено Тогда
				ПапкиЗагрузки.Добавить(КаталогЗагрузки);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
		
	//КаталогЗагрузки = Константы.КаталогЗагрузкиКадровыхДанных.Получить();
	
	Если ПапкиЗагрузки.Количество() = 0 Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
        "Не настроены каталог загрузки. Загрузка невозможна!");
		Возврат;
	КонецЕсли;	
	
	ПолныйМассивФайлов = Новый Массив;
	Для каждого Папка Из ПапкиЗагрузки Цикл
	    МассивФайлов = НайтиФайлы(Папка, "*.xml", Ложь); //- не включая подчиненные
        Для каждого Эл Из МассивФайлов Цикл
		   ПолныйМассивФайлов.Добавить(Эл);
		КонецЦикла; 
	КонецЦикла; 
	
	Если ПолныйМассивФайлов.Количество()=0 Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, "Нет файлов для загрузки.");
		Возврат;
	Иначе	
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, СокрЛП(ПолныйМассивФайлов.Количество())+ " файлов для загрузки.");
	КонецЕсли;
			
	Для каждого ФайлД Из ПолныйМассивФайлов Цикл
	    ЗагрузитьКадровыеДанные(ФайлД.ПолноеИмя);
		НовоеИмяФайла = ПолучитьКаталогАрхива(ФайлД.Путь) + ФайлД.Имя;
		ПереместитьФайл(ФайлД.ПолноеИмя, НовоеИмяФайла);
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

//Работа с почтой
Функция ПодготовитьПараметрыПисьма(Протокол)
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", "Протокол загрузки кадровых данных");
	ПараметрыПисьма.Вставить("Тело", Протокол);
	ПараметрыПисьма.Вставить("Кому", ПолучитьАдресаРассылки());
	Результат = Новый Структура;
	Результат.Вставить("УчетнаяЗапись", РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись());
	Результат.Вставить("ПараметрыПисьма", ПараметрыПисьма);
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАдресаРассылки()
	Перем Рез;
	
  // Возврат "ovsyannikov@vostok.ru";   //для тестирования
	Рез = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдресаПолучателейПочтовыхРассылок.Рассылка,
		|	АдресаПолучателейПочтовыхРассылок.Пользователь КАК Пользователь,
		|	АдресаПолучателейПочтовыхРассылок.ПочтовыйАдрес
		|ИЗ
		|	РегистрСведений.АдресаПолучателейПочтовыхРассылок КАК АдресаПолучателейПочтовыхРассылок
		|ГДЕ
		|	АдресаПолучателейПочтовыхРассылок.Рассылка = &Рассылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Рассылка", Справочники.ПочтовыеРассылки.ЗагрузкаКадровыхДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	    Рез = Рез + СокрЛП(ВыборкаДетальныеЗаписи.ПочтовыйАдрес)+"; ";
	КонецЦикла;
	
	Рез = Лев(Рез, СтрДлина(Рез)-2);
	
	Возврат Рез;
КонецФункции	