////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "ПЕЧАТЬ"

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
  УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список);
  
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#Область АдресноеХранение

&НаКлиенте
Процедура АХ_ПередачаТранспортнойПоставки(Команда)
	
	ПараметрыФормы = Новый Структура("МассивПоступлений", Элементы.Список.ВыделенныеСтроки);
	ОткрытьФорму("Обработка.АХ_КомплекснаяОбработкаДанных.Форма.ФормаПередачиТранспортнойПоставки", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

//+++АСТБ_Горюшин_Алексей_47891
&НаКлиенте
Процедура КомандаСинхронизацияДанныхСАП(Команда)
	Интеграция_САП_Сервер.СинхронизацияДанныхСАП_Ручная();
	Элементы.Список.Обновить();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_47891
