
&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию()
	
	Если Запись.Источник = ПредопределенноеЗначение("Перечисление.ИсточникиДляПроверкиКодовМаркировки.SAPВостокСервис") Тогда
		
		Запись.Адрес = "http://af3i4.vostok.service:8000/sap/bc/srt/wsdl/bndg_D1383D5E713EE47BE1000000C0A80AE4/wsdl11/service/standard/rpc?sap-client=300";
		
	ИначеЕсли  Запись.Источник = ПредопределенноеЗначение("Перечисление.ИсточникиДляПроверкиКодовМаркировки.ЕИСФ") Тогда
		
		Запись.Адрес = "astb.vostok.ru/serial_num_base/hs/KM_OUT";
		
	Иначе
		
		Запись.Адрес = "";
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	СообщениеПользователю = Новый СообщениеПользователю;
	
	Если Запись.Источник = ПредопределенноеЗначение("Перечисление.ИсточникиДляПроверкиКодовМаркировки.SAPВостокСервис") Тогда
		
		ПараметрыСервиса = Новый Структура("Адрес,Пользователь,Пароль", Запись.Адрес, Запись.Пользователь, Запись.Пароль);
		ОписаниеОшибки = "";
		ПолучитьПроксиНаСервере(ОписаниеОшибки,ПараметрыСервиса);
		
		Если ОписаниеОшибки = "" Тогда
			СообщениеПользователю.Текст = "Подключение выполнено.";
		Иначе
			СообщениеПользователю.Текст = ОписаниеОшибки;
		КонецЕсли;
		
	Иначе
		
		HTTPСоединение = Новый HTTPСоединение(Запись.Адрес,,Запись.Пользователь,Запись.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),Ложь);
		
		МассивДляЗапроса = Новый Массив;
		МассивДляЗапроса.Добавить(Новый Структура("КодМаркировки","123"));
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,МассивДляЗапроса);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Запрос = Новый HTTPЗапрос;
		Запрос.АдресРесурса = "/Enable_KM";
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8);
		
		ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(Запрос);
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
			
			СообщениеПользователю.Текст = "Подключение выполнено.";
			
		Иначе
			
			СообщениеПользователю.Текст = "Ошибка подключения к HTTP-сервису!";
			
		КонецЕсли;
		
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПроверитьПодключениеНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПроксиНаСервере(ОписаниеОшибки,ПараметрыСервиса)
	
	Прокcи = ПроцедурыРаботыСНормамиСервер.ПолучитьWSПроксиДляПроверкиКодаМаркировки(ОписаниеОшибки,ПараметрыСервиса);
	
КонецПроцедуры
