#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция КонтрагентыДляУчетаЧисткиСИЗ(Организация) Экспорт 
	
	//***НСК Трегубов А.А.*** -- № 129093 Доработка чистки (контрагенты по молчанию) --  18.10.2021 <<<
	
	СтруктураКонтрагентов = Новый Структура;
	СтруктураКонтрагентов.Вставить("ПередачаКонтрагентОтравитель",Справочники.Контрагенты.ПустаяСсылка());
	СтруктураКонтрагентов.Вставить("ПередачаКонтрагентПолучатель",Справочники.Контрагенты.ПустаяСсылка());
	СтруктураКонтрагентов.Вставить("ВозвратКонтрагентОтравитель", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураКонтрагентов.Вставить("ВозвратКонтрагентПолучатель", Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеКонтрагентовДляУчетаЧистки.ПередачаКонтрагентОтравитель КАК ПередачаКонтрагентОтравитель,
	|	СоответствиеКонтрагентовДляУчетаЧистки.ПередачаКонтрагентПолучатель КАК ПередачаКонтрагентПолучатель,
	|	СоответствиеКонтрагентовДляУчетаЧистки.ВозвратКонтрагентОтравитель КАК ВозвратКонтрагентОтравитель,
	|	СоответствиеКонтрагентовДляУчетаЧистки.ВозвратКонтрагентПолучатель КАК ВозвратКонтрагентПолучатель
	|ИЗ
	|	РегистрСведений.СоответствиеКонтрагентовДляУчетаЧистки КАК СоответствиеКонтрагентовДляУчетаЧистки
	|ГДЕ
	|	СоответствиеКонтрагентовДляУчетаЧистки.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаРезультат = РезультатЗапроса.Выбрать();
	
	Если ВыборкаРезультат.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураКонтрагентов,ВыборкаРезультат);
	КонецЕсли;
	
	Возврат СтруктураКонтрагентов;
	
КонецФункции // КонтрагентыДляУчетаЧисткиСИЗ()


#КонецЕсли