#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//АсТБ_Alexey_********************************************************************
	ДанныеВыбора = Новый СписокЗначений;
	
	ДоступныеТипыОборудования = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьДоступныеТипыОборудования();
	
	ДанныеВыбора.ЗагрузитьЗначения(ДоступныеТипыОборудования);
	СтандартнаяОбработка = Ложь;
	//АсТБ_Alexey_********************************************************************
КонецПроцедуры

#КонецОбласти