
&НаСервереБезКонтекста
Процедура АдресатПриИзмененииНаСервере(Адресат, ЕстьАдресЭП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Адресат
	|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И НЕ ФизическиеЛицаКонтактнаяИнформация.АдресЭП = """"";
	
	Запрос.УстановитьПараметр("Адресат",Адресат);
	
	Результат = Запрос.Выполнить();
	
	ЕстьАдресЭП = НЕ Результат.Пустой();	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатПриИзменении(Элемент)
	
	ЕстьАдресЭП = Ложь;
	
	АдресатПриИзмененииНаСервере(Запись.Адресат, ЕстьАдресЭП);
	
	Если ЕстьАдресЭП Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "ru = ""У выбранного адресата не задан адрес электронной почты. Продолжить?"";";
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение,НСтр(Текст),РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
    КонецЕсли;
	
	Запись.Адресат = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	
КонецПроцедуры