
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов",
		"ВыданныеСИЗСотруднику",
		Новый Структура("Сотрудник", ПараметрКоманды),
		Истина,
		Ложь);    		
		
	ОткрытьФорму(
		"Отчет.ВыданныеСИЗСотруднику.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно); 
		
				
КонецПроцедуры

