
&НаКлиенте
Процедура ПолучателиПолучательПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.Элементы.Получатели.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Получатель) Тогда
		ТекущиеДанные.АдресЭП = ПолучитьАдресЭППолучателя(ТекущиеДанные.Получатель);
	Иначе
		ТекущиеДанные.АдресЭП = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресЭППолучателя(ТекущийПользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользователиКонтактнаяИнформация.АдресЭП
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Вид = &ВидКонтактнойИнформации
	|	И ПользователиКонтактнаяИнформация.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("ВидКонтактнойИнформации", 	Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("Пользователь", 				ТекущийПользователь);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	МассивАдресов = Результат.Выгрузить().ВыгрузитьКолонку("АдресЭП");
	
	Возврат СтрСоединить(МассивАдресов,"; ");
	
КонецФункции
