#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда

	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм, 
	//		"Накладная",
	//		"Приходная накладная",
	//		СформироватьПечатнуюФормуПриходнаяНакладная(МассивОбъектов, ОбъектыПечати),,"Документ.ПоступлениеНоменклатуры.ПФ_MXL_ПриходнаяНакладная");
	//			
	//КонецЕсли;	
	
КонецПроцедуры

//Функция СформироватьПечатнуюФормуПриходнаяНакладная(МассивОбъектов, ОбъектыПечати)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.АвтоМасштаб = Истина;
//	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеНоменклатуры_ПриходнаяНакладная";
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	Документы.Ссылка КАК Ссылка,
//	|	Документы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
//	|	Документы.Номер КАК Номер,
//	|	Документы.Дата КАК Дата,
//	|	Документы.Склад.Наименование КАК ПредставлениеСклада,
//	|	Документы.Организация.Префикс КАК Префикс,
//	|	Документы.Поставщик.НаименованиеПолное КАК ПредставлениеПоставщика
//	|ИЗ
//	|	Документ.ПоступлениеНоменклатуры КАК Документы
//	|ГДЕ
//	|	Документы.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	Товары.Ссылка КАК Ссылка,
//	|	Товары.Количество КАК Количество,
//	|	Товары.Цена КАК Цена,
//	|	Товары.Сумма КАК Сумма,
//	|	ВЫБОР
//	|		КОГДА Товары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|			ТОГДА Товары.Номенклатура.Наименование
//	|		ИНАЧЕ Товары.Номенклатура.Наименование + "" ("" + Товары.ХарактеристикаНоменклатуры.Наименование + "")""
//	|	КОНЕЦ КАК НаименованиеТовара,
//	|	ВЫБОР
//	|		КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
//	|			ТОГДА Товары.Номенклатура.Артикул
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
//	|					ТОГДА Товары.Номенклатура.Код
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
//	|							ТОГДА Товары.Номенклатура.КодСинхронизации
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
//	|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
//	|								ИНАЧЕ """"
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ
//	|	КОНЕЦ КАК НоменклатурныйНомер,
//	|	Товары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
//	|	Товары.НомерСтроки
//	|ИЗ
//	|	Документ.ПоступлениеНоменклатуры.Товары КАК Товары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
//	|		ПО Товары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
//	|			И Товары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
//	|			И Товары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
//	|ГДЕ
//	|	Товары.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	Товары.НомерСтроки
//	|ИТОГИ ПО
//	|	Ссылка");
//	
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоступлениеНоменклатуры.ПФ_MXL_ПриходнаяНакладная");
//	
//	ПакетЗапросов = Запрос.ВыполнитьПакет();
//	ДанныеПечати = ПакетЗапросов[0].Выбрать();
//	ВыборкаПоДокументам = ПакетЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	ПервыйДокумент = Истина;
//	
//	Пока ДанныеПечати.Следующий() Цикл
//		
//		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		Если Не ПервыйДокумент Тогда
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		
//		ПервыйДокумент = Ложь;
//			
//		Область = Макет.ПолучитьОбласть("Шапка");
//		Область.Параметры.Заполнить(ДанныеПечати);
//		
//		Область.Параметры.ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Приходная накладная");
//		ТабличныйДокумент.Вывести(Область);
//			
//		СчетСтрок = 1;
//		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
//		Пока ВыборкаПоТоварам.Следующий() Цикл
//			
//			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
//			Область.Параметры.Заполнить(ВыборкаПоТоварам);
//			ТабличныйДокумент.Вывести(Область);
//			
//			СчетСтрок = СчетСтрок + 1;
//			
//		КонецЦикла;
//		
//		Область = Макет.ПолучитьОбласть("Подвал");
//		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
//		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
//		Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
//		ТабличныйДокумент.Вывести(Область);
//		
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
//		
//	КонецЦикла;
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//приходная накладная
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ТранспортнаяПоставка";
	//КомандаПечати.Идентификатор = "Накладная";
	//КомандаПечати.Представление = НСтр("ru = 'Приходная накладная'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

#КонецЕсли