//АСТБ_Горюшин_Алексей_24602

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 					= "Выбор файла";
	Диалог.Фильтр             			= НСтр("ru = 'Документ MS EXCEL (*.xls;*.xlsx)|*.xls;*.xlsx'");
	Диалог.МножественныйВыбор 			= Ложь;
	Диалог.ПроверятьСуществованиеФайла	= Истина;
	
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("Обработчик_Завершения_Загрузки", ЭтотОбъект, Диалог);
	НачатьПомещениеФайла(ОбработкаОкончанияЗагрузки, , Диалог, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Завершения_Загрузки(Результат, ДопПараметры, Пар1, Пар2) Экспорт
	
	Если НЕ Результат Тогда
		Возврат
	КонецЕсли;	
	ПозицияРасширения = СтрНайти(Пар1, ".", НаправлениеПоиска.СКонца);
	Объект.РасширениеФайла = Сред(Пар1, ПозицияРасширения+1, СтрДлина(Пар1)-ПозицияРасширения+1);
	Объект.Файл = Пар1;
	Объект.ВременноеХранилище = ДопПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	Если Объект.Сотрудники.Количество() > 0 Тогда
		Текст = "ru = ""Табличная часть будет очищена! Продолжить выполнение операции?"";";
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение,НСтр(Текст),РежимДиалогаВопрос.ДаНет);
	Иначе	
		Состояние("Выполняется чтение файла...");
		ПрочитатьФайлНаСервере(Объект.ВременноеХранилище);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Объект.Сотрудники.Очистить();
	Состояние("Выполняется чтение файла...");
	ПрочитатьФайлНаСервере(Объект.ВременноеХранилище);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(Адрес)
	
	Если Не ЗначениеЗаполнено(Объект.Файл) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран файл!";
		Сообщение.Поле = "Файл";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана организация!";
		Сообщение.Поле = "Организация";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Объект.ФайлПрочитан = Ложь;
	
	Попытка    
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Объект.РасширениеФайла);
		ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ФайлEXCELНаСервере);
		УдалитьФайлы(ФайлEXCELНаСервере);
		ОбластьТаблицы = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);  
		ПостроительЗапроса.Выполнить();
		ТаблицаДанных = ПостроительЗапроса.Результат.Выгрузить();
		
		Объект.ФайлПрочитан = Истина;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Объект.ФайлПрочитан = Ложь;
	КонецПопытки;	
	
	Если НЕ Объект.ФайлПрочитан Тогда
		Возврат;
	КонецЕсли;
	
	//+++АСТБ_Горюшин_Алексей_59691
	Если Объект.ОсобыеНастройки = "2" Тогда
		ЗаполнитьТЧСотрудники_МВЗ_БезГП(ТаблицаДанных);
		ВыполнитьАнализДанных_МВЗ_БезГП();
	Иначе	
	//---АСТБ_Горюшин_Алексей_59691
	ЗаполнитьТЧСотрудники(ТаблицаДанных);
	ВыполнитьАнализДанных();	
	//+++АСТБ_Горюшин_Алексей_59691
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_59691
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧСотрудники(ТаблицаДанных)
	
	ОтсутсвующиеКолонки = "";
	
	Если ТаблицаДанных.Колонки.Найти("_ТабельныйНомерСотрудника") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Табельный номер сотрудника" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииФиз_лица") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации Физ.лица" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("ФИОСотрудника") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: ФИО сотрудника" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииПодразделения") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации подразделения" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииПодразделения_родителя") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации подразделения-родителя" + Символы.ПС; 
	КонецЕсли;	
	
	Если ТаблицаДанных.Колонки.Найти("НаименованиеПодразделения") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование подразделения" + Символы.ПС; 
	КонецЕсли;	
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииДолжности") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации должности" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("НаименованиеДолжности") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование должности" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КоличествоСтавок") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Количество ставок" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииРабочегоМеста") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации рабочего места" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("НаименованиеРабочегоМеста") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование рабочего места" + Символы.ПС;
	КонецЕсли;
	
	//+++АСТБ_Горюшин_Алексей_49466
	Если Объект.ОсобыеНастройки = "1" И ТаблицаДанных.Колонки.Найти("НаименованиеМВЗ") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование МВЗ" + Символы.ПС;
	КонецЕсли;
	
	Если Объект.ОсобыеНастройки = "1" И ТаблицаДанных.Колонки.Найти("КодСинхронизацииМВЗ") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации МВЗ" + Символы.ПС;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_49466
	
	Если ЗначениеЗаполнено(ОтсутсвующиеКолонки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОтсутсвующиеКолонки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		
		Если НЕ (ЗначениеЗаполнено(Строка._ТабельныйНомерСотрудника)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииФиз_лица)
			ИЛИ ЗначениеЗаполнено(Строка.ФИОСотрудника)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииПодразделения)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииПодразделения_родителя)
			ИЛИ ЗначениеЗаполнено(Строка.НаименованиеПодразделения)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииДолжности)
			ИЛИ ЗначениеЗаполнено(Строка.НаименованиеДолжности)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииРабочегоМеста)
			ИЛИ ЗначениеЗаполнено(Строка.НаименованиеРабочегоМеста)
			ИЛИ ЗначениеЗаполнено(Строка.КоличествоСтавок))
			Тогда
		    Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Сотрудники.Добавить();
		НоваяСтрока.ФИОСотрудникаИзФайла                         = СокрЛП(Строка.ФИОСотрудника);
		НоваяСтрока.ТабельныйНомерСотрудникаИзФайла              = СокрЛП(Строка._ТабельныйНомерСотрудника);
		НоваяСтрока.КодСинхронизацииФизлицаИзФайла               = СокрЛП(Строка.КодСинхронизацииФиз_лица);
		НоваяСтрока.ЕстьКодСинхронизацииФизлицаИзФайла           = НЕ ПустаяСтрока(СокрЛП(НоваяСтрока.КодСинхронизацииФизлицаИзФайла));    
		НоваяСтрока.НаименованиеПодразделенияИзФайла             = СокрЛП(Строка.НаименованиеПодразделения);
		НоваяСтрока.КодСинхронизацииПодразделенияИзФайла         = СокрЛП(Строка.КодСинхронизацииПодразделения);
		НоваяСтрока.КодСинхронизацииПодразделенияРодителяИзФайла = СокрЛП(Строка.КодСинхронизацииПодразделения_родителя);
		НоваяСтрока.НаименованиеДолжностиИзФайла                 = СокрЛП(Строка.НаименованиеДолжности);
		НоваяСтрока.КодСинхронизацииДолжностиИзФайла             = СокрЛП(Строка.КодСинхронизацииДолжности);
		НоваяСтрока.ЕстьКодСинхронизацииДолжностиИзФайла         = НЕ ПустаяСтрока(СокрЛП(Строка.КодСинхронизацииДолжности));
		НоваяСтрока.НовоеКоличествоСтавок                        = СокрЛП(Строка.КоличествоСтавок);
		НоваяСтрока.НаименованиеРабочегоМестаИзФайла             = СокрЛП(Строка.НаименованиеРабочегоМеста);
		НоваяСтрока.КодСинхронизацииРабочегоМестаИзФайла         = СокрЛП(Строка.КодСинхронизацииРабочегоМеста);
		НоваяСтрока.ЕстьКодСинхронизацииРабочегоМестаИзФайла     = НЕ ПустаяСтрока(СокрЛП(Строка.КодСинхронизацииРабочегоМеста));
		//+++АСТБ_Горюшин_Алексей_49466
		Если Объект.ОсобыеНастройки = "1" Тогда
			НоваяСтрока.НаименованиеМВЗСотрудникаИзФайла		 = СокрЛП(Строка.НаименованиеМВЗ);
			НоваяСтрока.КодСинхронизацииМВЗСотрудникаИзФайла	 = СокрЛП(Строка.КодСинхронизацииМВЗ);
			НоваяСтрока.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла = НЕ ПустаяСтрока(СокрЛП(Строка.КодСинхронизацииМВЗ));
		КонецЕсли;
		//---АСТБ_Горюшин_Алексей_49466
		
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Строка.ФИОСотрудника), " ", Истина);
		Счетчик = 0;
		Для Каждого Подстрока Из ФИО Цикл
			Если Счетчик = 0 Тогда
				НоваяСтрока.ФамилияСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик = 1 Тогда
				НоваяСтрока.ИмяСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик = 2 Тогда
				НоваяСтрока.ОтчествоСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик > 2 Тогда
				НоваяСтрока.ОтчествоСотрудникаИзФайла = НоваяСтрока.ОтчествоСотрудникаИзФайла + " " + Подстрока;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;			
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАнализДанных()
	
	ТаблицаСотрудники = Объект.Сотрудники.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	//+++АСТБ_Горюшин_Алексей_49466
	|	ВЫБОР
	|		КОГДА &ОсобыеНастройки = ""1""
	|       	ТОГДА ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла
	|       ИНАЧЕ """"
	|  	КОНЕЦ КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВЫБОР
	|		КОГДА &ОсобыеНастройки = ""1""
	|       	ТОГДА ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла
	|       ИНАЧЕ """"
	|  	КОНЕЦ КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВЫБОР
	|		КОГДА &ОсобыеНастройки = ""1""
	|       	ТОГДА ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла
	|       ИНАЧЕ ЛОЖЬ
	|  	КОНЕЦ КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	//---АСТБ_Горюшин_Алексей_49466
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	//+++АСТБ_Горюшин_Алексей_48019_2
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Исходная
	//было
	//|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	//---АСТБ_Горюшин_Алексей_48019_2
	|ИЗ
	|	&ТаблицаСотрудники КАК ТаблицаСотрудники
	|;
	//+++АСТБ_Горюшин_Алексей_48019_2
	// Старый алгорит для строк с сотрудниками
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Исходная КАК ТаблицаСотрудники
	|ГДЕ
	|   НЕ (ТаблицаСотрудники.ФИОСотрудникаИзФайла = """"
	|   И ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = """")
	|;
	//---АСТБ_Горюшин_Алексей_48019_2
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	Сотрудники.ФизическоеЛицо КАК ФизлицоИзСотрудника
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ВЫБОР
	|				КОГДА &ИзменятьФИО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = Сотрудники.Наименование
	|			КОНЕЦ)
	//+++АСТБ_Горюшин_Алексей_32185
	|		И (ВЫБОР
	|				КОГДА &ИзменятьТабельныйНомер
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = Сотрудники.ТабельныйНомер
	|			КОНЕЦ)
	//было
	//|			И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = Сотрудники.ТабельныйНомер
	//---АСТБ_Горюшин_Алексей_32185
	|			И (Сотрудники.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК Физлицо,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла
	|ПОМЕСТИТЬ ВТ_Физлица
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	//+++АСТБ_ALEXEY_102006_**************************************************************
	//|		ПО (ВЫБОР
	//|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла
	//|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо.КодСинхронизации   
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ)
	|		ПО (ВЫБОР
	|				КОГДА &УчитыватьФизическоеЛицо
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо.КодСинхронизации   
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	//---АСТБ_ALEXEY_102006_**************************************************************
	|			И ВТ_ТаблицаСотрудники.ФамилияСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Фамилия
	|			И ВТ_ТаблицаСотрудники.ИмяСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Имя
	|			И ВТ_ТаблицаСотрудники.ОтчествоСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Отчество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделение,
	|	Подразделения.Родитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла
	|ПОМЕСТИТЬ ВТ_Подразделения
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = Подразделения.КодСинхронизации
	//+++АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = Подразделения.Наименование)
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла
	|ПОМЕСТИТЬ ВТ_ПодразделенияРодители
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = Подразделения.КодСинхронизации
	|			И (Подразделения.Владелец = &Организация)
	|;
	//+++АСТБ_Горюшин_Алексей_43970
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование КАК Наименование,
	|	МИНИМУМ(ШтатноеРасписаниеСрезПоследних.Должность) КАК Должность
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШтатноеРасписание.Должность КАК Должность,
	|	ВТ_ШтатноеРасписание.Должность.Наименование КАК Наименование,
	|	ВТ_ШтатноеРасписание.Должность.КодСинхронизации КАК КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ДолжностиИзШР
	|ИЗ
	|	ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолжностиИПрофессии.Наименование КАК Наименование,
	|	МИНИМУМ(ДолжностиИПрофессии.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОднаДолжность
	|ИЗ
	|	Справочник.ДолжностиИПрофессии КАК ДолжностиИПрофессии
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолжностиИПрофессии.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОднаДолжность.Ссылка КАК Должность,
	|	ВТ_ОднаДолжность.Наименование КАК Наименование,
	|	ВТ_ОднаДолжность.Ссылка.КодСинхронизации КАК КодСинхронизации
	|ПОМЕСТИТЬ ВТ_РеквизитыИзОднойДолжности
	|ИЗ
	|	ВТ_ОднаДолжность КАК ВТ_ОднаДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДолжностиИзШР.Должность КАК ШР_Должность,
	|	ВТ_ДолжностиИзШР.Наименование КАК ШР_Наименование,
	|	ВТ_ДолжностиИзШР.КодСинхронизации КАК ШР_КодСинхронизации,
	|	ВТ_РеквизитыИзОднойДолжности.Должность КАК СПР_Должность,
	|	ВТ_РеквизитыИзОднойДолжности.Наименование КАК СПР_Наименование,
	|	ВТ_РеквизитыИзОднойДолжности.КодСинхронизации КАК СПР_КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ОбъединенныеДолжности
	|ИЗ
	|	ВТ_РеквизитыИзОднойДолжности КАК ВТ_РеквизитыИзОднойДолжности
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДолжностиИзШР КАК ВТ_ДолжностиИзШР
	|		ПО (ВТ_ДолжностиИзШР.Должность = ВТ_РеквизитыИзОднойДолжности.Должность)
	|			И (ВТ_ДолжностиИзШР.Наименование = ВТ_РеквизитыИзОднойДолжности.Наименование)
	|			И (ВТ_ДолжностиИзШР.КодСинхронизации = ВТ_РеквизитыИзОднойДолжности.КодСинхронизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности.СПР_Должность
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности.ШР_Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности.СПР_Наименование
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности.ШР_Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности.СПР_КодСинхронизации
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности.ШР_КодСинхронизации
	|	КОНЕЦ КАК КодСинхронизации,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоДолжностьИзШР
	|ПОМЕСТИТЬ ВТ_ПодготовленныеДолжности
	|ИЗ
	|	ВТ_ОбъединенныеДолжности КАК ВТ_ОбъединенныеДолжности
	|;
	//+++АСТБ_Горюшин_Алексей_51080
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование КАК Наименование,
	|	ШтатноеРасписаниеСрезПоследних.Должность.КодСинхронизации КАК КодСинхронизации,
	|	МИНИМУМ(ШтатноеРасписаниеСрезПоследних.Должность) КАК Должность
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание_ЕстьКодСинхронизации
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование,
	|	ШтатноеРасписаниеСрезПоследних.Должность.КодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации.Должность КАК Должность,
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации.Должность.Наименование КАК Наименование,
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации.Должность.КодСинхронизации КАК КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ДолжностиИзШР_ЕстьКодСинхронизации
	|ИЗ
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации КАК ВТ_ШтатноеРасписание_ЕстьКодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолжностиИПрофессии.Наименование КАК Наименование,
	|	ДолжностиИПрофессии.КодСинхронизации КАК КодСинхронизации,
	|	МИНИМУМ(ДолжностиИПрофессии.Ссылка) КАК Должность
	|ПОМЕСТИТЬ ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации
	|ИЗ
	|	Справочник.ДолжностиИПрофессии КАК ДолжностиИПрофессии
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолжностиИПрофессии.КодСинхронизации,
	|	ДолжностиИПрофессии.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Должность КАК ШР_Должность,
	|	ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Наименование КАК ШР_Наименование,
	|	ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.КодСинхронизации КАК ШР_КодСинхронизации,
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Должность КАК СПР_Должность,
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Наименование КАК СПР_Наименование,
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.КодСинхронизации КАК СПР_КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации
	|ИЗ
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации КАК ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДолжностиИзШР_ЕстьКодСинхронизации КАК ВТ_ДолжностиИзШР_ЕстьКодСинхронизации
	|		ПО (ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Должность = ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Должность)
	|			И (ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Наименование = ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Наименование)
	|			И (ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.КодСинхронизации = ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.КодСинхронизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.СПР_Должность
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.СПР_Наименование
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.СПР_КодСинхронизации
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_КодСинхронизации
	|	КОНЕЦ КАК КодСинхронизации,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоДолжностьИзШР
	|ПОМЕСТИТЬ ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации
	|ИЗ
	|	ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации КАК ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|			ТОГДА ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.Должность
	|		ИНАЧЕ ВТ_ПодготовленныеДолжности.Должность
	|	КОНЕЦ КАК НоваяДолжность,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|			ТОГДА ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.ЭтоДолжностьИзШР
	|		ИНАЧЕ ВТ_ПодготовленныеДолжности.ЭтоДолжностьИзШР
	|	КОНЕЦ КАК ЭтоДолжностьИзШР,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	|ПОМЕСТИТЬ ВТ_Должности
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодготовленныеДолжности КАК ВТ_ПодготовленныеДолжности 
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	|		ПО ВЫБОР 
	|				КОГДА &ИскатьДолжностиТолькоПоКодуСинхронизации
	|			ТОГДА ЛОЖЬ
	|				ИНАЧЕ ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_ПодготовленныеДолжности.Наименование 
	|			КОНЕЦ           
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации КАК ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.КодСинхронизации 
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	|			И (&ИскатьДолжностиТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.Наименование)
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	|;
	//было
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ПодготовленныеДолжности.Должность КАК НоваяДолжность,
	//|	ВТ_ПодготовленныеДолжности.ЭтоДолжностьИзШР КАК ЭтоДолжностьИзШР,
	//|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	//|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	//|ПОМЕСТИТЬ ВТ_Должности
	//|ИЗ
	//|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодготовленныеДолжности КАК ВТ_ПодготовленныеДолжности
	//|		ПО (ВЫБОР
	//|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	//|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_ПодготовленныеДолжности.КодСинхронизации
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ)
	//|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_ПодготовленныеДолжности.Наименование
	//|;
	//---АСТБ_Горюшин_Алексей_51080
	//было
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Должности.Ссылка КАК НоваяДолжность,
	//|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	//|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	//|ПОМЕСТИТЬ ВТ_Должности
	//|ИЗ
	//|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолжностиИПрофессии КАК Должности
	//|		ПО (ВЫБОР
	//|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	//|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = Должности.КодСинхронизации
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ)
	//|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = Должности.Наименование
	//|;
	//---АСТБ_Горюшин_Алексей_43970
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_РабочиеМеста
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
	|		ПО (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = РабочиеМестаАСТБ.Наименование
	|							И РабочиеМестаАСТБ.Владелец = &Организация
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК ТекущееПодразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность КАК ТекущаяДолжность,
	|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК ТекущееРабочееМесто,
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток КАК ТекущееКоличествоСтавок,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение.Родитель КАК ТекущееПодразделениеРодитель
	|ПОМЕСТИТЬ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			,
	|			Организация = &Организация
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ЗанятыеРабочиеМестаОстатки
	//+++АСТБ_Горюшин_Алексей_43970
	|ГДЕ
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток >= 0
	//---АСТБ_Горюшин_Алексей_43970
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК ТекущееПодразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность КАК ТекущаяДолжность,
	|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК ТекущееРабочееМесто,
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток КАК ТекущееКоличествоСтавок,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение.Родитель КАК ТекущееПодразделениеРодитель
	|ПОМЕСТИТЬ ВТ_ЗРМ_ЕстьВБазе_НетВФайле
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Сотрудник В
	|						(ВЫБРАТЬ
	|							ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник КАК Сотрудник
	|						ИЗ
	|							ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле)) КАК ЗанятыеРабочиеМестаОстатки
	//+++АСТБ_Горюшин_Алексей_43970
	|ГДЕ
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток >= 0
	//+++АСТБ_Горюшин_Алексей_49466
	|	И ВЫБОР
	|		КОГДА &ОсобыеНастройки = ""1"" И ПОДСТРОКА(ЗанятыеРабочиеМестаОстатки.Сотрудник.ТабельныйНомер, 1, 1) = ""9""
	|			ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_49466
	//---АСТБ_Горюшин_Алексей_43970
	|;
	//+++АСТБ_Горюшин_Алексей_49466
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗСотрудников.МВЗ КАК ТекущееМВЗСотрудника,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников_Текущие
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|		ПО ВТ_Сотрудники.Сотрудник = МВЗСотрудников.Сотрудник
	|			И (МВЗСотрудников.Организация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпрМВЗ.Ссылка КАК МВЗ,
	|	ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников_ИзСПР
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МВЗ КАК СпрМВЗ
	|		ПО (СпрМВЗ.Владелец = &Организация)
	|			И ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла = СпрМВЗ.Наименование
	|			И (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла = СпрМВЗ.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	//---АСТБ_Горюшин_Алексей_49466
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_Должности.НоваяДолжность КАК НоваяДолжность,
	//+++АСТБ_Горюшин_Алексей_43970
	|	ВТ_Должности.ЭтоДолжностьИзШР КАК ЭтоДолжностьИзШР,
	//---АСТБ_Горюшин_Алексей_43970
	|	ВТ_Подразделения.НовоеПодразделение КАК НовоеПодразделение,
	//|	ЕСТЬNULL(ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель, ВТ_Подразделения.НовоеПодразделениеРодитель) КАК НовоеПодразделениеРодитель,
	|	ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА &УчитыватьФизическоеЛицо
	|			ТОГДА ВЫБОР
	|					КОГДА &ИзменятьФИО
	|						ТОГДА ВТ_Сотрудники.ФизлицоИзСотрудника
	|					КОГДА ВТ_Сотрудники.ФизлицоИзСотрудника = ВТ_Физлица.Физлицо
	|						ТОГДА ВТ_Сотрудники.ФизлицоИзСотрудника
	|					ИНАЧЕ ВТ_Физлица.Физлицо
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Сотрудники.ФизлицоИзСотрудника
	|	КОНЕЦ КАК Физлицо,
	|	ВЫБОР
	|		КОГДА &УчитыватьФизическоеЛицо
	|			ТОГДА ВЫБОР
	|					КОГДА &ИзменятьФИО
	|						ТОГДА ЛОЖЬ
	|					КОГДА ВТ_Сотрудники.ФизлицоИзСотрудника = ВТ_Физлица.Физлицо
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьФизЛицо,
	|	ВЫБОР
	|		КОГДА &ИзменятьФИО
	|				И ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла <> ВТ_Сотрудники.Сотрудник.Наименование
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьФИО,
	//+++АСТБ_Горюшин_Алексей_32185
	|	ВЫБОР
	|		КОГДА &ИзменятьТабельныйНомер
	|				И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла <> ВТ_Сотрудники.Сотрудник.ТабельныйНомер
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьТабельныйНомер,
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_49466
	|	ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_МВЗСотрудников_ИзСПР.МВЗ КАК НовоеМВЗСотрудника,
	//---АСТБ_Горюшин_Алексей_49466
	|	ВТ_РабочиеМеста.НовоеРабочееМесто КАК НовоеРабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ПО ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = ВТ_Сотрудники.ФИОСотрудникаИзФайла
	|			И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = ВТ_Сотрудники.ТабельныйНомерСотрудникаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Физлица КАК ВТ_Физлица
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ВТ_Физлица.КодСинхронизацииФизлицаИзФайла
	|			И ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = ВТ_Физлица.ФИОСотрудникаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = ВТ_Подразделения.КодСинхронизацииПодразделенияИзФайла
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = ВТ_Подразделения.НаименованиеПодразделенияИзФайла)
	//---АсТБ_Alexey_109603_********************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияРодители КАК ВТ_ПодразделенияРодители
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = ВТ_ПодразделенияРодители.КодСинхронизацииПодразделенияРодителяИзФайла
	//+++АСТБ_Горюшин_Алексей_52861
	|			И &УчитыватьГоловноеПодразделение
	//---АСТБ_Горюшин_Алексей_52861
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должности КАК ВТ_Должности
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_Должности.КодСинхронизацииДолжностиИзФайла                   
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	|			И (&ИскатьДолжностиТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_Должности.НаименованиеДолжностиИзФайла)
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеМеста КАК ВТ_РабочиеМеста
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = ВТ_РабочиеМеста.КодСинхронизацииРабочегоМестаИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = ВТ_РабочиеМеста.НаименованиеРабочегоМестаИзФайла
	//+++АСТБ_Горюшин_Алексей_49466
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников_ИзСПР КАК ВТ_МВЗСотрудников_ИзСПР
	|		ПО ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла = ВТ_МВЗСотрудников_ИзСПР.НаименованиеМВЗСотрудникаИзФайла
	|		И (ВЫБОР
	|			КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла
	|				ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла = ВТ_МВЗСотрудников_ИзСПР.КодСинхронизацииМВЗСотрудникаИзФайла
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	//---АСТБ_Горюшин_Алексей_49466
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок, 0) КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)) КАК НоваяДолжность,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо КАК Физлицо,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееКоличествоСтавок, 0) КАК ТекущееКоличествоСтавок,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо КАК ИзменитьФизЛицо,
	//+++АСТБ_Горюшин_Алексей_32185
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьТабельныйНомер КАК ИзменитьТабельныйНомер,
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_43970
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.ЭтоДолжностьИзШР, ЛОЖЬ) КАК ЭтоДолжностьИзШР,
	//---АСТБ_Горюшин_Алексей_43970
	//+++АСТБ_Горюшин_Алексей_49466
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ЕСТЬNULL(ВТ_МВЗСотрудников_Текущие.ТекущееМВЗСотрудника, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК ТекущееМВЗСотрудника,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеМВЗСотрудника, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК НовоеМВЗСотрудника,
	//---АСТБ_Горюшин_Алексей_49466
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО КАК ИзменитьФИО
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Итоговая
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник
	//+++АСТБ_Горюшин_Алексей_49466
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников_Текущие КАК ВТ_МВЗСотрудников_Текущие
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_МВЗСотрудников_Текущие.Сотрудник
	//---АСТБ_Горюшин_Алексей_49466
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.Сотрудник,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.Сотрудник.ФизическоеЛицо,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущаяДолжность,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееКоличествоСтавок,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееПодразделениеРодитель,
	//+++АСТБ_Горюшин_Алексей_32185
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееРабочееМесто,
	//---АСТБ_Горюшин_Алексей_32185
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ,
	//+++АСТБ_Горюшин_Алексей_32185
	|	ЛОЖЬ,
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_43970
	|	ЛОЖЬ,
	//---АСТБ_Горюшин_Алексей_43970
	//+++АСТБ_Горюшин_Алексей_49466
	|	"""",
	|	"""",
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	//---АСТБ_Горюшин_Алексей_49466
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле КАК ВТ_ЗРМ_ЕстьВБазе_НетВФайле
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_Итоговая.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_Итоговая.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность КАК НоваяДолжность,
	//+++АСТБ_Горюшин_Алексей_43970
	|	ВТ_ТаблицаСотрудники_Итоговая.ЭтоДолжностьИзШР КАК ЭтоДолжностьИзШР,
	//---АСТБ_Горюшин_Алексей_43970
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_Итоговая.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники_Итоговая.Физлицо КАК Физлицо,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок КАК ТекущееКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	//+++АСТБ_Горюшин_Алексей_49466
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника КАК ТекущееМВЗСотрудника,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника КАК НовоеМВЗСотрудника,
	//---АСТБ_Горюшин_Алексей_49466
	|	ВЫБОР
	//АсТБ_Alexey_103109_********************************************************************
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника = ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение = ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность = ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто = ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок = ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок
	|			ТОГДА ""Не изменять""
	//АсТБ_Alexey_103109_********************************************************************
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок = 0
	|			ТОГДА ""Увольнение""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок = 0
	|			ТОГДА ""Прием""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность <> ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность
	|				ИЛИ ВЫБОР
	|					КОГДА &ИспользоватьРабочиеМеста
	|						ТОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто <> ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто
	|				КОНЕЦ
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок <> ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок
	|			ТОГДА ""Перемещение""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель
	//+++АСТБ_Горюшин_Алексей_48019
	|			И &УчитыватьГоловноеПодразделение
	//---АСТБ_Горюшин_Алексей_48019
	|			ТОГДА ""Замена ГП""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФИО
	|			ТОГДА ""Замена ФИО""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФизЛицо
	|			ТОГДА ""Замена ФЛ""
	//+++АСТБ_Горюшин_Алексей_32185
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьТабельныйНомер
	|			ТОГДА ""Замена ТН""
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_49466
	|		КОГДА (ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника
	|				И (ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)))
	|				И &ОсобыеНастройки = ""1""
	|				И НаименованиеМВЗСотрудникаИзФайла <> """"
	|			ТОГДА ""Замена МВЗ""
	//---АСТБ_Горюшин_Алексей_49466
	|		ИНАЧЕ ""Не изменять""
	|	КОНЕЦ КАК Действие,
	|	ВЫБОР
	//АсТБ_Alexey_103109_********************************************************************
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника = ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение = ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность = ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто = ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто
	|				И ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок = ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок
	|			ТОГДА 99
	//АсТБ_Alexey_103109_********************************************************************
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок = 0
	|			ТОГДА 8
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок = 0
	|			ТОГДА 6
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность <> ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность
	|				ИЛИ ВЫБОР
	|					КОГДА &ИспользоватьРабочиеМеста
	|						ТОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто <> ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто
	|				КОНЕЦ
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок <> ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок
	|			ТОГДА 7
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель
	//+++АСТБ_Горюшин_Алексей_52861
	|			И &УчитыватьГоловноеПодразделение
	//---АСТБ_Горюшин_Алексей_52861
	|			ТОГДА 3
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФИО
	|			ТОГДА 1
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФизЛицо
	|			ТОГДА 2
	//+++АСТБ_Горюшин_Алексей_32185
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьТабельныйНомер
	|			ТОГДА 4
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_49466
	|		КОГДА (ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника
	|				И (ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)))
	|				И &ОсобыеНастройки = ""1""
	|				И НаименованиеМВЗСотрудникаИзФайла <> """"
	|			ТОГДА 5
	//---АСТБ_Горюшин_Алексей_49466
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокДействийДляСортировки,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто КАК НовоеРабочееМесто
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Итоговая КАК ВТ_ТаблицаСотрудники_Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокДействийДляСортировки,
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудники", ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ИспользоватьРабочиеМеста", Объект.Организация.ИспользоватьРабочиеМеста);
	Запрос.УстановитьПараметр("УчитыватьФизическоеЛицо", Объект.УчитыватьФизическоеЛицо);
	Запрос.УстановитьПараметр("ИзменятьФИО", Объект.ИзменятьФИО);
	//+++АСТБ_Горюшин_Алексей_32185
	Запрос.УстановитьПараметр("ИзменятьТабельныйНомер", Объект.ИзменятьТабельныйНомер);
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_48019
	Запрос.УстановитьПараметр("УчитыватьГоловноеПодразделение", Объект.УчитыватьГоловноеПодразделение);
	//---АСТБ_Горюшин_Алексей_48019
	//+++АСТБ_Горюшин_Алексей_49466
	Запрос.УстановитьПараметр("ОсобыеНастройки", Объект.ОсобыеНастройки);
	//---АСТБ_Горюшин_Алексей_49466
	//+++АсТБ_Alexey_109603_********************************************************************
	Запрос.УстановитьПараметр("ИскатьПодразделенияТолькоПоКодуСинхронизации", Объект.ИскатьПодразделенияТолькоПоКодуСинхронизации);
	//---АсТБ_Alexey_109603_********************************************************************   
	
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	Запрос.УстановитьПараметр("ИскатьДолжностиТолькоПоКодуСинхронизации", Объект.ИскатьДолжностиТолькоПоКодуСинхронизации);
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();	
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Обработать = ?(НоваяСтрока.Действие = "Не изменять", Ложь, Истина);
	КонецЦикла;
	
	//+++АСТБ_Горюшин_Алексей_48019_2
	// Обработка строк без сотрудника
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Исходная
	|ИЗ
	|	&ТаблицаСотрудники КАК ТаблицаСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Исходная КАК ТаблицаСотрудники
	|ГДЕ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла = """"
	|	И ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделение,
	|	Подразделения.Родитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла
	|ПОМЕСТИТЬ ВТ_Подразделения
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = Подразделения.КодСинхронизации
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = Подразделения.Наименование)
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла
	|ПОМЕСТИТЬ ВТ_ПодразделенияРодители
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = Подразделения.КодСинхронизации
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Должности.Ссылка КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	|ПОМЕСТИТЬ ВТ_Должности
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолжностиИПрофессии КАК Должности
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = Должности.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = Должности.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_РабочиеМеста
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
	|		ПО (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = РабочиеМестаАСТБ.Наименование
	|							И РабочиеМестаАСТБ.Владелец = &Организация
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок
	|	КОНЕЦ КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_Должности.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)) КАК НоваяДолжность,
	|	ЕСТЬNULL(ВТ_Подразделения.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_Подразделения.ТекущееПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК ТекущееПодразделениеРодитель,
	|	ЕСТЬNULL(ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделениеРодитель,
	|	ЕСТЬNULL(ВТ_РабочиеМеста.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = ВТ_Подразделения.КодСинхронизацииПодразделенияИзФайла
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = ВТ_Подразделения.НаименованиеПодразделенияИзФайла)
	//---АсТБ_Alexey_109603_********************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияРодители КАК ВТ_ПодразделенияРодители
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = ВТ_ПодразделенияРодители.КодСинхронизацииПодразделенияРодителяИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должности КАК ВТ_Должности
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_Должности.КодСинхронизацииДолжностиИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_Должности.НаименованиеДолжностиИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеМеста КАК ВТ_РабочиеМеста
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = ВТ_РабочиеМеста.КодСинхронизацииРабочегоМестаИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = ВТ_РабочиеМеста.НаименованиеРабочегоМестаИзФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Период КАК Период,
	|	ШтатноеРасписаниеСрезПоследних.Организация КАК Организация,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение КАК ТекущееПодразделение,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение.Родитель КАК ТекущееПодразделениеРодитель,
	|	ШтатноеРасписаниеСрезПоследних.Должность КАК ТекущаяДолжность,
	|	ШтатноеРасписаниеСрезПоследних.КоличествоСтавок КАК ТекущееКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(&ПериодШР, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееПодразделениеРодитель, ВТ_ТаблицаСотрудники_НовоеИзФайла.ТекущееПодразделениеРодитель) КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто КАК ТекущееРабочееМесто,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок, 0) КАК ТекущееКоличествоСтавок,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееПодразделение, ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение) КАК ТекущееПодразделение,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущаяДолжность, ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность) КАК ТекущаяДолжность
	|ПОМЕСТИТЬ ВТ_ПодготовленнаяТаблица
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение = ВТ_ШтатноеРасписание.ТекущееПодразделение
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность = ВТ_ШтатноеРасписание.ТекущаяДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодготовленнаяТаблица.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ПодготовленнаяТаблица.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ПодготовленнаяТаблица.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВТ_ПодготовленнаяТаблица.ТекущееКоличествоСтавок КАК ТекущееКоличествоСтавок,
	|	ВТ_ПодготовленнаяТаблица.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ПодготовленнаяТаблица.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоДолжности
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НоваяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущаяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НоваяДолжность = ВТ_ПодготовленнаяТаблица.ТекущаяДолжность
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьДолжность,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоПодразделения
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделение = ВТ_ПодготовленнаяТаблица.ТекущееПодразделение
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьПодразделение,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоПодразделения
	|				И &УчитыватьГоловноеПодразделение
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И НЕ ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияРодителяИзФайла = """"
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель = ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьПодразделениеРодитель,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоРабочиеМеста
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто = ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьРабочееМесто
	|ИЗ
	|	ВТ_ПодготовленнаяТаблица КАК ВТ_ПодготовленнаяТаблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	НовоеПодразделениеРодитель,
	|	НовоеПодразделение,
	|	НоваяДолжность,
	|	НовоеРабочееМесто
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудники", ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ИспользоватьРабочиеМеста", Объект.Организация.ИспользоватьРабочиеМеста);
	Запрос.УстановитьПараметр("ПериодШР", ТекущаяДата());
	Запрос.УстановитьПараметр("ЗагружатьТолькоДолжности", Истина);
	Запрос.УстановитьПараметр("ЗагружатьТолькоПодразделения", Истина);
	Запрос.УстановитьПараметр("ЗагружатьТолькоРабочиеМеста", Истина);
	Запрос.УстановитьПараметр("УчитыватьГоловноеПодразделение", Объект.УчитыватьГоловноеПодразделение);
	//+++АсТБ_Alexey_109603_********************************************************************
	Запрос.УстановитьПараметр("ИскатьПодразделенияТолькоПоКодуСинхронизации", Объект.ИскатьПодразделенияТолькоПоКодуСинхронизации);
	//---АсТБ_Alexey_109603_********************************************************************
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Действие = "Не изменять";
		ПорядокДействийДляСортировки = 99;
		
		Если Строка.ЗагружатьДолжность
			ИЛИ Строка.ЗагружатьПодразделение 
			ИЛИ Строка.ЗагружатьПодразделениеРодитель
			ИЛИ Строка.ЗагружатьРабочееМесто
			Тогда
			Действие = "Справочники";
			ПорядокДействийДляСортировки = 9;
		КонецЕсли;
			
		НоваяСтрока.Действие = Действие;
		НоваяСтрока.ПорядокДействийДляСортировки = ПорядокДействийДляСортировки;
		НоваяСтрока.Обработать = ?(НоваяСтрока.Действие = "Не изменять", Ложь, Истина);
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("ПорядокДействийДляСортировки");	
	//---АСТБ_Горюшин_Алексей_48019_2
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонСверки(Команда)
	
	АдресХранилищаДанных = СохранитьШаблонНаСервере();
	//+++АСТБ_Горюшин_Алексей_48019_3
	ПараметрыСохранения = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыСохранения.ВыборКаталога = Истина;
	НачатьПолучениеФайлаССервера(АдресХранилищаДанных, "Шаблон кадровой сверки.xlsx", ПараметрыСохранения);
	//было
	//ВременныйКаталог = КаталогВременныхФайлов();
	//ФайлШаблона = ВременныйКаталог + "Шаблон кадровой сверки" + ".xlsx";
	//ПолучитьФайл(АдресХранилищаДанных, ФайлШаблона, Истина);
	//---АСТБ_Горюшин_Алексей_48019_3
	
КонецПроцедуры

&НаСервере
Функция СохранитьШаблонНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("ШаблонКадровойСверки");
	АдресХранилища = ПоместитьВоВременноеХранилище(Макет);
	Возврат АдресХранилища;
	
КонецФункции

&НаКлиенте
Процедура УстановитьФлаг(Команда)
	УстановитьЗначениеФлагаНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаг(Команда)
	УстановитьЗначениеФлагаНаСервере(Ложь);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеФлагаНаСервере(Значение)
	Для Каждого Строка Из Объект.Сотрудники Цикл
		Строка.Обработать = Значение;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	//+++АСТБ_Горюшин_Алексей_43970
	Объект.ЕстьОшибкаЗаписиДокумента = Ложь;
	//---АСТБ_Горюшин_Алексей_43970
	СоздатьПриемНаРаботу();
	СоздатьКадровоеПеремещение();
	СоздатьУвольнение();
	ЗаменитьФЛ_В_Сотрудниках();
	ЗаменитьФИО_Сотрудников();
	ЗаменитьГоловноеПодразделениеПодразделений();
	//+++АСТБ_Горюшин_Алексей_32185
	ЗаменитьТабельныеНомераСотрудников();
	//---АСТБ_Горюшин_Алексей_32185
	//+++АСТБ_Горюшин_Алексей_49466
	ПроверитьИ_ЗаписатьМВЗ_Сотрудников();
	//---АСТБ_Горюшин_Алексей_49466
	
	//+++АСТБ_Горюшин_Алексей_48019_2
	//Загрузка подразделений, долж, раб мес, ШР
	СоздатьСправочникПодразделения_КадроваяСверка();
	СоздатьСправочникДолжности_КадроваяСверка();
	СоздатьСправочникРабочиеМеста_КадроваяСверка();
	ДобавитьЗаписьВШтатноеРасписание_КадроваяСверка();
	//---АСТБ_Горюшин_Алексей_48019_2
	
	//+++АСТБ_Горюшин_Алексей_43970
	Если НЕ Объект.ЕстьОшибкаЗаписиДокумента Тогда
	//---АСТБ_Горюшин_Алексей_43970
	ПрочитатьФайлНаСервере(Объект.ВременноеХранилище)
	//+++АСТБ_Горюшин_Алексей_43970
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_43970
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПроверитьСоздатьСотрудника(СтрокаДанных)
	
	Если НЕ (ЗначениеЗаполнено(СтрокаДанных.ФИОСотрудникаИзФайла)
		И ЗначениеЗаполнено(СтрокаДанных.ТабельныйНомерСотрудникаИзФайла))
		Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.Сотрудник) Тогда
		ЗаменитьФИО_Сотрудника(СтрокаДанных);
		ЗаменитьФЛ_В_Сотруднике(СтрокаДанных);
		//+++АСТБ_Горюшин_Алексей_32185
		ЗаменитьТабельныйНомерСотрудника(СтрокаДанных);
		//---АСТБ_Горюшин_Алексей_32185
		Возврат СтрокаДанных.Сотрудник;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		//+++АСТБ_Горюшин_Алексей_32185
		|		(ВЫБОР
		|				КОГДА &ИзменятьФИО
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Сотрудники.Наименование = &ФИОСотрудникаИзФайла
		|			КОНЕЦ)
		|		И (ВЫБОР
		|				КОГДА &ИзменятьТабельныйНомер
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Сотрудники.ТабельныйНомер = &ТабельныйНомерСотрудникаИзФайла
		|			КОНЕЦ)
		//было
		//|	Сотрудники.Наименование = &ФИОСотрудникаИзФайла
		//|	И Сотрудники.ТабельныйНомер = &ТабельныйНомерСотрудникаИзФайла
		//---АСТБ_Горюшин_Алексей_32185
		|	И Сотрудники.Владелец = &Организация"; 

		Запрос.УстановитьПараметр("ФИОСотрудникаИзФайла", СтрокаДанных.ФИОСотрудникаИзФайла);
		Запрос.УстановитьПараметр("ТабельныйНомерСотрудникаИзФайла", СтрокаДанных.ТабельныйНомерСотрудникаИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		//+++АСТБ_Горюшин_Алексей_32185
		Запрос.УстановитьПараметр("ИзменятьФИО", Объект.ИзменятьФИО);
		Запрос.УстановитьПараметр("ИзменятьТабельныйНомер", Объект.ИзменятьТабельныйНомер);
		//---АСТБ_Горюшин_Алексей_32185
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.Сотрудник = РезультатЗапроса[0].Сотрудник;
			ЗаменитьФИО_Сотрудника(СтрокаДанных);
			ЗаменитьФЛ_В_Сотруднике(СтрокаДанных);
			//+++АСТБ_Горюшин_Алексей_32185
			ЗаменитьТабельныйНомерСотрудника(СтрокаДанных);
			//---АСТБ_Горюшин_Алексей_32185
			Возврат РезультатЗапроса[0].Сотрудник;
		Иначе
			
			//Создание сотрудника
			СправочникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
			СправочникОбъект.ТабельныйНомер = СтрокаДанных.ТабельныйНомерСотрудникаИзФайла;
			СправочникОбъект.Наименование 	= СтрокаДанных.ФИОСотрудникаИзФайла;
			СправочникОбъект.ФизическоеЛицо	= ПроверитьСоздатьФизлицо(СтрокаДанных);
			СправочникОбъект.Владелец 		= Объект.Организация;
			
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.Сотрудник = СправочникОбъект.Ссылка;
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи сотрудника!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.Сотрудники.ПустаяСсылка();
			КонецПопытки;	
				
		КонецЕсли;
	
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПроверитьСоздатьФизлицо(СтрокаДанных)
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.ФИОСотрудникаИзФайла) Тогда
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.Физлицо) Тогда
		
		Если Объект.ИзменятьФИО Тогда
			
			СправочникОбъект = СтрокаДанных.Физлицо.ПолучитьОбъект();
			СправочникОбъект.Наименование = СтрокаДанных.ФИОСотрудникаИзФайла;
			
			Попытка
				СправочникОбъект.Записать();
				ФизическиеЛицаПереопределяемый.ЗаписатьФИОФизЛиц(ФизическиеЛицаПереопределяемый.ПолучитьМассивФИО(СтрокаДанных.ФИОСотрудникаИзФайла), СправочникОбъект.Ссылка);
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Обновлено ФИО физлица " + СтрокаДанных.Физлицо;
				Сообщение.Сообщить();
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи физлица!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
			
		КонецЕсли;
		
		Возврат СтрокаДанных.Физлицо;
		
	ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.Сотрудник) И Объект.ИзменятьФИО Тогда
		
		СтрокаДанных.Физлицо = СтрокаДанных.Сотрудник.ФизическоеЛицо;
		СправочникОбъект = СтрокаДанных.Физлицо.ПолучитьОбъект();
		СправочникОбъект.Наименование = СтрокаДанных.ФИОСотрудникаИзФайла;
		
		Попытка
			СправочникОбъект.Записать();
			ФизическиеЛицаПереопределяемый.ЗаписатьФИОФизЛиц(ФизическиеЛицаПереопределяемый.ПолучитьМассивФИО(СтрокаДанных.ФИОСотрудникаИзФайла), СправочникОбъект.Ссылка);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Обновлено ФИО физлица " + СтрокаДанных.Физлицо;
			Сообщение.Сообщить();
			Возврат СтрокаДанных.Физлицо;  
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи физлица!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
			Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецПопытки;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК Физлицо
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|ГДЕ
		//+++АСТБ_ALEXEY_102006_**************************************************************
		//|	ВЫБОР
		//|			КОГДА &ЕстьКодСинхронизацииФизлицаИзФайла
		//|				ТОГДА &КодСинхронизацииФизлицаИзФайла = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо.КодСинхронизации
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		|		ВЫБОР
		|				КОГДА &УчитыватьФизическоеЛицо
		|					ТОГДА &КодСинхронизацииФизлицаИзФайла = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо.КодСинхронизации   
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		//---АСТБ_ALEXEY_102006_**************************************************************
		|	И ФИОФизическихЛицСрезПоследних.Фамилия = &ФамилияСотрудникаИзФайла
		|	И ФИОФизическихЛицСрезПоследних.Имя = &ИмяСотрудникаИзФайла
		|	И ФИОФизическихЛицСрезПоследних.Отчество = &ОтчествоСотрудникаИзФайла";
	
		Запрос.УстановитьПараметр("ЕстьКодСинхронизацииФизлицаИзФайла", СтрокаДанных.ЕстьКодСинхронизацииФизлицаИзФайла);
		Запрос.УстановитьПараметр("КодСинхронизацииФизлицаИзФайла", СтрокаДанных.КодСинхронизацииФизлицаИзФайла);
		Запрос.УстановитьПараметр("ФамилияСотрудникаИзФайла", СтрокаДанных.ФамилияСотрудникаИзФайла);
		Запрос.УстановитьПараметр("ИмяСотрудникаИзФайла", СтрокаДанных.ИмяСотрудникаИзФайла);
		Запрос.УстановитьПараметр("ОтчествоСотрудникаИзФайла", СтрокаДанных.ОтчествоСотрудникаИзФайла);
		//+++АСТБ_ALEXEY_102006_**************************************************************
		Запрос.УстановитьПараметр("УчитыватьФизическоеЛицо", Объект.УчитыватьФизическоеЛицо);
		//---АСТБ_ALEXEY_102006_**************************************************************
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.Физлицо = РезультатЗапроса[0].Физлицо;
			Возврат РезультатЗапроса[0].Физлицо;
		Иначе
			
			//Создание Физлица
			СправочникОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			СправочникОбъект.КодСинхронизации	= СтрокаДанных.КодСинхронизацииФизлицаИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.ФИОСотрудникаИзФайла;
			Если СтрНайти(НРег(СтрокаДанных.ОтчествоСотрудникаИзФайла), "вна") > 0 Тогда
				СправочникОбъект.Пол 			= Перечисления.ПолФизическогоЛица.Женский;
			Иначе
				СправочникОбъект.Пол 			= Перечисления.ПолФизическогоЛица.Мужской;
			КонецЕсли;
						
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.Физлицо = СправочникОбъект.Ссылка;
				ФизическиеЛицаПереопределяемый.ЗаписатьФИОФизЛиц(ФизическиеЛицаПереопределяемый.ПолучитьМассивФИО(СтрокаДанных.ФИОСотрудникаИзФайла), СправочникОбъект.Ссылка);
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи физлица!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
			КонецПопытки;	
				
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ПроверитьСоздатьПодразделение(СтрокаДанных)
	
	Если НЕ (ЗначениеЗаполнено(СтрокаДанных.КодСинхронизацииПодразделенияИзФайла)
		И ЗначениеЗаполнено(СтрокаДанных.НаименованиеПодразделенияИзФайла))
		Тогда
		Возврат Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.НовоеПодразделение) Тогда
		ПроверитьСоздатьОбновитьПодразделениеРодитель(СтрокаДанных.НовоеПодразделение, СтрокаДанных);
		Возврат СтрокаДанных.НовоеПодразделение;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК НовоеПодразделение
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.КодСинхронизации = &КодСинхронизацииПодразделенияИзФайла
		//+++АсТБ_Alexey_109603_********************************************************************
		|	И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ Подразделения.Наименование = &НаименованиеПодразделенияИзФайла)
		//---АсТБ_Alexey_109603_********************************************************************
		|	И Подразделения.Наименование = &НаименованиеПодразделенияИзФайла
		|	И Подразделения.Владелец = &Организация";

		Запрос.УстановитьПараметр("КодСинхронизацииПодразделенияИзФайла", СтрокаДанных.КодСинхронизацииПодразделенияИзФайла);
		Запрос.УстановитьПараметр("НаименованиеПодразделенияИзФайла", СтрокаДанных.НаименованиеПодразделенияИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		//+++АсТБ_Alexey_109603_********************************************************************
		Запрос.УстановитьПараметр("ИскатьПодразделенияТолькоПоКодуСинхронизации", Объект.ИскатьПодразделенияТолькоПоКодуСинхронизации);
		//---АсТБ_Alexey_109603_********************************************************************
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НовоеПодразделение = РезультатЗапроса[0].НовоеПодразделение;
			ПроверитьСоздатьОбновитьПодразделениеРодитель(СтрокаДанных.НовоеПодразделение, СтрокаДанных);
			Возврат СтрокаДанных.НовоеПодразделение;
		Иначе
			
			//Создание подразделения
			СправочникОбъект = Справочники.Подразделения.СоздатьЭлемент();
			СправочникОбъект.Владелец 			= Объект.Организация;
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииПодразделенияИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.НаименованиеПодразделенияИзФайла;
			СправочникОбъект.НаименованиеПолное	= СтрокаДанных.НаименованиеПодразделенияИзФайла;
			
			Попытка
				СправочникОбъект.Записать();
				//+++АСТБ_Горюшин_Алексей_48019_2
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Создано подразделение: " + СправочникОбъект.Ссылка;
				Сообщение.Сообщить();
				//---АСТБ_Горюшин_Алексей_48019_2
				СтрокаДанных.НовоеПодразделение = СправочникОбъект.Ссылка;
				ПроверитьСоздатьОбновитьПодразделениеРодитель(СправочникОбъект.Ссылка, СтрокаДанных);
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи подразделения!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.Подразделения.ПустаяСсылка();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПроверитьСоздатьОбновитьПодразделениеРодитель(ПодчиненноеПодразделение, СтрокаДанных) 
	
	//+++АСТБ_Горюшин_Алексей_48019
	Если НЕ Объект.УчитыватьГоловноеПодразделение Тогда
		Возврат;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_48019
	
	//+++АСТБ_Горюшин_Алексей_59691
	Если Объект.ОсобыеНастройки = "2" Тогда
		Возврат;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_59691
	
	Ошибка = Ложь;
	
	Если ЗначениеЗаполнено(СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла) 
		И НЕ ЗначениеЗаполнено(СтрокаДанных.НовоеПодразделениеРодитель) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.КодСинхронизации = &КодСинхронизацииПодразделенияРодителяИзФайла
		|	И Подразделения.Владелец = &Организация";
		
		Запрос.УстановитьПараметр("КодСинхронизацииПодразделенияРодителяИзФайла", СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НовоеПодразделениеРодитель = РезультатЗапроса[0].НовоеПодразделениеРодитель;
		Иначе
			
			//Создание подразделения родителя
			СправочникОбъект = Справочники.Подразделения.СоздатьЭлемент();
			СправочникОбъект.Владелец 			= Объект.Организация;
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла;
			СправочникОбъект.НаименованиеПолное	= СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла;
			
			Попытка
				СправочникОбъект.Записать();
				//+++АСТБ_Горюшин_Алексей_48019_2
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Создано подразделение: " + СправочникОбъект.Ссылка;
				Сообщение.Сообщить();
				//---АСТБ_Горюшин_Алексей_48019_2
				СтрокаДанных.НовоеПодразделениеРодитель = СправочникОбъект.Ссылка;
			Исключение	
				Ошибка = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи головного подразделения!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПодчиненноеПодразделение.Родитель <> СтрокаДанных.НовоеПодразделениеРодитель И НЕ Ошибка Тогда
		ПодчиненноеПодразделениеОбъект = ПодчиненноеПодразделение.ПолучитьОбъект();
		ПодчиненноеПодразделениеОбъект.Родитель = СтрокаДанных.НовоеПодразделениеРодитель;
		Попытка
			ПодчиненноеПодразделениеОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Записано головное подразделение подразделения " + ПодчиненноеПодразделение.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи головного подразделения в поразделение!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ПроверитьСоздатьДолжность(СтрокаДанных)
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.НаименованиеДолжностиИзФайла) Тогда
		Возврат Справочники.ДолжностиИПрофессии.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.НоваяДолжность) Тогда
		Возврат СтрокаДанных.НоваяДолжность;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Должности.Ссылка КАК НоваяДолжность
		|ИЗ
		|	Справочник.ДолжностиИПрофессии КАК Должности
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьКодСинхронизацииДолжностиИзФайла
		|				ТОГДА &КодСинхронизацииДолжностиИзФайла = Должности.КодСинхронизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Должности.Наименование = &НаименованиеДолжностиИзФайла";
		
		Запрос.УстановитьПараметр("ЕстьКодСинхронизацииДолжностиИзФайла", СтрокаДанных.ЕстьКодСинхронизацииДолжностиИзФайла);
		Запрос.УстановитьПараметр("КодСинхронизацииДолжностиИзФайла", СтрокаДанных.КодСинхронизацииДолжностиИзФайла);
		Запрос.УстановитьПараметр("НаименованиеДолжностиИзФайла", СтрокаДанных.НаименованиеДолжностиИзФайла);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НоваяДолжность = РезультатЗапроса[0].НоваяДолжность;
			Возврат РезультатЗапроса[0].НоваяДолжность;
		Иначе
			
			//Создание должности
			СправочникОбъект = Справочники.ДолжностиИПрофессии.СоздатьЭлемент();
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииДолжностиИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.НаименованиеДолжностиИзФайла;
			СправочникОбъект.НаименованиеПолное	= СтрокаДанных.НаименованиеДолжностиИзФайла;
			СправочникОбъект.Источник 			= Перечисления.ИсточникиДолжностей.ВведеныВручную;
			
			Попытка
				СправочникОбъект.Записать();
				//+++АСТБ_Горюшин_Алексей_48019_2
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Создана должность: " + СправочникОбъект.Ссылка;
				Сообщение.Сообщить();
				//---АСТБ_Горюшин_Алексей_48019_2
				СтрокаДанных.НоваяДолжность = СправочникОбъект.Ссылка;
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи должности!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.ДолжностиИПрофессии.ПустаяСсылка();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьСоздатьРабочееМесто(СтрокаДанных)
	
	Если НЕ Объект.Организация.ИспользоватьРабочиеМеста Тогда
		Возврат Справочники.РабочиеМестаАСТБ.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.НаименованиеРабочегоМестаИзФайла) Тогда
		Возврат Справочники.РабочиеМестаАСТБ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.НовоеРабочееМесто) Тогда
		Возврат СтрокаДанных.НовоеРабочееМесто;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто
		|ИЗ
		|	Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьКодСинхронизацииРабочегоМестаИзФайла
		|				ТОГДА &КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И РабочиеМестаАСТБ.Наименование = &НаименованиеРабочегоМестаИзФайла
		|	И РабочиеМестаАСТБ.Владелец = &Организация";
		
		Запрос.УстановитьПараметр("ЕстьКодСинхронизацииРабочегоМестаИзФайла", СтрокаДанных.ЕстьКодСинхронизацииРабочегоМестаИзФайла);
		Запрос.УстановитьПараметр("КодСинхронизацииРабочегоМестаИзФайла", СтрокаДанных.КодСинхронизацииРабочегоМестаИзФайла);
		Запрос.УстановитьПараметр("НаименованиеРабочегоМестаИзФайла", СтрокаДанных.НаименованиеРабочегоМестаИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НовоеРабочееМесто = РезультатЗапроса[0].НовоеРабочееМесто;
			Возврат РезультатЗапроса[0].НовоеРабочееМесто;
		Иначе
			
			//Создание рабочего места
			СправочникОбъект = Справочники.РабочиеМестаАСТБ.СоздатьЭлемент();
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииРабочегоМестаИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.НаименованиеРабочегоМестаИзФайла;
			СправочникОбъект.Владелец 			= Объект.Организация;
			
			Попытка
				СправочникОбъект.Записать();
				//+++АСТБ_Горюшин_Алексей_48019_2
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Создано рабочее место: " + СправочникОбъект.Ссылка;
				Сообщение.Сообщить();
				//---АСТБ_Горюшин_Алексей_48019_2
				СтрокаДанных.НовоеРабочееМесто = СправочникОбъект.Ссылка;
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи рабочего места!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.РабочиеМестаАСТБ.ПустаяСсылка();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СоздатьПриемНаРаботу()

	ДокументОбъект = Документы.ПриемНаРаботу.СоздатьДокумент();
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка""";
	ДокументОбъект.Организация 			= Объект.Организация;
	ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
	ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Прием" Тогда
			
			Сотрудник 			= ПроверитьСоздатьСотрудника(Строка);
			Подразделение 		= ПроверитьСоздатьПодразделение(Строка);
			Должность 			= ПроверитьСоздатьДолжность(Строка);
			РабочееМесто        = ПроверитьСоздатьРабочееМесто(Строка);
			ЗанимаемыхСтавок	= Строка.НовоеКоличествоСтавок;
			
			Если ЗначениеЗаполнено(Сотрудник)
				И ЗначениеЗаполнено(Подразделение)
				И ЗначениеЗаполнено(Должность)
				И ЗначениеЗаполнено(ЗанимаемыхСтавок)
				Тогда
				
				НоваяСтрока = ДокументОбъект.Работники.Добавить();
				НоваяСтрока.Сотрудник 			= Сотрудник;
				НоваяСтрока.Подразделение 		= Подразделение;
				НоваяСтрока.Должность 			= Должность;
				НоваяСтрока.РабочееМесто 		= РабочееМесто;
				НоваяСтрока.ЗанимаемыхСтавок	= ЗанимаемыхСтавок;	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Строка не добавлена в приём! Не заполнено одно или несколько полей! Сотрудник """ + Сотрудник
					+ """, Подразделение """ + Подразделение
					+ """, Должность """ + Должность
					+ """, Занимаемых ставок """ + ЗанимаемыхСтавок + """";
				Сообщение.Сообщить();
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Работники.Количество() > 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение
			//+++АСТБ_Горюшин_Алексей_43970
			Объект.ЕстьОшибкаЗаписиДокумента = Истина;
			//---АСТБ_Горюшин_Алексей_43970
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи документа приема!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();		
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКадровоеПеремещение()
	
	ДокументОбъект = Документы.КадровоеПеремещение.СоздатьДокумент();
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка""";
	ДокументОбъект.Организация 			= Объект.Организация;
	ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
	ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Перемещение" Тогда
			
			Сотрудник 			= ПроверитьСоздатьСотрудника(Строка);
			Подразделение 		= ПроверитьСоздатьПодразделение(Строка);
			Должность 			= ПроверитьСоздатьДолжность(Строка);
			РабочееМесто        = ПроверитьСоздатьРабочееМесто(Строка);
			ЗанимаемыхСтавок	= Строка.НовоеКоличествоСтавок;
			
			Если ЗначениеЗаполнено(Сотрудник)
				И ЗначениеЗаполнено(Подразделение)
				И ЗначениеЗаполнено(Должность)
				И ЗначениеЗаполнено(ЗанимаемыхСтавок)
				Тогда
				
				НоваяСтрока = ДокументОбъект.Работники.Добавить();
				НоваяСтрока.Сотрудник 				= Сотрудник;
				НоваяСтрока.ПодразделениеНовое 		= Подразделение;
				НоваяСтрока.ДолжностьНовая 			= Должность;
				НоваяСтрока.РабочееМестоНовое 		= РабочееМесто;
				НоваяСтрока.ЗанимаемыхСтавокНовое	= ЗанимаемыхСтавок;
				НоваяСтрока.ПодразделениеСтарое 	= Строка.ТекущееПодразделение;
				НоваяСтрока.ДолжностьСтарая 		= Строка.ТекущаяДолжность;
				НоваяСтрока.РабочееМестоСтарое 		= Строка.ТекущееРабочееМесто;
				НоваяСтрока.ЗанимаемыхСтавокСтарое	= Строка.ТекущееКоличествоСтавок;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Строка не добавлена в перемещение! Не заполнено одно или несколько полей! Сотрудник """ + Сотрудник
					+ """, Подразделение новое """ + Подразделение
					+ """, Должность новая """ + Должность
					+ """, Занимаемых ставок """ + ЗанимаемыхСтавок + """";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Работники.Количество() > 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение
			//+++АСТБ_Горюшин_Алексей_43970
			Объект.ЕстьОшибкаЗаписиДокумента = Истина;
			//---АСТБ_Горюшин_Алексей_43970
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи документа перемещения!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();		
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьУвольнение()
	
	ДокументОбъект = Документы.Увольнение.СоздатьДокумент();
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка""";
	ДокументОбъект.Организация 			= Объект.Организация;
	ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
	ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Увольнение" Тогда
			
			//+++АСТБ_Горюшин_Алексей_49466
			Если Объект.ОсобыеНастройки = "1" 
				И Лев(Строка.Сотрудник.ТабельныйНомер,1) = "9" Тогда
				Продолжить;
			КонецЕсли;
			//---АСТБ_Горюшин_Алексей_49466
			
			НоваяСтрока = ДокументОбъект.Работники.Добавить();
			НоваяСтрока.Сотрудник 			= Строка.Сотрудник;
			НоваяСтрока.Подразделение 		= Строка.ТекущееПодразделение;
			НоваяСтрока.Должность 			= Строка.ТекущаяДолжность;
			НоваяСтрока.РабочееМесто 		= Строка.ТекущееРабочееМесто;
			НоваяСтрока.ЗанимаемыхСтавок	= Строка.ТекущееКоличествоСтавок;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Работники.Количество() > 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение
			//+++АСТБ_Горюшин_Алексей_43970
			Объект.ЕстьОшибкаЗаписиДокумента = Истина;
			//---АСТБ_Горюшин_Алексей_43970
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи документа увольнения!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();		
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьФЛ_В_Сотрудниках()
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Замена ФЛ" Тогда
			
			ЗаменитьФЛ_В_Сотруднике(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаменитьФИО_Сотрудников()
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Замена ФИО" Тогда
			
			ЗаменитьФИО_Сотрудника(Строка);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_32185
&НаСервере
Процедура ЗаменитьТабельныеНомераСотрудников()
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Замена ТН" Тогда
			
			ЗаменитьТабельныйНомерСотрудника(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_32185
	
&НаСервере
Процедура ЗаменитьГоловноеПодразделениеПодразделений()
	
	//+++АСТБ_Горюшин_Алексей_48019
	Если НЕ Объект.УчитыватьГоловноеПодразделение Тогда
		Возврат;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_48019
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать И Строка.Действие = "Замена ГП" Тогда
			
			ЗаменитьГоловноеПодразделениеПодразделения(Строка);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры	

&НаСервере
Процедура ЗаменитьГоловноеПодразделениеПодразделения(СтрокаДанных)
	
		ПроверитьСоздатьОбновитьПодразделениеРодитель(СтрокаДанных.ТекущееПодразделение, СтрокаДанных);
		
КонецПроцедуры

&НаСервере
Процедура ЗаменитьФЛ_В_Сотруднике(СтрокаДанных)
	
	Если Объект.УчитыватьФизическоеЛицо И НЕ СтрокаДанных.Сотрудник.ФизическоеЛицо = СтрокаДанных.Физлицо Тогда
		
		СправочникОбъект = СтрокаДанных.Сотрудник.ПолучитьОбъект();
		СправочникОбъект.ФизическоеЛицо	= ПроверитьСоздатьФизлицо(СтрокаДанных);
		
		Попытка
			СправочникОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Заменено физическое лицо у сотрудника " + СправочникОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи сотрудника!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьФИО_Сотрудника(СтрокаДанных)
	
	Если Объект.ИзменятьФИО Тогда
		
		СправочникОбъект = СтрокаДанных.Сотрудник.ПолучитьОбъект();
		СправочникОбъект.Наименование = СтрокаДанных.ФИОСотрудникаИзФайла;
		
		Попытка
			СправочникОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Изменены ФИО сотрудника " + СправочникОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи сотрудника!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_32185
&НаСервере
Процедура ЗаменитьТабельныйНомерСотрудника(СтрокаДанных)
	
	Если Объект.ИзменятьТабельныйНомер Тогда
		
		СправочникОбъект = СтрокаДанных.Сотрудник.ПолучитьОбъект();
		СправочникОбъект.ТабельныйНомер = СтрокаДанных.ТабельныйНомерСотрудникаИзФайла;
		
		Попытка
			СправочникОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Изменён табельный номер сотрудника " + СправочникОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи сотрудника (запись табельного номера)!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры //---АСТБ_Горюшин_Алексей_32185

&НаСервере
Процедура ИзменитьВидимостьЭлементов()
	
	Если Объект.Организация.ИспользоватьРабочиеМеста Тогда
		Элементы.СотрудникиГруппаРабочееМесто.Видимость = Истина;
	Иначе 
		Элементы.СотрудникиГруппаРабочееМесто.Видимость = Ложь;
	КонецЕсли;
	
	//+++АСТБ_Горюшин_Алексей_49466
	//+++АСТБ_Горюшин_Алексей_59691
	//было
	//Элементы.СотрудникиГруппаМВЗ.Видимость = Объект.ОсобыеНастройки = "1";
	//---АСТБ_Горюшин_Алексей_59691
	Элементы.СохранитьШаблонСверкиС_МВЗ.Видимость = Объект.ОсобыеНастройки = "1";
	//---АСТБ_Горюшин_Алексей_49466
	
	//+++АСТБ_Горюшин_Алексей_48019_3
	Элементы.СохранитьШаблонСверки.Видимость = Объект.ОсобыеНастройки = "0";
	//---АСТБ_Горюшин_Алексей_48019_3
	
	//+++АСТБ_Горюшин_Алексей_48019_2
	Объект.ИспользуетсяШтатноеРасписание = ЕстьЗаписиШР_КадроваяСверка();
	//---АСТБ_Горюшин_Алексей_48019_2
	
	//+++АСТБ_Горюшин_Алексей_59691
	Элементы.СохранитьШаблонСверкиС_МВЗ_БезГП.Видимость = Объект.ОсобыеНастройки = "2";
	Элементы.СотрудникиГруппаПодразделенияРодитель.Видимость = Объект.ОсобыеНастройки <> "2";
	Элементы.УчитыватьГоловноеПодразделение.Видимость = Объект.ОсобыеНастройки <> "2";
	Если Объект.ОсобыеНастройки = "1"
		ИЛИ Объект.ОсобыеНастройки = "2"
		Тогда
		Элементы.СотрудникиГруппаМВЗ.Видимость = Истина;
	Иначе
		Элементы.СотрудникиГруппаМВЗ.Видимость = Ложь;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_59691
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ИзменитьВидимостьЭлементов();
КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_32185
&НаКлиенте
Процедура ИзменятьФИОПриИзменении(Элемент)
	СнятьФлагИзменятьТабельныйНомер();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_32185

//+++АСТБ_Горюшин_Алексей_32185
&НаСервере
Процедура СнятьФлагИзменятьТабельныйНомер()
	Объект.ИзменятьТабельныйНомер = Ложь;
КонецПроцедуры //---АСТБ_Горюшин_Алексей_32185

//+++АСТБ_Горюшин_Алексей_32185
&НаКлиенте
Процедура ИзменятьТабельныйНомерПриИзменении(Элемент)
	СнятьФлагИзменятьФИО();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_32185

//+++АСТБ_Горюшин_Алексей_32185
&НаСервере
Процедура СнятьФлагИзменятьФИО()
	Объект.ИзменятьФИО = Ложь;
КонецПроцедуры //---АСТБ_Горюшин_Алексей_32185

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура ПрочитатьФайлЗагрузкаКадровыхИзменений(Команда)
	
	Если Объект.СотрудникиЗагрузкаКадровыхИзменений.Количество() > 0 Тогда
		Текст = "ru = ""Табличная часть будет очищена! Продолжить выполнение операции?"";";
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗагрузкаКадровыхИзменений", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение,НСтр(Текст),РежимДиалогаВопрос.ДаНет);
	Иначе	
		Состояние("Выполняется чтение файла...");
		ПрочитатьФайлЗагрузкаКадровыхИзмененийНаСервере(Объект.ВременноеХранилищеЗагрузкаКадровыхИзменений);
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура ПослеЗакрытияВопросаЗагрузкаКадровыхИзменений(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Объект.СотрудникиЗагрузкаКадровыхИзменений.Очистить();
	Состояние("Выполняется чтение файла...");
	ПрочитатьФайлЗагрузкаКадровыхИзмененийНаСервере(Объект.ВременноеХранилищеЗагрузкаКадровыхИзменений);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ПрочитатьФайлЗагрузкаКадровыхИзмененийНаСервере(Адрес)
	
	Если Не ЗначениеЗаполнено(Объект.ФайлЗагрузкаКадровыхИзменений) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран файл!";
		Сообщение.Поле = "Файл";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОрганизацияЗагрузкаКадровыхИзменений) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана организация!";
		Сообщение.Поле = "Организация";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Объект.ФайлПрочитанЗагрузкаКадровыхИзменений = Ложь;
	
	Попытка    
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Объект.РасширениеФайлаЗагрузкаКадровыхИзменений);
		ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ФайлEXCELНаСервере);
		УдалитьФайлы(ФайлEXCELНаСервере);
		ОбластьТаблицы = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);  
		ПостроительЗапроса.Выполнить();
		ТаблицаДанных = ПостроительЗапроса.Результат.Выгрузить();
		
		Объект.ФайлПрочитанЗагрузкаКадровыхИзменений = Истина;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Объект.ФайлПрочитанЗагрузкаКадровыхИзменений = Ложь;
	КонецПопытки;	
	
	Если НЕ Объект.ФайлПрочитанЗагрузкаКадровыхИзменений Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧСотрудникиЗагрузкаКадровыхИзменений(ТаблицаДанных);
	//+++АСТБ_Горюшин_Алексей_48019
	Если Объект.ЗагружатьТолькоДолжности
		ИЛИ Объект.ЗагружатьТолькоПодразделения
		ИЛИ Объект.ЗагружатьТолькоРабочиеМеста
		Тогда
		ВыполнитьАнализДанныхЗагрузкаСправочников();
	Иначе
	//---АСТБ_Горюшин_Алексей_48019
	ВыполнитьАнализДанныхЗагрузкаКадровыхИзменений();	
	//+++АСТБ_Горюшин_Алексей_48019
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_48019
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура ФайлЗагрузкаКадровыхИзмененийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 					= "Выбор файла";
	Диалог.Фильтр             			= НСтр("ru = 'Документ MS EXCEL (*.xls;*.xlsx)|*.xls;*.xlsx'");
	Диалог.МножественныйВыбор 			= Ложь;
	Диалог.ПроверятьСуществованиеФайла	= Истина;
	
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("Обработчик_Завершения_Загрузки_ЗагрузкаКадровыхИзменений", ЭтотОбъект, Диалог);
	НачатьПомещениеФайла(ОбработкаОкончанияЗагрузки, , Диалог, Истина, УникальныйИдентификатор);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура Обработчик_Завершения_Загрузки_ЗагрузкаКадровыхИзменений(Результат, ДопПараметры, Пар1, Пар2) Экспорт
	
	Если НЕ Результат Тогда
		Возврат
	КонецЕсли;	
	ПозицияРасширения = СтрНайти(Пар1, ".", НаправлениеПоиска.СКонца);
	Объект.РасширениеФайлаЗагрузкаКадровыхИзменений = Сред(Пар1, ПозицияРасширения+1, СтрДлина(Пар1)-ПозицияРасширения+1);
	Объект.ФайлЗагрузкаКадровыхИзменений = Пар1;
	Объект.ВременноеХранилищеЗагрузкаКадровыхИзменений = ДопПараметры;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ЗаполнитьТЧСотрудникиЗагрузкаКадровыхИзменений(ТаблицаДанных)
	
	ОтсутсвующиеКолонки = "";
	
	Если ТаблицаДанных.Колонки.Найти("ТипДокумента__Перемещение___Отсутствие___Увольнение___ПриемНаРаботу__") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Тип документа (""Перемещение"", ""Отсутствие"", ""Увольнение"", ""Прием на работу"")" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("НачалоПериодаОтсутствия") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Начало периода отсутствия" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КонецПериодаОтсутствия") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Конец периода отсутствия" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("ПричинаОтсутствия") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Причина отсутствия" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("_ТабельныйНомерСотрудника") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Табельный номер сотрудника" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииФиз_лица") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации Физ.лица" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("ФИОСотрудника") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: ФИО сотрудника" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииПодразделения") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации подразделения" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииПодразделения_родителя") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации подразделения-родителя" + Символы.ПС; 
	КонецЕсли;	
	
	Если ТаблицаДанных.Колонки.Найти("НаименованиеПодразделения") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование подразделения" + Символы.ПС; 
	КонецЕсли;	
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииДолжности") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации должности" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("НаименованиеДолжности") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование должности" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КоличествоСтавок") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Количество ставок" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодСинхронизацииРабочегоМеста") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код синхронизации рабочего места" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("НаименованиеРабочегоМеста") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Наименование рабочего места" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтсутсвующиеКолонки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОтсутсвующиеКолонки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		
		Если НЕ (ЗначениеЗаполнено(Строка.ТипДокумента__Перемещение___Отсутствие___Увольнение___ПриемНаРаботу__)
			ИЛИ ЗначениеЗаполнено(Строка._ТабельныйНомерСотрудника)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииФиз_лица)
			ИЛИ ЗначениеЗаполнено(Строка.ФИОСотрудника)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииПодразделения)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииПодразделения_родителя)
			ИЛИ ЗначениеЗаполнено(Строка.НаименованиеПодразделения)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииДолжности)
			ИЛИ ЗначениеЗаполнено(Строка.НаименованиеДолжности)
			ИЛИ ЗначениеЗаполнено(Строка.КодСинхронизацииРабочегоМеста)
			ИЛИ ЗначениеЗаполнено(Строка.НаименованиеРабочегоМеста)
			ИЛИ ЗначениеЗаполнено(Строка.КоличествоСтавок))
			Тогда
		    Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.СотрудникиЗагрузкаКадровыхИзменений.Добавить();
		НоваяСтрока.ТипДокумента                                 = СокрЛП(Строка.ТипДокумента__Перемещение___Отсутствие___Увольнение___ПриемНаРаботу__);
		НоваяСтрока.НачалоПериодаОтсутствия                      = ?(ЗначениеЗаполнено(СокрЛП(Строка.НачалоПериодаОтсутствия)),Дата(Сред(СокрЛП(Строка.НачалоПериодаОтсутствия),7,4),Сред(СокрЛП(Строка.НачалоПериодаОтсутствия),4,2),Сред(СокрЛП(Строка.НачалоПериодаОтсутствия),1,2)),Дата("00010101"));
		НоваяСтрока.КонецПериодаОтсутствия                       = ?(ЗначениеЗаполнено(СокрЛП(Строка.КонецПериодаОтсутствия)),Дата(Сред(СокрЛП(Строка.КонецПериодаОтсутствия),7,4),Сред(СокрЛП(Строка.КонецПериодаОтсутствия),4,2),Сред(СокрЛП(Строка.КонецПериодаОтсутствия),1,2)),Дата("00010101"));
		НоваяСтрока.ПричинаОтсутствияИзФайла                     = СокрЛП(Строка.ПричинаОтсутствия);
		НоваяСтрока.ФИОСотрудникаИзФайла                         = СокрЛП(Строка.ФИОСотрудника);
		НоваяСтрока.ТабельныйНомерСотрудникаИзФайла              = СокрЛП(Строка._ТабельныйНомерСотрудника);
		НоваяСтрока.КодСинхронизацииФизлицаИзФайла               = СокрЛП(Строка.КодСинхронизацииФиз_лица);
		НоваяСтрока.ЕстьКодСинхронизацииФизлицаИзФайла           = НЕ ПустаяСтрока(СокрЛП(НоваяСтрока.КодСинхронизацииФизлицаИзФайла));    
		НоваяСтрока.НаименованиеПодразделенияИзФайла             = СокрЛП(Строка.НаименованиеПодразделения);
		НоваяСтрока.КодСинхронизацииПодразделенияИзФайла         = СокрЛП(Строка.КодСинхронизацииПодразделения);
		НоваяСтрока.КодСинхронизацииПодразделенияРодителяИзФайла = СокрЛП(Строка.КодСинхронизацииПодразделения_родителя);
		НоваяСтрока.НаименованиеДолжностиИзФайла                 = СокрЛП(Строка.НаименованиеДолжности);
		НоваяСтрока.КодСинхронизацииДолжностиИзФайла             = СокрЛП(Строка.КодСинхронизацииДолжности);
		НоваяСтрока.ЕстьКодСинхронизацииДолжностиИзФайла         = НЕ ПустаяСтрока(СокрЛП(Строка.КодСинхронизацииДолжности));
		НоваяСтрока.НовоеКоличествоСтавок                        = СокрЛП(Строка.КоличествоСтавок);
		НоваяСтрока.НаименованиеРабочегоМестаИзФайла             = СокрЛП(Строка.НаименованиеРабочегоМеста);
		НоваяСтрока.КодСинхронизацииРабочегоМестаИзФайла         = СокрЛП(Строка.КодСинхронизацииРабочегоМеста);
		НоваяСтрока.ЕстьКодСинхронизацииРабочегоМестаИзФайла     = НЕ ПустаяСтрока(СокрЛП(Строка.КодСинхронизацииРабочегоМеста));
		
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Строка.ФИОСотрудника), " ", Истина);
		Счетчик = 0;
		Для Каждого Подстрока Из ФИО Цикл
			Если Счетчик = 0 Тогда
				НоваяСтрока.ФамилияСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик = 1 Тогда
				НоваяСтрока.ИмяСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик = 2 Тогда
				НоваяСтрока.ОтчествоСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик > 2 Тогда
				НоваяСтрока.ОтчествоСотрудникаИзФайла = НоваяСтрока.ОтчествоСотрудникаИзФайла + " " + Подстрока;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;			
			
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура ОрганизацияЗагрузкаКадровыхИзмененийПриИзменении(Элемент)
	ИзменитьВидимостьЭлементовЗагрузкаКадровыхИзменений();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ИзменитьВидимостьЭлементовЗагрузкаКадровыхИзменений()
	
	//+++АСТБ_Горюшин_Алексей_48019
	//было
	//Если Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста Тогда
	//	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаРабочееМесто.Видимость = Истина;
	//Иначе 
	//	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаРабочееМесто.Видимость = Ложь;
	//КонецЕсли;
	//---АСТБ_Горюшин_Алексей_48019
	
	//+++АСТБ_Горюшин_Алексей_48019
	Объект.ЗагружатьТолькоРабочиеМеста = Объект.ЗагружатьТолькоРабочиеМеста И Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста;
	Объект.ИспользуетсяШтатноеРасписание = ЕстьЗаписиШР();
	
	Если Объект.ЗагружатьТолькоДолжности
		ИЛИ Объект.ЗагружатьТолькоПодразделения
		ИЛИ Объект.ЗагружатьТолькоРабочиеМеста
		Тогда
		ЗагружатьТолькоСправочники  = Истина;
	Иначе
		ЗагружатьТолькоСправочники  = Ложь;
	КонецЕсли;
	
	Элементы.ЗагружатьТолькоРабочиеМеста.Видимость 										= Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста;
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийТипДокумента.Видимость 					= НЕ ЗагружатьТолькоСправочники;
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаОтсутствие.Видимость 				= НЕ ЗагружатьТолькоСправочники;
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаСотрудник.Видимость 				= НЕ ЗагружатьТолькоСправочники;
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаФизлицо.Видимость 				= НЕ ЗагружатьТолькоСправочники;
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаПодразделенияРодитель.Видимость	= ?(ЗагружатьТолькоСправочники, Объект.ЗагружатьТолькоПодразделения, Истина); 
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаПодразделения.Видимость 			= ?(ЗагружатьТолькоСправочники, Объект.ЗагружатьТолькоПодразделения, Истина);
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаДолжность.Видимость 				= ?(ЗагружатьТолькоСправочники, Объект.ЗагружатьТолькоДолжности, Истина);
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаРабочееМесто.Видимость 			= ?(ЗагружатьТолькоСправочники, Объект.ЗагружатьТолькоРабочиеМеста И Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста, Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста);
	Элементы.СотрудникиЗагрузкаКадровыхИзмененийГруппаСтавки.Видимость					= Объект.ИспользуетсяШтатноеРасписание;
	//---АСТБ_Горюшин_Алексей_48019
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ВыполнитьАнализДанныхЗагрузкаКадровыхИзменений()
	
	ТаблицаСотрудники = Объект.СотрудникиЗагрузкаКадровыхИзменений.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.ТипДокумента КАК ТипДокумента,
	|	ТаблицаСотрудники.НачалоПериодаОтсутствия КАК НачалоПериодаОтсутствия,
	|	ТаблицаСотрудники.КонецПериодаОтсутствия КАК КонецПериодаОтсутствия,
	|	ТаблицаСотрудники.ПричинаОтсутствияИзФайла КАК ПричинаОтсутствияИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	|ИЗ
	|	&ТаблицаСотрудники КАК ТаблицаСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	Сотрудники.ФизическоеЛицо КАК ФизлицоИзСотрудника
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ВЫБОР
	|				КОГДА &ИзменятьФИО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = Сотрудники.Наименование
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = Сотрудники.ТабельныйНомер
	|			И (Сотрудники.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК Физлицо,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла
	|ПОМЕСТИТЬ ВТ_Физлица
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.ФамилияСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Фамилия
	|			И ВТ_ТаблицаСотрудники.ИмяСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Имя
	|			И ВТ_ТаблицаСотрудники.ОтчествоСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Отчество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделение,
	|	Подразделения.Родитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла
	|ПОМЕСТИТЬ ВТ_Подразделения
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = Подразделения.КодСинхронизации
	//+++АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = Подразделения.Наименование)
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла
	|ПОМЕСТИТЬ ВТ_ПодразделенияРодители
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = Подразделения.КодСинхронизации
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Должности.Ссылка КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	|ПОМЕСТИТЬ ВТ_Должности
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолжностиИПрофессии КАК Должности
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = Должности.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = Должности.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_РабочиеМеста
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
	|		ПО (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = РабочиеМестаАСТБ.Наименование
	|							И РабочиеМестаАСТБ.Владелец = &Организация
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПричиныОтсутствияНаРаботе.Ссылка КАК ПричинаОтсутствия,
	|	ВТ_ТаблицаСотрудники.ПричинаОтсутствияИзФайла КАК ПричинаОтсутствияИзФайла
	|ПОМЕСТИТЬ ВТ_ПричиныОтсутствия
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПричиныОтсутствияНаРаботе КАК ПричиныОтсутствияНаРаботе
	|		ПО ВТ_ТаблицаСотрудники.ПричинаОтсутствияИзФайла = ПричиныОтсутствияНаРаботе.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК ТекущееПодразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность КАК ТекущаяДолжность,
	|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК ТекущееРабочееМесто,
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток КАК ТекущееКоличествоСтавок,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение.Родитель КАК ТекущееПодразделениеРодитель
	|ПОМЕСТИТЬ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			,
	|			Организация = &Организация
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ЗанятыеРабочиеМестаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НачалоПериодаОтсутствия КАК НачалоПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники.КонецПериодаОтсутствия КАК КонецПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники.ПричинаОтсутствияИзФайла КАК ПричинаОтсутствияИзФайла,
	|	ВТ_ТаблицаСотрудники.ТипДокумента КАК ТипДокумента,
	|	ВТ_Должности.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_Подразделения.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА &УчитыватьФизическоеЛицо
	|			ТОГДА ВЫБОР
	|					КОГДА &ИзменятьФИО
	|						ТОГДА ВТ_Сотрудники.ФизлицоИзСотрудника
	|					КОГДА ВТ_Сотрудники.ФизлицоИзСотрудника = ВТ_Физлица.Физлицо
	|						ТОГДА ВТ_Сотрудники.ФизлицоИзСотрудника
	|					ИНАЧЕ ВТ_Физлица.Физлицо
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Сотрудники.ФизлицоИзСотрудника
	|	КОНЕЦ КАК Физлицо,
	|	ВЫБОР
	|		КОГДА &УчитыватьФизическоеЛицо
	|			ТОГДА ВЫБОР
	|					КОГДА &ИзменятьФИО
	|						ТОГДА ЛОЖЬ
	|					КОГДА ВТ_Сотрудники.ФизлицоИзСотрудника = ВТ_Физлица.Физлицо
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьФизЛицо,
	|	ВЫБОР
	|		КОГДА &ИзменятьФИО
	|				И ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла <> ВТ_Сотрудники.Сотрудник.Наименование
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьФИО,
	//+++АсТБ_Alexey_103109_********************************************************************
	|	ЕСТЬNULL(ВТ_РабочиеМеста.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто,
	//---АсТБ_Alexey_103109_********************************************************************
	|	ВТ_ПричиныОтсутствия.ПричинаОтсутствия КАК ПричинаОтсутствия
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ПО ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = ВТ_Сотрудники.ФИОСотрудникаИзФайла
	|			И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = ВТ_Сотрудники.ТабельныйНомерСотрудникаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Физлица КАК ВТ_Физлица
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ВТ_Физлица.КодСинхронизацииФизлицаИзФайла
	|			И ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = ВТ_Физлица.ФИОСотрудникаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = ВТ_Подразделения.КодСинхронизацииПодразделенияИзФайла
	//+++АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = ВТ_Подразделения.НаименованиеПодразделенияИзФайла)
	//---АсТБ_Alexey_109603_********************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияРодители КАК ВТ_ПодразделенияРодители
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = ВТ_ПодразделенияРодители.КодСинхронизацииПодразделенияРодителяИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должности КАК ВТ_Должности
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_Должности.КодСинхронизацииДолжностиИзФайла
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	|			И (&ИскатьДолжностиТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_Должности.НаименованиеДолжностиИзФайла)
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеМеста КАК ВТ_РабочиеМеста
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = ВТ_РабочиеМеста.КодСинхронизацииРабочегоМестаИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = ВТ_РабочиеМеста.НаименованиеРабочегоМестаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПричиныОтсутствия КАК ВТ_ПричиныОтсутствия
	|		ПО ВТ_ТаблицаСотрудники.ПричинаОтсутствияИзФайла = ВТ_ПричиныОтсутствия.ПричинаОтсутствияИзФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок, 0) КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)) КАК НоваяДолжность,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо КАК Физлицо,
	//+++АсТБ_Alexey_103109_********************************************************************
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееКоличествоСтавок, 0) КАК ТекущееКоличествоСтавок,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	//---АсТБ_Alexey_103109_********************************************************************
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо КАК ИзменитьФизЛицо,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО КАК ИзменитьФИО,
	|	NULL КАК НачалоПериодаОтсутствия,
	|	NULL КАК КонецПериодаОтсутствия,
	|	NULL КАК ПричинаОтсутствияИзФайла,
	|	NULL КАК ПричинаОтсутствия,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Итоговая
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	//+++АсТБ_Alexey_103109_********************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто
	//---АсТБ_Alexey_103109_********************************************************************
	|ГДЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Прием на работу""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок, 0),
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)),
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)),
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)),
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееКоличествоСтавок, 0),
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)),
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник
	|ГДЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Перемещение""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла,
	|	0,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееКоличествоСтавок, 0),
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение.КодСинхронизации
	//+++АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение.Наименование)
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение.Владелец = &Организация) 
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	|			И (ВЫБОР
	|				КОГДА &ИскатьДолжностиТолькоПоКодуСинхронизации
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла
	|								ТОГДА ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность.КодСинхронизации
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла
	|							ТОГДА ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность.КодСинхронизации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			КОНЕЦ)         
	|			И (&ИскатьДолжностиТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность.Наименование)
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто.Наименование
	|							И ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто.Владелец = &Организация
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Увольнение""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла,
	|	0,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееКоличествоСтавок, 0),
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НачалоПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КонецПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ПричинаОтсутствияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ПричинаОтсутствия,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник
	|ГДЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Отсутствие""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла,
	|	0,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НачалоПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КонецПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ПричинаОтсутствияИзФайла,
	|	NULL,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ГДЕ
	|	НЕ(ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Прием на работу""
	|				ИЛИ ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Перемещение""
	|				ИЛИ ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Увольнение""
	|				ИЛИ ВТ_ТаблицаСотрудники_НовоеИзФайла.ТипДокумента = ""Отсутствие"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_Итоговая.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_Итоговая.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_Итоговая.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники_Итоговая.Физлицо КАК Физлицо,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок КАК ТекущееКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Прием на работу""
	|			ТОГДА ""Прием на работу""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Перемещение""
	|			ТОГДА ""Перемещение""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Увольнение""
	|			ТОГДА ""Увольнение""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Отсутствие""
	|			ТОГДА ""Отсутствие""
	|		ИНАЧЕ ""Не определен""
	|	КОНЕЦ КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Прием на работу""
	|			ТОГДА 1
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Перемещение""
	|			ТОГДА 2
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Увольнение""
	|			ТОГДА 4
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТипДокумента = ""Отсутствие""
	|			ТОГДА 3
	|		ИНАЧЕ 10
	|	КОНЕЦ КАК ПорядокДействийДляСортировки,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_Итоговая.НачалоПериодаОтсутствия КАК НачалоПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники_Итоговая.КонецПериодаОтсутствия КАК КонецПериодаОтсутствия,
	|	ВТ_ТаблицаСотрудники_Итоговая.ПричинаОтсутствияИзФайла КАК ПричинаОтсутствияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ПричинаОтсутствия КАК ПричинаОтсутствия
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Итоговая КАК ВТ_ТаблицаСотрудники_Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокДействийДляСортировки,
	|	Сотрудник
	|ИТОГИ ПО
	|	ТипДокумента,
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудники", ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
	Запрос.УстановитьПараметр("ИспользоватьРабочиеМеста", Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста);
	Запрос.УстановитьПараметр("УчитыватьФизическоеЛицо", Объект.УчитыватьФизическоеЛицоЗагрузкаКадровыхИзменений);
	Запрос.УстановитьПараметр("ИзменятьФИО", Объект.ИзменятьФИОЗагрузкаКадровыхИзменений);
	//+++АсТБ_Alexey_109603_********************************************************************
	Запрос.УстановитьПараметр("ИскатьПодразделенияТолькоПоКодуСинхронизации", Объект.ИскатьПодразделенияТолькоПоКодуСинхронизации);
	//---АсТБ_Alexey_109603_******************************************************************** 
	
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 <<<
	Запрос.УстановитьПараметр("ИскатьДолжностиТолькоПоКодуСинхронизации", Объект.ИскатьДолжностиТолькоПоКодуСинхронизации);
	//Танцюра А.Н. -- №133471 Расширение алгоритма поиска "Должностей" -- 11.10.2021 >>>
	
	Результат = Запрос.Выполнить();
	ТЗ_Результат = Результат.Выгрузить();
	ТЗ_Результат.Очистить();
	
	///////////
	// Группировка для Перемещения только одной строки по сотруднику
	ВыборкаТипДокумента = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипДокумента");
	
	Пока ВыборкаТипДокумента.Следующий() Цикл
		
		ВыборкаСотрудник = ВыборкаТипДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
		
		Пока ВыборкаСотрудник.Следующий() Цикл
			
			Выборка = ВыборкаСотрудник.Выбрать();
			ДобавлятьЗапись = Истина;
			
			Пока Выборка.Следующий() Цикл 
				
				Если ДобавлятьЗапись Тогда
					ТЗ_НоваяСтрока = ТЗ_Результат.Добавить();
					ЗаполнитьЗначенияСвойств(ТЗ_НоваяСтрока, Выборка);
				КонецЕсли;
				
				Если Выборка.ТипДокумента = "Перемещение" Тогда 
					ДобавлятьЗапись = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.СотрудникиЗагрузкаКадровыхИзменений.Очистить();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		НоваяСтрока = Объект.СотрудникиЗагрузкаКадровыхИзменений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ОбработатьСтроку = Истина;
		
		Если НоваяСтрока.ТипДокумента = "Не определен" Тогда
			ОбработатьСтроку = Ложь;
		ИначеЕсли НоваяСтрока.ТипДокумента = "Увольнение" И НоваяСтрока.ТекущееКоличествоСтавок = 0 Тогда
			ОбработатьСтроку = Ложь;
		//+++АсТБ_Alexey_103109_********************************************************************	
		ИначеЕсли НоваяСтрока.ТипДокумента = "Перемещение" Тогда
			Если НоваяСтрока.ТекущееКоличествоСтавок = НоваяСтрока.НовоеКоличествоСтавок И 
				НоваяСтрока.ТекущееПодразделение = НоваяСтрока.НовоеПодразделение И 
				НоваяСтрока.ТекущаяДолжность = НоваяСтрока.НоваяДолжность И
				НоваяСтрока.ТекущееРабочееМесто = НоваяСтрока.НовоеРабочееМесто Тогда
				ОбработатьСтроку = Ложь;
			КонецЕсли;	
		ИначеЕсли НоваяСтрока.ТипДокумента = "Прием на работу" Тогда
			Если НоваяСтрока.ТекущееПодразделение = НоваяСтрока.НовоеПодразделение И 
				НоваяСтрока.ТекущаяДолжность = НоваяСтрока.НоваяДолжность И
				НоваяСтрока.ТекущееРабочееМесто = НоваяСтрока.НовоеРабочееМесто Тогда
				ОбработатьСтроку = Ложь;
			КонецЕсли;	
		//---АсТБ_Alexey_103109_********************************************************************	
		КонецЕсли;
			
		НоваяСтрока.Обработать = ОбработатьСтроку;
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура СохранитьШаблонЗагрузкаКадровыхИзменений(Команда)
	
	АдресХранилищаДанных = СохранитьШаблонЗагрузкаКадровыхИзмененийНаСервере();
	//+++АСТБ_Горюшин_Алексей_48019_3
	ПараметрыСохранения = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыСохранения.ВыборКаталога = Истина;
	НачатьПолучениеФайлаССервера(АдресХранилищаДанных, "Шаблон загрузки кадровых изменений.xlsx", ПараметрыСохранения);
	//было
	//ВременныйКаталог = КаталогВременныхФайлов();
	//ФайлШаблона = ВременныйКаталог + "Шаблон загрузки кадровых изменений" + ".xlsx";
	//ПолучитьФайл(АдресХранилищаДанных, ФайлШаблона, Истина);
	//---АСТБ_Горюшин_Алексей_48019_3
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Функция СохранитьШаблонЗагрузкаКадровыхИзмененийНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("ШаблонЗагрузкиКадровыхИзменений");
	АдресХранилища = ПоместитьВоВременноеХранилище(Макет);
	Возврат АдресХранилища;
	
КонецФункции //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура СоздатьДокументыЗагрузкаКадровыхИзменений(Команда)
	//+++АСТБ_Горюшин_Алексей_48019
	Если Объект.ЗагружатьТолькоДолжности
		ИЛИ Объект.ЗагружатьТолькоПодразделения
		ИЛИ Объект.ЗагружатьТолькоРабочиеМеста
		Тогда
		СоздатьСправочникиЗагрузкаКадровыхИзмененийНаСервере();
	Иначе
	//---АСТБ_Горюшин_Алексей_48019
	СоздатьДокументыЗагрузкаКадровыхИзмененийНаСервере();
	//+++АСТБ_Горюшин_Алексей_48019
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_48019
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура СоздатьДокументыЗагрузкаКадровыхИзмененийНаСервере()
	
	СоздатьПриемНаРаботуЗагрузкаКадровыхИзменений();
	СоздатьКадровоеПеремещениеЗагрузкаКадровыхИзменений();
	СоздатьУвольнениеЗагрузкаКадровыхИзменений();
	СоздатьОтсутствиеНаРабочемМестеЗагрузкаКадровыхИзменений();
	
	ПрочитатьФайлЗагрузкаКадровыхИзмененийНаСервере(Объект.ВременноеХранилищеЗагрузкаКадровыхИзменений);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура СоздатьПриемНаРаботуЗагрузкаКадровыхИзменений()

	ДокументОбъект = Документы.ПриемНаРаботу.СоздатьДокумент();
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка"" (режим ""Загрузка кадровых изменений"")";
	ДокументОбъект.Организация 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
	ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
	ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать И Строка.ТипДокумента = "Прием на работу" Тогда
			
			Сотрудник 			= ПроверитьСоздатьСотрудникаЗагрузкаКадровыхИзменений(Строка);
			Подразделение 		= ПроверитьСоздатьПодразделениеЗагрузкаКадровыхИзменений(Строка);
			Должность 			= ПроверитьСоздатьДолжность(Строка);
			РабочееМесто        = ПроверитьСоздатьРабочееМестоЗагрузкаКадровыхИзменений(Строка);
			ЗанимаемыхСтавок	= Строка.НовоеКоличествоСтавок;
			
			Если ЗначениеЗаполнено(Сотрудник)
				И ЗначениеЗаполнено(Подразделение)
				И ЗначениеЗаполнено(Должность)
				И ЗначениеЗаполнено(ЗанимаемыхСтавок)
				Тогда
				
				НоваяСтрока = ДокументОбъект.Работники.Добавить();
				НоваяСтрока.Сотрудник 			= Сотрудник;
				НоваяСтрока.Подразделение 		= Подразделение;
				НоваяСтрока.Должность 			= Должность;
				НоваяСтрока.РабочееМесто 		= РабочееМесто;
				НоваяСтрока.ЗанимаемыхСтавок	= ЗанимаемыхСтавок;	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Строка не добавлена в приём! Не заполнено одно или несколько полей! Сотрудник """ + Сотрудник
					+ """, Подразделение """ + Подразделение
					+ """, Должность """ + Должность
					+ """, Занимаемых ставок """ + ЗанимаемыхСтавок + """";
				Сообщение.Сообщить();
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Работники.Количество() > 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи документа приема на работу!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();		
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Функция ПроверитьСоздатьСотрудникаЗагрузкаКадровыхИзменений(СтрокаДанных)
	
	Если НЕ (ЗначениеЗаполнено(СтрокаДанных.ФИОСотрудникаИзФайла)
		И ЗначениеЗаполнено(СтрокаДанных.ТабельныйНомерСотрудникаИзФайла))
		Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.Сотрудник) Тогда
		ЗаменитьФИО_СотрудникаЗагрузкаКадровыхИзменений(СтрокаДанных);
		ЗаменитьФЛ_В_СотрудникеЗагрузкаКадровыхИзменений(СтрокаДанных);
		Возврат СтрокаДанных.Сотрудник;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|		(ВЫБОР
		|				КОГДА &ИзменятьФИО
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Сотрудники.Наименование = &ФИОСотрудникаИзФайла
		|			КОНЕЦ)
		|	И Сотрудники.ТабельныйНомер = &ТабельныйНомерСотрудникаИзФайла
		|	И Сотрудники.Владелец = &Организация"; 

		Запрос.УстановитьПараметр("ФИОСотрудникаИзФайла", СтрокаДанных.ФИОСотрудникаИзФайла);
		Запрос.УстановитьПараметр("ТабельныйНомерСотрудникаИзФайла", СтрокаДанных.ТабельныйНомерСотрудникаИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
		Запрос.УстановитьПараметр("ИзменятьФИО", Объект.ИзменятьФИОЗагрузкаКадровыхИзменений);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.Сотрудник = РезультатЗапроса[0].Сотрудник;
			ЗаменитьФИО_СотрудникаЗагрузкаКадровыхИзменений(СтрокаДанных);
			ЗаменитьФЛ_В_СотрудникеЗагрузкаКадровыхИзменений(СтрокаДанных);
			Возврат РезультатЗапроса[0].Сотрудник;
		Иначе
			
			//Создание сотрудника
			СправочникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
			СправочникОбъект.ТабельныйНомер = СтрокаДанных.ТабельныйНомерСотрудникаИзФайла;
			СправочникОбъект.Наименование 	= СтрокаДанных.ФИОСотрудникаИзФайла;
			СправочникОбъект.ФизическоеЛицо	= ПроверитьСоздатьФизлицо(СтрокаДанных);
			СправочникОбъект.Владелец 		= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
			
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.Сотрудник = СправочникОбъект.Ссылка;
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи сотрудника!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.Сотрудники.ПустаяСсылка();
			КонецПопытки;	
				
		КонецЕсли;
	
	КонецЕсли;
	
КонецФункции //---АСТБ_Горюшин_Алексей_39805	

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ЗаменитьФИО_СотрудникаЗагрузкаКадровыхИзменений(СтрокаДанных)
	
	Если Объект.ИзменятьФИОЗагрузкаКадровыхИзменений Тогда
		
		СправочникОбъект = СтрокаДанных.Сотрудник.ПолучитьОбъект();
		СправочникОбъект.Наименование = СтрокаДанных.ФИОСотрудникаИзФайла;
		
		Попытка
			СправочникОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Изменены ФИО сотрудника " + СправочникОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи сотрудника!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ЗаменитьФЛ_В_СотрудникеЗагрузкаКадровыхИзменений(СтрокаДанных)
	
	Если Объект.УчитыватьФизическоеЛицоЗагрузкаКадровыхИзменений И НЕ СтрокаДанных.Сотрудник.ФизическоеЛицо = СтрокаДанных.Физлицо Тогда
		
		СправочникОбъект = СтрокаДанных.Сотрудник.ПолучитьОбъект();
		СправочникОбъект.ФизическоеЛицо	= ПроверитьСоздатьФизлицо(СтрокаДанных);
		
		Попытка
			СправочникОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Заменено физическое лицо у сотрудника " + СправочникОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи сотрудника!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Функция ПроверитьСоздатьПодразделениеЗагрузкаКадровыхИзменений(СтрокаДанных)
	
	Если НЕ (ЗначениеЗаполнено(СтрокаДанных.КодСинхронизацииПодразделенияИзФайла)
		И ЗначениеЗаполнено(СтрокаДанных.НаименованиеПодразделенияИзФайла))
		Тогда
		Возврат Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.НовоеПодразделение) Тогда
		ПроверитьСоздатьОбновитьПодразделениеРодитель(СтрокаДанных.НовоеПодразделение, СтрокаДанных);
		Возврат СтрокаДанных.НовоеПодразделение;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК НовоеПодразделение
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.КодСинхронизации = &КодСинхронизацииПодразделенияИзФайла
		//+++АсТБ_Alexey_109603_********************************************************************
		|	И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ Подразделения.Наименование = &НаименованиеПодразделенияИзФайла)
		//---АсТБ_Alexey_109603_********************************************************************
		|	И Подразделения.Владелец = &Организация";

		Запрос.УстановитьПараметр("КодСинхронизацииПодразделенияИзФайла", СтрокаДанных.КодСинхронизацииПодразделенияИзФайла);
		Запрос.УстановитьПараметр("НаименованиеПодразделенияИзФайла", СтрокаДанных.НаименованиеПодразделенияИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);	
		//+++АсТБ_Alexey_109603_********************************************************************
		Запрос.УстановитьПараметр("ИскатьПодразделенияТолькоПоКодуСинхронизации", Объект.ИскатьПодразделенияТолькоПоКодуСинхронизации);
		//---АсТБ_Alexey_109603_********************************************************************
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НовоеПодразделение = РезультатЗапроса[0].НовоеПодразделение;
			ПроверитьСоздатьОбновитьПодразделениеРодительЗагрузкаКадровыхИзменений(СтрокаДанных.НовоеПодразделение, СтрокаДанных);
			Возврат СтрокаДанных.НовоеПодразделение;
		Иначе
			
			//Создание подразделения
			СправочникОбъект = Справочники.Подразделения.СоздатьЭлемент();
			СправочникОбъект.Владелец 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииПодразделенияИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.НаименованиеПодразделенияИзФайла;
			СправочникОбъект.НаименованиеПолное	= СтрокаДанных.НаименованиеПодразделенияИзФайла;
			
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.НовоеПодразделение = СправочникОбъект.Ссылка;
				ПроверитьСоздатьОбновитьПодразделениеРодительЗагрузкаКадровыхИзменений(СправочникОбъект.Ссылка, СтрокаДанных);
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи подразделения!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.Подразделения.ПустаяСсылка();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура ПроверитьСоздатьОбновитьПодразделениеРодительЗагрузкаКадровыхИзменений(ПодчиненноеПодразделение, СтрокаДанных)
	
	//+++АСТБ_Горюшин_Алексей_48019
	Если НЕ Объект.УчитыватьГоловноеПодразделениеЗагрузкаКадровыхИзменений Тогда
		Возврат;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_48019
	
	Ошибка = Ложь;
	
	Если ЗначениеЗаполнено(СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла) 
		И НЕ ЗначениеЗаполнено(СтрокаДанных.НовоеПодразделениеРодитель) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.КодСинхронизации = &КодСинхронизацииПодразделенияРодителяИзФайла
		|	И Подразделения.Владелец = &Организация";
		
		Запрос.УстановитьПараметр("КодСинхронизацииПодразделенияРодителяИзФайла", СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НовоеПодразделениеРодитель = РезультатЗапроса[0].НовоеПодразделениеРодитель;
		Иначе
			
			//Создание подразделения родителя
			СправочникОбъект = Справочники.Подразделения.СоздатьЭлемент();
			СправочникОбъект.Владелец 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла;
			СправочникОбъект.НаименованиеПолное	= СтрокаДанных.КодСинхронизацииПодразделенияРодителяИзФайла;
			
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.НовоеПодразделениеРодитель = СправочникОбъект.Ссылка;
			Исключение	
				Ошибка = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи головного подразделения!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПодчиненноеПодразделение.Родитель <> СтрокаДанных.НовоеПодразделениеРодитель И НЕ Ошибка Тогда
		ПодчиненноеПодразделениеОбъект = ПодчиненноеПодразделение.ПолучитьОбъект();
		ПодчиненноеПодразделениеОбъект.Родитель = СтрокаДанных.НовоеПодразделениеРодитель;
		Попытка
			ПодчиненноеПодразделениеОбъект.Записать();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Записано головное подразделение подразделения " + ПодчиненноеПодразделение.Ссылка;
			Сообщение.Сообщить();
		Исключение	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи головного подразделения в поразделение!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Функция ПроверитьСоздатьРабочееМестоЗагрузкаКадровыхИзменений(СтрокаДанных)
	
	Если НЕ Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста Тогда
		Возврат Справочники.РабочиеМестаАСТБ.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.НаименованиеРабочегоМестаИзФайла) Тогда
		Возврат Справочники.РабочиеМестаАСТБ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.НовоеРабочееМесто) Тогда
		Возврат СтрокаДанных.НовоеРабочееМесто;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто
		|ИЗ
		|	Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьКодСинхронизацииРабочегоМестаИзФайла
		|				ТОГДА &КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И РабочиеМестаАСТБ.Наименование = &НаименованиеРабочегоМестаИзФайла
		|	И РабочиеМестаАСТБ.Владелец = &Организация";
		
		Запрос.УстановитьПараметр("ЕстьКодСинхронизацииРабочегоМестаИзФайла", СтрокаДанных.ЕстьКодСинхронизацииРабочегоМестаИзФайла);
		Запрос.УстановитьПараметр("КодСинхронизацииРабочегоМестаИзФайла", СтрокаДанных.КодСинхронизацииРабочегоМестаИзФайла);
		Запрос.УстановитьПараметр("НаименованиеРабочегоМестаИзФайла", СтрокаДанных.НаименованиеРабочегоМестаИзФайла);
		Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.НовоеРабочееМесто = РезультатЗапроса[0].НовоеРабочееМесто;
			Возврат РезультатЗапроса[0].НовоеРабочееМесто;
		Иначе
			
			//Создание рабочего места
			СправочникОбъект = Справочники.РабочиеМестаАСТБ.СоздатьЭлемент();
			СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииРабочегоМестаИзФайла;
			СправочникОбъект.Наименование 		= СтрокаДанных.НаименованиеРабочегоМестаИзФайла;
			СправочникОбъект.Владелец 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
			
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.НовоеРабочееМесто = СправочникОбъект.Ссылка;
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи рабочего места!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.РабочиеМестаАСТБ.ПустаяСсылка();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура УстановитьФлагЗагрузкаКадровыхИзменений(Команда)
	УстановитьЗначениеФлагаЗагрузкаКадровыхИзмененийНаСервере(Истина);
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаКлиенте
Процедура СнятьФлагЗагрузкаКадровыхИзменений(Команда)
	УстановитьЗначениеФлагаЗагрузкаКадровыхИзмененийНаСервере(Ложь);
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура УстановитьЗначениеФлагаЗагрузкаКадровыхИзмененийНаСервере(Значение)
	Для Каждого Строка Из Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		Строка.Обработать = Значение;
	КонецЦикла;
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура СоздатьКадровоеПеремещениеЗагрузкаКадровыхИзменений()
	
	ДокументОбъект = Документы.КадровоеПеремещение.СоздатьДокумент();
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка"" (режим ""Загрузка кадровых изменений"")";
	ДокументОбъект.Организация 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
	ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
	ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать И Строка.ТипДокумента = "Перемещение" Тогда
			
			Сотрудник 			= ПроверитьСоздатьСотрудникаЗагрузкаКадровыхИзменений(Строка);
			Подразделение 		= ПроверитьСоздатьПодразделениеЗагрузкаКадровыхИзменений(Строка);
			Должность 			= ПроверитьСоздатьДолжность(Строка);
			РабочееМесто        = ПроверитьСоздатьРабочееМестоЗагрузкаКадровыхИзменений(Строка);
			ЗанимаемыхСтавок	= Строка.НовоеКоличествоСтавок;
			
			Если ЗначениеЗаполнено(Сотрудник)
				И ЗначениеЗаполнено(Подразделение)
				И ЗначениеЗаполнено(Должность)
				И ЗначениеЗаполнено(ЗанимаемыхСтавок)
				Тогда
				
				НоваяСтрока = ДокументОбъект.Работники.Добавить();
				НоваяСтрока.Сотрудник 				= Сотрудник;
				НоваяСтрока.ПодразделениеНовое 		= Подразделение;
				НоваяСтрока.ДолжностьНовая 			= Должность;
				НоваяСтрока.РабочееМестоНовое 		= РабочееМесто;
				НоваяСтрока.ЗанимаемыхСтавокНовое	= ЗанимаемыхСтавок;
				НоваяСтрока.ПодразделениеСтарое 	= Строка.ТекущееПодразделение;
				НоваяСтрока.ДолжностьСтарая 		= Строка.ТекущаяДолжность;
				НоваяСтрока.РабочееМестоСтарое 		= Строка.ТекущееРабочееМесто;
				НоваяСтрока.ЗанимаемыхСтавокСтарое	= Строка.ТекущееКоличествоСтавок;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Строка не добавлена в перемещение! Не заполнено одно или несколько полей! Сотрудник """ + Сотрудник
					+ """, Подразделение новое """ + Подразделение
					+ """, Должность новая """ + Должность
					+ """, Занимаемых ставок """ + ЗанимаемыхСтавок + """";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Работники.Количество() > 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи документа перемещения!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();		
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура СоздатьУвольнениеЗагрузкаКадровыхИзменений()
	
	ДокументОбъект = Документы.Увольнение.СоздатьДокумент();
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка"" (режим ""Загрузка кадровых изменений"")";
	ДокументОбъект.Организация 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
	ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
	ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать И Строка.ТипДокумента = "Увольнение" И Строка.ТекущееКоличествоСтавок > 0 Тогда
			
			НоваяСтрока = ДокументОбъект.Работники.Добавить();
			НоваяСтрока.Сотрудник 			= Строка.Сотрудник;
			НоваяСтрока.Подразделение 		= Строка.ТекущееПодразделение;
			НоваяСтрока.Должность 			= Строка.ТекущаяДолжность;
			НоваяСтрока.РабочееМесто 		= Строка.ТекущееРабочееМесто;
			НоваяСтрока.ЗанимаемыхСтавок	= Строка.ТекущееКоличествоСтавок;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Работники.Количество() > 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка записи документа увольнения!" + Символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();		
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Процедура СоздатьОтсутствиеНаРабочемМестеЗагрузкаКадровыхИзменений()
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать И Строка.ТипДокумента = "Отсутствие" Тогда
			
			Если Месяц(Строка.НачалоПериодаОтсутствия) = Месяц(Строка.КонецПериодаОтсутствия)
				И Год(Строка.НачалоПериодаОтсутствия) = Год(Строка.КонецПериодаОтсутствия) Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Период отсутствия входит в календарный месяц. Документ ""Отсутствие на рабочем месте"" не создан. Сотрудник """ + Строка.ФИОСотрудникаИзФайла
					+ """, Начало периода """ + Формат(Строка.НачалоПериодаОтсутствия,"ДЛФ=D")
					+ """, Конец периода """ + Формат(Строка.КонецПериодаОтсутствия,"ДЛФ=D") + """";
				Сообщение.Сообщить();
				
				Продолжить;
				
			КонецЕсли;	
			
			Сотрудник 				= ПроверитьСоздатьСотрудникаЗагрузкаКадровыхИзменений(Строка);
			НачалоПериодаОтсутствия = Строка.НачалоПериодаОтсутствия;
			КонецПериодаОтсутствия	= Строка.КонецПериодаОтсутствия;
			ПричинаОтсутствия		= ПроверитьСоздатьПричинуОтсутствияЗагрузкаКадровыхИзменений(Строка);
			
			Если ЗначениеЗаполнено(Сотрудник)
				И ЗначениеЗаполнено(НачалоПериодаОтсутствия)
				И ЗначениеЗаполнено(КонецПериодаОтсутствия)
				И ЗначениеЗаполнено(ПричинаОтсутствия)
				Тогда
				
				ДокументОбъект = Документы.ОтсутствиеНаРабочемМесте.СоздатьДокумент();
				ДокументОбъект.Дата 				= ТекущаяДата();
				ДокументОбъект.Комментарий 			= "#Документ создан обработкой ""АСТБ Кадровая сверка"" (режим ""Загрузка кадровых изменений"")";
				ДокументОбъект.Организация 			= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
				ДокументОбъект.Ответственный 		= Пользователи.ТекущийПользователь();
				ДокументОбъект.СоздательДокумента	= Пользователи.ТекущийПользователь();
				
				ДокументОбъект.Сотрудник			= Сотрудник;
				ДокументОбъект.ДатаНачала			= НачалоПериодаОтсутствия;
				ДокументОбъект.ДатаОкончания		= КонецПериодаОтсутствия;
				ДокументОбъект.ПричинаОтсутствия	= ПричинаОтсутствия;
				
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Создан документ " + ДокументОбъект.Ссылка;
					Сообщение.Сообщить();
				Исключение
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Ошибка записи документа отсутствия!" + Символы.ПС + ОписаниеОшибки();
					Сообщение.Сообщить();		
				КонецПопытки;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Документ ""Отсутствие на рабочем месте"" не создан. Сотрудник """ + Строка.ФИОСотрудникаИзФайла
					+ """, Начало периода """ + Формат(Строка.НачалоПериодаОтсутствия,"ДЛФ=D")
					+ """, Конец периода """ + Формат(Строка.КонецПериодаОтсутствия,"ДЛФ=D")
					+ """, Причина отсутствия """ + Строка.ПричинаОтсутствияИзФайла + """";
				Сообщение.Сообщить();
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_39805	

//+++АСТБ_Горюшин_Алексей_39805
&НаСервере
Функция ПроверитьСоздатьПричинуОтсутствияЗагрузкаКадровыхИзменений(СтрокаДанных)
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.ПричинаОтсутствияИзФайла) Тогда
		Возврат Справочники.ПричиныОтсутствияНаРаботе.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.НовоеПодразделение) Тогда
		Возврат СтрокаДанных.ПричинаОтсутствия;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныОтсутствияНаРаботе.Ссылка КАК ПричинаОтсутствия
		|ИЗ
		|	Справочник.ПричиныОтсутствияНаРаботе КАК ПричиныОтсутствияНаРаботе
		|ГДЕ
		|	ПричиныОтсутствияНаРаботе.Наименование = &НаименованиеПричиныИзФайла";

		Запрос.УстановитьПараметр("НаименованиеПричиныИзФайла", СтрокаДанных.ПричинаОтсутствияИзФайла);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			СтрокаДанных.ПричинаОтсутствия = РезультатЗапроса[0].ПричинаОтсутствия;
			Возврат СтрокаДанных.ПричинаОтсутствия;
		Иначе
			
			//Создание причины отсутствия
			СправочникОбъект = Справочники.ПричиныОтсутствияНаРаботе.СоздатьЭлемент();
			СправочникОбъект.Наименование 		= СтрокаДанных.ПричинаОтсутствияИзФайла;
			
			Попытка
				СправочникОбъект.Записать();
				СтрокаДанных.ПричинаОтсутствия = СправочникОбъект.Ссылка;
				Возврат СправочникОбъект.Ссылка;  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи причины отсутствия!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат Справочники.ПричиныОтсутствияНаРаботе.ПустаяСсылка();
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //---АСТБ_Горюшин_Алексей_39805

//+++АСТБ_Горюшин_Алексей_48019
&НаКлиенте
Процедура ЗагружатьТолькоПодразделенияПриИзменении(Элемент)
	ПереключитьЗагрузкуСправочников();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаКлиенте
Процедура ЗагружатьТолькоДолжностиПриИзменении(Элемент)
	ПереключитьЗагрузкуСправочников();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаКлиенте
Процедура ЗагружатьТолькоРабочиеМестаПриИзменении(Элемент)
	ПереключитьЗагрузкуСправочников();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаКлиенте
Процедура ПереключитьЗагрузкуСправочников()
	
	Объект.СотрудникиЗагрузкаКадровыхИзменений.Очистить();
	ИзменитьВидимостьЭлементовЗагрузкаКадровыхИзменений();
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Функция ЕстьЗаписиШР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтатноеРасписание.Период КАК Период
		|ИЗ
		|	РегистрСведений.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Процедура ВыполнитьАнализДанныхЗагрузкаСправочников()
	
	ТаблицаСотрудники = Объект.СотрудникиЗагрузкаКадровыхИзменений.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	|ИЗ
	|	&ТаблицаСотрудники КАК ТаблицаСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделение,
	|	Подразделения.Родитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла
	|ПОМЕСТИТЬ ВТ_Подразделения
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = Подразделения.КодСинхронизации
	//+++АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = Подразделения.Наименование)
	//---АсТБ_Alexey_109603_********************************************************************
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла
	|ПОМЕСТИТЬ ВТ_ПодразделенияРодители
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = Подразделения.КодСинхронизации
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Должности.Ссылка КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	|ПОМЕСТИТЬ ВТ_Должности
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолжностиИПрофессии КАК Должности
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = Должности.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = Должности.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_РабочиеМеста
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
	|		ПО (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = РабочиеМестаАСТБ.Наименование
	|							И РабочиеМестаАСТБ.Владелец = &Организация
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок
	|	КОНЕЦ КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_Должности.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)) КАК НоваяДолжность,
	|	ЕСТЬNULL(ВТ_Подразделения.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_Подразделения.ТекущееПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК ТекущееПодразделениеРодитель,
	|	ЕСТЬNULL(ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделениеРодитель,
	|	ЕСТЬNULL(ВТ_РабочиеМеста.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = ВТ_Подразделения.КодСинхронизацииПодразделенияИзФайла
	//+++АсТБ_Alexey_109603_********************************************************************
	|			И (&ИскатьПодразделенияТолькоПоКодуСинхронизации ИЛИ ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = ВТ_Подразделения.НаименованиеПодразделенияИзФайла)
	//---АсТБ_Alexey_109603_********************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияРодители КАК ВТ_ПодразделенияРодители
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = ВТ_ПодразделенияРодители.КодСинхронизацииПодразделенияРодителяИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должности КАК ВТ_Должности
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_Должности.КодСинхронизацииДолжностиИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_Должности.НаименованиеДолжностиИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеМеста КАК ВТ_РабочиеМеста
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = ВТ_РабочиеМеста.КодСинхронизацииРабочегоМестаИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = ВТ_РабочиеМеста.НаименованиеРабочегоМестаИзФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Период КАК Период,
	|	ШтатноеРасписаниеСрезПоследних.Организация КАК Организация,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение КАК ТекущееПодразделение,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение.Родитель КАК ТекущееПодразделениеРодитель,
	|	ШтатноеРасписаниеСрезПоследних.Должность КАК ТекущаяДолжность,
	|	ШтатноеРасписаниеСрезПоследних.КоличествоСтавок КАК ТекущееКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(&ПериодШР, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееПодразделениеРодитель, ВТ_ТаблицаСотрудники_НовоеИзФайла.ТекущееПодразделениеРодитель) КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто КАК ТекущееРабочееМесто,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок, 0) КАК ТекущееКоличествоСтавок,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееПодразделение, ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение) КАК ТекущееПодразделение,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущаяДолжность, ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность) КАК ТекущаяДолжность
	|ПОМЕСТИТЬ ВТ_ПодготовленнаяТаблица
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение = ВТ_ШтатноеРасписание.ТекущееПодразделение
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность = ВТ_ШтатноеРасписание.ТекущаяДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодготовленнаяТаблица.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ПодготовленнаяТаблица.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ПодготовленнаяТаблица.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВТ_ПодготовленнаяТаблица.ТекущееКоличествоСтавок КАК ТекущееКоличествоСтавок,
	|	ВТ_ПодготовленнаяТаблица.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ПодготовленнаяТаблица.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоДолжности
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НоваяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущаяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НоваяДолжность = ВТ_ПодготовленнаяТаблица.ТекущаяДолжность
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьДолжность,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоПодразделения
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделение = ВТ_ПодготовленнаяТаблица.ТекущееПодразделение
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьПодразделение,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоПодразделения И &УчитыватьГоловноеПодразделение
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|                           И НЕ ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияРодителяИзФайла = """"
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель = ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьПодразделениеРодитель,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоРабочиеМеста
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто = ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьРабочееМесто
	|ИЗ
	|	ВТ_ПодготовленнаяТаблица КАК ВТ_ПодготовленнаяТаблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	НовоеПодразделениеРодитель,
	|	НовоеПодразделение,
	|	НоваяДолжность,
	|	НовоеРабочееМесто
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудники", ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
	Запрос.УстановитьПараметр("ИспользоватьРабочиеМеста", Объект.ОрганизацияЗагрузкаКадровыхИзменений.ИспользоватьРабочиеМеста);
	Запрос.УстановитьПараметр("ПериодШР", ТекущаяДата());
	Запрос.УстановитьПараметр("ЗагружатьТолькоДолжности", Объект.ЗагружатьТолькоДолжности);
	Запрос.УстановитьПараметр("ЗагружатьТолькоПодразделения", Объект.ЗагружатьТолькоПодразделения);
	Запрос.УстановитьПараметр("ЗагружатьТолькоРабочиеМеста", Объект.ЗагружатьТолькоРабочиеМеста);
	Запрос.УстановитьПараметр("УчитыватьГоловноеПодразделение", Объект.УчитыватьГоловноеПодразделениеЗагрузкаКадровыхИзменений);
	//+++АсТБ_Alexey_109603_********************************************************************
	Запрос.УстановитьПараметр("ИскатьПодразделенияТолькоПоКодуСинхронизации", Объект.ИскатьПодразделенияТолькоПоКодуСинхронизации);
	//---АсТБ_Alexey_109603_********************************************************************
	
	Результат = Запрос.Выполнить();
	ТЗ_Результат = Результат.Выгрузить();
	
	Объект.СотрудникиЗагрузкаКадровыхИзменений.Очистить();
	//установка флажков
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		НоваяСтрока = Объект.СотрудникиЗагрузкаКадровыхИзменений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ОбработатьСтроку = Ложь;
		
		Если Строка.ЗагружатьДолжность
			ИЛИ Строка.ЗагружатьПодразделение 
			ИЛИ Строка.ЗагружатьПодразделениеРодитель
			ИЛИ Строка.ЗагружатьРабочееМесто
			Тогда
			ОбработатьСтроку = Истина;	
		КонецЕсли;
			
		НоваяСтрока.Обработать = ОбработатьСтроку;
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Процедура СоздатьСправочникиЗагрузкаКадровыхИзмененийНаСервере()
	
	//Загрузка подразделений, долж, раб мес, ШР
	СоздатьСправочникПодразделения();
	СоздатьСправочникДолжности();
	СоздатьСправочникРабочиеМеста();
	ДобавитьЗаписьВШтатноеРасписание();
	
	ПрочитатьФайлЗагрузкаКадровыхИзмененийНаСервере(Объект.ВременноеХранилищеЗагрузкаКадровыхИзменений);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Процедура СоздатьСправочникПодразделения()
	
	Если НЕ Объект.ЗагружатьТолькоПодразделения Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать Тогда
			
			Подразделение = ПроверитьСоздатьПодразделениеЗагрузкаКадровыхИзменений(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019	

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Процедура СоздатьСправочникДолжности()
	
	Если НЕ Объект.ЗагружатьТолькоДолжности Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать Тогда
			
			Должность = ПроверитьСоздатьДолжность(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Процедура СоздатьСправочникРабочиеМеста()
	
	Если НЕ Объект.ЗагружатьТолькоРабочиеМеста Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка ИЗ Объект.СотрудникиЗагрузкаКадровыхИзменений Цикл
		
		Если Строка.Обработать Тогда
			
			РабочееМесто = ПроверитьСоздатьРабочееМестоЗагрузкаКадровыхИзменений(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_48019
&НаСервере
Процедура ДобавитьЗаписьВШтатноеРасписание()
	
	Если НЕ Объект.ИспользуетсяШтатноеРасписание Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (Объект.ЗагружатьТолькоПодразделения И Объект.ЗагружатьТолькоДолжности) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСправочники = Объект.СотрудникиЗагрузкаКадровыхИзменений.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСправочники.Обработать КАК Обработать,
	|	ТаблицаСправочники.НоваяДолжность КАК НоваяДолжность,
	|	ТаблицаСправочники.НовоеПодразделение КАК НовоеПодразделение,
	|	ТаблицаСправочники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ТаблицаСправочники
	|ИЗ
	|	&ТаблицаСправочники КАК ТаблицаСправочники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСправочники.Обработать КАК Обработать,
	|	ВТ_ТаблицаСправочники.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСправочники.НовоеПодразделение КАК НовоеПодразделение,
	|	СУММА(ВТ_ТаблицаСправочники.НовоеКоличествоСтавок) КАК НовоеКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ТаблицаСправочники_Итоговая
	|ИЗ
	|	ВТ_ТаблицаСправочники КАК ВТ_ТаблицаСправочники
	|ГДЕ
	|	ВТ_ТаблицаСправочники.Обработать = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаСправочники.Обработать,
	|	ВТ_ТаблицаСправочники.НоваяДолжность,
	|	ВТ_ТаблицаСправочники.НовоеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Период КАК Период,
	|	ШтатноеРасписаниеСрезПоследних.Организация КАК Организация,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение КАК ТекущееПодразделение,
	|	ШтатноеРасписаниеСрезПоследних.Должность КАК ТекущаяДолжность,
	|	ШтатноеРасписаниеСрезПоследних.КоличествоСтавок КАК ТекущееКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(&ПериодШР, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСправочники_Итоговая.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСправочники_Итоговая.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ТаблицаСправочники_Итоговая.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВЫБОР
	|		КОГДА ВТ_ШтатноеРасписание.ТекущееПодразделение ЕСТЬ NULL
	|				ИЛИ ВТ_ШтатноеРасписание.ТекущаяДолжность ЕСТЬ NULL
	|				ИЛИ ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДелатьЗапись
	|ИЗ
	|	ВТ_ТаблицаСправочники_Итоговая КАК ВТ_ТаблицаСправочники_Итоговая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|		ПО ВТ_ТаблицаСправочники_Итоговая.НовоеПодразделение = ВТ_ШтатноеРасписание.ТекущееПодразделение
	|			И ВТ_ТаблицаСправочники_Итоговая.НоваяДолжность = ВТ_ШтатноеРасписание.ТекущаяДолжность
	|			И ВТ_ТаблицаСправочники_Итоговая.НовоеКоличествоСтавок = ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок";
	
	Запрос.УстановитьПараметр("ТаблицаСправочники", ТаблицаСправочники);
	Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияЗагрузкаКадровыхИзменений);
	Запрос.УстановитьПараметр("ПериодШР", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	ТЗ_Результат = Результат.Выгрузить();
	
	ДатаШР = ТекущаяДата();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		
		Если Строка.ДелатьЗапись Тогда
			
			РегистрШтатноеРасписание = РегистрыСведений.ШтатноеРасписание.СоздатьМенеджерЗаписи();
			РегистрШтатноеРасписание.Период    			= ДатаШР;
			РегистрШтатноеРасписание.Организация    	= Объект.ОрганизацияЗагрузкаКадровыхИзменений;
			РегистрШтатноеРасписание.Подразделение      = Строка.НовоеПодразделение;
			РегистрШтатноеРасписание.Должность 			= Строка.НоваяДолжность;
			РегистрШтатноеРасписание.КоличествоСтавок 	= Строка.НовоеКоличествоСтавок;
			
			Попытка
				РегистрШтатноеРасписание.Записать();  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи позиции штатного расписания!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019

//+++АСТБ_Горюшин_Алексей_49466
&НаКлиенте
Процедура СохранитьШаблонСверкиС_МВЗ(Команда)
	
	АдресХранилищаДанных = СохранитьШаблонС_МВЗНаСервере();
	//+++АСТБ_Горюшин_Алексей_48019_3
	ПараметрыСохранения = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыСохранения.ВыборКаталога = Истина;
	НачатьПолучениеФайлаССервера(АдресХранилищаДанных, "Шаблон кадровой сверки с МВЗ.xlsx", ПараметрыСохранения);
	//было
	//ВременныйКаталог = КаталогВременныхФайлов();
	//ФайлШаблона = ВременныйКаталог + "Шаблон кадровой сверки с МВЗ" + ".xlsx";
	//ПолучитьФайл(АдресХранилищаДанных, ФайлШаблона, Истина);
	//---АСТБ_Горюшин_Алексей_48019_3
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_49466

//+++АСТБ_Горюшин_Алексей_49466
&НаСервере
Функция СохранитьШаблонС_МВЗНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("ШаблонКадровойСверкиС_МВЗ");
	АдресХранилища = ПоместитьВоВременноеХранилище(Макет);
	Возврат АдресХранилища;
	
КонецФункции //---АСТБ_Горюшин_Алексей_49466

//+++АСТБ_Горюшин_Алексей_49466
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ОсобыеНастройки = "0";
	ИзменитьВидимостьЭлементов();
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_49466

//+++АСТБ_Горюшин_Алексей_49466
&НаСервере
Процедура ПроверитьИ_ЗаписатьМВЗ_Сотрудников()
	
	//+++АСТБ_Горюшин_Алексей_59691
	Если Объект.ОсобыеНастройки = "0" Тогда
		Возврат;
	КонецЕсли;
	//было
	//Если НЕ Объект.ОсобыеНастройки = "1" Тогда
	//	Возврат;
	//КонецЕсли;
	//---АСТБ_Горюшин_Алексей_59691
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Обработать Тогда
			
			ЗаписатьМВЗ_Сотрудника(Строка);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_49466

//+++АСТБ_Горюшин_Алексей_49466
&НаСервере
Процедура ЗаписатьМВЗ_Сотрудника(СтрокаДанных)
	
	//+++АСТБ_Горюшин_Алексей_59691
	Если Объект.ОсобыеНастройки = "0" Тогда
		Возврат;
	КонецЕсли;
	//было
	//Если НЕ Объект.ОсобыеНастройки = "1" Тогда
	//	Возврат;
	//КонецЕсли;
	//---АСТБ_Горюшин_Алексей_59691
	
	Если ПустаяСтрока(СтрокаДанных.НаименованиеМВЗСотрудникаИзФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Если (СтрокаДанных.ТекущееМВЗСотрудника <> СтрокаДанных.НовоеМВЗСотрудника
		И (СтрокаДанных.ТекущееМВЗСотрудника <> Справочники.МВЗ.ПустаяСсылка()
		ИЛИ СтрокаДанных.НовоеМВЗСотрудника <> Справочники.МВЗ.ПустаяСсылка()))
		//+++АСТБ_Горюшин_Алексей_59691
		ИЛИ СтрокаДанных.ТекущееМВЗСотрудника = Справочники.МВЗ.ПустаяСсылка()
		//---АСТБ_Горюшин_Алексей_59691
		Тогда
		
		Если ЗначениеЗаполнено(СтрокаДанных.НовоеМВЗСотрудника) Тогда
			НовоеМВЗСотрудника = СтрокаДанных.НовоеМВЗСотрудника;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МВЗ.Ссылка КАК НовоеМВЗСотрудника
			|ИЗ
			|	Справочник.МВЗ КАК МВЗ
			|ГДЕ
			|	МВЗ.Владелец = &Организация
			|	И ВЫБОР
			|			КОГДА &ЕстьКодСинхронизацииМВЗСотрудникаИзФайла
			|				ТОГДА &КодСинхронизацииМВЗСотрудникаИзФайла = МВЗ.КодСинхронизации
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И МВЗ.Наименование = &НаименованиеМВЗСотрудникаИзФайла";
			
			Запрос.УстановитьПараметр("ЕстьКодСинхронизацииМВЗСотрудникаИзФайла", СтрокаДанных.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла);
			Запрос.УстановитьПараметр("КодСинхронизацииМВЗСотрудникаИзФайла", СтрокаДанных.КодСинхронизацииМВЗСотрудникаИзФайла);
			Запрос.УстановитьПараметр("НаименованиеМВЗСотрудникаИзФайла", СтрокаДанных.НаименованиеМВЗСотрудникаИзФайла);
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			Если РезультатЗапроса.Количество() > 0 Тогда
				СтрокаДанных.НовоеМВЗСотрудника = РезультатЗапроса[0].НовоеМВЗСотрудника;
				НовоеМВЗСотрудника =  РезультатЗапроса[0].НовоеМВЗСотрудника;
			Иначе
				
				//Создание МВЗ
				СправочникОбъект = Справочники.МВЗ.СоздатьЭлемент();
				СправочникОбъект.КодСинхронизации 	= СтрокаДанных.КодСинхронизацииМВЗСотрудникаИзФайла;
				СправочникОбъект.Наименование 		= СтрокаДанных.НаименованиеМВЗСотрудникаИзФайла;
				СправочникОбъект.Владелец 			= Объект.Организация;
				
				Попытка
					СправочникОбъект.Записать();
					СтрокаДанных.НовоеМВЗСотрудника = СправочникОбъект.Ссылка;
					НовоеМВЗСотрудника =  СправочникОбъект.Ссылка;  
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Записано МВЗ в справочник: " + СправочникОбъект.Ссылка;
					Сообщение.Сообщить();
				Исключение	
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Ошибка записи МВЗ!" + Символы.ПС + ОписаниеОшибки();
					Сообщение.Сообщить();
					НовоеМВЗСотрудника = Справочники.МВЗ.ПустаяСсылка();
				КонецПопытки;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		//Запись в регистр сведений
		Если ЗначениеЗаполнено(НовоеМВЗСотрудника) Тогда
			
			МенеджерЗаписи = РегистрыСведений.МВЗСотрудников.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.Организация = Объект.Организация; 
			МенеджерЗаписи.Сотрудник = СтрокаДанных.Сотрудник; 
			МенеджерЗаписи.МВЗ = НовоеМВЗСотрудника; 
			
			Попытка
				МенеджерЗаписи.Записать();
				Сообщение = Новый СообщениеПользователю();
				//+++АСТБ_Горюшин_Алексей_59691
				ДействиеТекст = "";
				Если СтрокаДанных.Действие = "Замена МВЗ" Тогда
					Сообщение.Текст = "Обновлена запись в регистре ""МВЗ сотрудников"": Сотрудник - " + СтрокаДанных.Сотрудник + ", МВЗ - " + НовоеМВЗСотрудника;
				ИначеЕсли СтрокаДанных.Действие = "Создание МВЗ" Тогда
					Сообщение.Текст = "Добавлена запись в регистр ""МВЗ сотрудников"": Сотрудник - " + СтрокаДанных.Сотрудник + ", МВЗ - " + НовоеМВЗСотрудника;
				Иначе
					Сообщение.Текст = "Сделана запись в регистр ""МВЗ сотрудников"": Сотрудник - " + СтрокаДанных.Сотрудник + ", МВЗ - " + НовоеМВЗСотрудника;
				КонецЕсли;
				//было
				//Сообщение.Текст = "Сделана запись в регистр ""МВЗ сотрудников"": Сотрудник - " + СтрокаДанных.Сотрудник + ", МВЗ - " + НовоеМВЗСотрудника;
				//---АСТБ_Горюшин_Алексей_59691
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи в регистр ""МВЗ сотрудников""!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;		
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_49466

//+++АСТБ_Горюшин_Алексей_49466
&НаКлиенте
Процедура ОсобыеНастройкиПриИзменении(Элемент)
	ИзменитьВидимостьЭлементов();
КонецПроцедуры //---АСТБ_Горюшин_Алексей_49466

//+++АСТБ_Горюшин_Алексей_48019_2
&НаСервере
Функция ЕстьЗаписиШР_КадроваяСверка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтатноеРасписание.Период КАК Период
		|ИЗ
		|	РегистрСведений.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //---АСТБ_Горюшин_Алексей_48019_2

//+++АСТБ_Горюшин_Алексей_48019_2
&НаСервере
Процедура СоздатьСправочникПодразделения_КадроваяСверка()
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Действие = "Справочники" И Строка.Обработать Тогда
			
			Подразделение = ПроверитьСоздатьПодразделение(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019_2	

//+++АСТБ_Горюшин_Алексей_48019_2
&НаСервере
Процедура СоздатьСправочникДолжности_КадроваяСверка()
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Действие = "Справочники" И Строка.Обработать Тогда
			
			Должность = ПроверитьСоздатьДолжность(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019_2

//+++АСТБ_Горюшин_Алексей_48019_2
&НаСервере
Процедура СоздатьСправочникРабочиеМеста_КадроваяСверка()
	
	Для Каждого Строка ИЗ Объект.Сотрудники Цикл
		
		Если Строка.Действие = "Справочники" И Строка.Обработать Тогда
			
			РабочееМесто = ПроверитьСоздатьРабочееМесто(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019_2

//+++АСТБ_Горюшин_Алексей_48019_2 
&НаСервере
Процедура ДобавитьЗаписьВШтатноеРасписание_КадроваяСверка()
	
	Если НЕ Объект.ИспользуетсяШтатноеРасписание Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСправочники = Объект.Сотрудники.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСправочники.Обработать КАК Обработать,
	|	ТаблицаСправочники.НоваяДолжность КАК НоваяДолжность,
	|	ТаблицаСправочники.НовоеПодразделение КАК НовоеПодразделение,
	|	ТаблицаСправочники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ТаблицаСправочники
	|ИЗ
	|	&ТаблицаСправочники КАК ТаблицаСправочники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСправочники.Обработать КАК Обработать,
	|	ВТ_ТаблицаСправочники.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСправочники.НовоеПодразделение КАК НовоеПодразделение,
	|	СУММА(ВТ_ТаблицаСправочники.НовоеКоличествоСтавок) КАК НовоеКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ТаблицаСправочники_Итоговая
	|ИЗ
	|	ВТ_ТаблицаСправочники КАК ВТ_ТаблицаСправочники
	|ГДЕ
	|	ВТ_ТаблицаСправочники.Обработать = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаСправочники.Обработать,
	|	ВТ_ТаблицаСправочники.НоваяДолжность,
	|	ВТ_ТаблицаСправочники.НовоеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Период КАК Период,
	|	ШтатноеРасписаниеСрезПоследних.Организация КАК Организация,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение КАК ТекущееПодразделение,
	|	ШтатноеРасписаниеСрезПоследних.Должность КАК ТекущаяДолжность,
	|	ШтатноеРасписаниеСрезПоследних.КоличествоСтавок КАК ТекущееКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(&ПериодШР, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСправочники_Итоговая.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСправочники_Итоговая.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ТаблицаСправочники_Итоговая.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВЫБОР
	|		КОГДА ВТ_ШтатноеРасписание.ТекущееПодразделение ЕСТЬ NULL
	|				ИЛИ ВТ_ШтатноеРасписание.ТекущаяДолжность ЕСТЬ NULL
	|				ИЛИ ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДелатьЗапись
	|ИЗ
	|	ВТ_ТаблицаСправочники_Итоговая КАК ВТ_ТаблицаСправочники_Итоговая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|		ПО ВТ_ТаблицаСправочники_Итоговая.НовоеПодразделение = ВТ_ШтатноеРасписание.ТекущееПодразделение
	|			И ВТ_ТаблицаСправочники_Итоговая.НоваяДолжность = ВТ_ШтатноеРасписание.ТекущаяДолжность
	|			И ВТ_ТаблицаСправочники_Итоговая.НовоеКоличествоСтавок = ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок
	//+++АСТБ_Горюшин_Алексей_62460
	|ГДЕ
	|	ВТ_ТаблицаСправочники_Итоговая.НовоеКоличествоСтавок > 0
	|	И НЕ ВТ_ТаблицаСправочники_Итоговая.НовоеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаСправочники_Итоговая.НоваяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)";
	//---АСТБ_Горюшин_Алексей_62460
	
	Запрос.УстановитьПараметр("ТаблицаСправочники", ТаблицаСправочники);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодШР", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	ТЗ_Результат = Результат.Выгрузить();
	
	ДатаШР = ТекущаяДата();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		
		Если Строка.ДелатьЗапись Тогда
			
			РегистрШтатноеРасписание = РегистрыСведений.ШтатноеРасписание.СоздатьМенеджерЗаписи();
			РегистрШтатноеРасписание.Период    			= ДатаШР;
			РегистрШтатноеРасписание.Организация    	= Объект.Организация;
			РегистрШтатноеРасписание.Подразделение      = Строка.НовоеПодразделение;
			РегистрШтатноеРасписание.Должность 			= Строка.НоваяДолжность;
			РегистрШтатноеРасписание.КоличествоСтавок 	= Строка.НовоеКоличествоСтавок;
			
			Попытка
				РегистрШтатноеРасписание.Записать();  
			Исключение	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка записи позиции штатного расписания!" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_48019_2

//+++АСТБ_Горюшин_Алексей_59691
&НаКлиенте
Процедура СохранитьШаблонСверкиС_МВЗ_БезГП(Команда)
	
	АдресХранилищаДанных = СохранитьШаблонС_МВЗ_БезГПНаСервере();
	ПараметрыСохранения = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыСохранения.ВыборКаталога = Истина;
	НачатьПолучениеФайлаССервера(АдресХранилищаДанных, "Шаблон кадровой сверки с МВЗ без ГП.xlsx", ПараметрыСохранения);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_59691

//+++АСТБ_Горюшин_Алексей_59691
&НаСервере
Функция СохранитьШаблонС_МВЗ_БезГПНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("ШаблонКадровойСверкиС_МВЗ_БезГП");
	АдресХранилища = ПоместитьВоВременноеХранилище(Макет);
	Возврат АдресХранилища;
	
КонецФункции //---АСТБ_Горюшин_Алексей_59691

//+++АСТБ_Горюшин_Алексей_59691
&НаСервере
Процедура ЗаполнитьТЧСотрудники_МВЗ_БезГП(ТаблицаДанных)
	
	ОтсутсвующиеКолонки = "";
	
	Если ТаблицаДанных.Колонки.Найти("_ТабельныйНомер") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Табельный номер" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("ФИО") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: ФИО" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодПодразделения") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код подразделения" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("Подразделение") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Подразделение" + Символы.ПС; 
	КонецЕсли;	
	
	Если ТаблицаДанных.Колонки.Найти("КодДолжности") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код должности" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("Должность") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Должность" + Символы.ПС; 
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("МВЗ") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: МВЗ" + Символы.ПС;
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("КодМВЗ") = Неопределено Тогда
    	ОтсутсвующиеКолонки = ОтсутсвующиеКолонки + "Отсутствует колонка: Код МВЗ" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтсутсвующиеКолонки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОтсутсвующиеКолонки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		
		Если НЕ (ЗначениеЗаполнено(Строка._ТабельныйНомер)
			И ЗначениеЗаполнено(Строка.ФИО)
			И ЗначениеЗаполнено(Строка.КодПодразделения)
			И ЗначениеЗаполнено(Строка.Подразделение)
			И ЗначениеЗаполнено(Строка.Должность))
			Тогда
		    Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Сотрудники.Добавить();
		НоваяСтрока.ФИОСотрудникаИзФайла                         = СокрЛП(Строка.ФИО);
		НоваяСтрока.ТабельныйНомерСотрудникаИзФайла              = СокрЛП(Строка._ТабельныйНомер);
		НоваяСтрока.КодСинхронизацииФизлицаИзФайла               = ?(Объект.УчитыватьФизическоеЛицо, СокрЛП(Строка._ТабельныйНомер), "");
		НоваяСтрока.ЕстьКодСинхронизацииФизлицаИзФайла           = НЕ ПустаяСтрока(СокрЛП(НоваяСтрока.КодСинхронизацииФизлицаИзФайла));    
		НоваяСтрока.НаименованиеПодразделенияИзФайла             = СокрЛП(Строка.Подразделение);
		НоваяСтрока.КодСинхронизацииПодразделенияИзФайла         = СокрЛП(Строка.КодПодразделения);
		НоваяСтрока.КодСинхронизацииПодразделенияРодителяИзФайла = "";
		НоваяСтрока.НаименованиеДолжностиИзФайла                 = СокрЛП(Строка.Должность);
		НоваяСтрока.КодСинхронизацииДолжностиИзФайла             = СокрЛП(Строка.КодДолжности);
		НоваяСтрока.ЕстьКодСинхронизацииДолжностиИзФайла         = НЕ ПустаяСтрока(СокрЛП(Строка.КодДолжности));
		НоваяСтрока.НовоеКоличествоСтавок                        = 1;
		НоваяСтрока.НаименованиеРабочегоМестаИзФайла             = "";
		НоваяСтрока.КодСинхронизацииРабочегоМестаИзФайла         = "";
		НоваяСтрока.ЕстьКодСинхронизацииРабочегоМестаИзФайла     = НЕ ПустаяСтрока(СокрЛП(НоваяСтрока.КодСинхронизацииРабочегоМестаИзФайла));
		НоваяСтрока.НаименованиеМВЗСотрудникаИзФайла			 = СокрЛП(Строка.МВЗ);
		НоваяСтрока.КодСинхронизацииМВЗСотрудникаИзФайла		 = СокрЛП(Строка.КодМВЗ);
		НоваяСтрока.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла 	 = НЕ ПустаяСтрока(СокрЛП(НоваяСтрока.КодСинхронизацииМВЗСотрудникаИзФайла));
		
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Строка.ФИО), " ", Истина);
		Счетчик = 0;
		Для Каждого Подстрока Из ФИО Цикл
			Если Счетчик = 0 Тогда
				НоваяСтрока.ФамилияСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик = 1 Тогда
				НоваяСтрока.ИмяСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик = 2 Тогда
				НоваяСтрока.ОтчествоСотрудникаИзФайла = Подстрока;
			ИначеЕсли Счетчик > 2 Тогда
				НоваяСтрока.ОтчествоСотрудникаИзФайла = НоваяСтрока.ОтчествоСотрудникаИзФайла + " " + Подстрока;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;			
			
	КонецЦикла;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_59691

//+++АСТБ_Горюшин_Алексей_59691
&НаСервере
Процедура ВыполнитьАнализДанных_МВЗ_БезГП()
	
	ТаблицаСотрудники = Объект.Сотрудники.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Исходная
	|ИЗ
	|	&ТаблицаСотрудники КАК ТаблицаСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Исходная КАК ТаблицаСотрудники
	|ГДЕ
	|	НЕ(ТаблицаСотрудники.ФИОСотрудникаИзФайла = """"
	|				И ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	Сотрудники.ФизическоеЛицо КАК ФизлицоИзСотрудника
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ВЫБОР
	|				КОГДА &ИзменятьФИО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = Сотрудники.Наименование
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &ИзменятьТабельныйНомер
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = Сотрудники.ТабельныйНомер
	|			КОНЕЦ)
	|			И (Сотрудники.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК Физлицо,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла
	|ПОМЕСТИТЬ ВТ_Физлица
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.ФамилияСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Фамилия
	|			И ВТ_ТаблицаСотрудники.ИмяСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Имя
	|			И ВТ_ТаблицаСотрудники.ОтчествоСотрудникаИзФайла = ФИОФизическихЛицСрезПоследних.Отчество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделение,
	|	Подразделения.Родитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла
	|ПОМЕСТИТЬ ВТ_Подразделения
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = Подразделения.КодСинхронизации
	|			И ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = Подразделения.Наименование
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла
	|ПОМЕСТИТЬ ВТ_ПодразделенияРодители
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = Подразделения.КодСинхронизации
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование КАК Наименование,
	|	МИНИМУМ(ШтатноеРасписаниеСрезПоследних.Должность) КАК Должность
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШтатноеРасписание.Должность КАК Должность,
	|	ВТ_ШтатноеРасписание.Должность.Наименование КАК Наименование,
	|	ВТ_ШтатноеРасписание.Должность.КодСинхронизации КАК КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ДолжностиИзШР
	|ИЗ
	|	ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолжностиИПрофессии.Наименование КАК Наименование,
	|	МИНИМУМ(ДолжностиИПрофессии.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОднаДолжность
	|ИЗ
	|	Справочник.ДолжностиИПрофессии КАК ДолжностиИПрофессии
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолжностиИПрофессии.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОднаДолжность.Ссылка КАК Должность,
	|	ВТ_ОднаДолжность.Наименование КАК Наименование,
	|	ВТ_ОднаДолжность.Ссылка.КодСинхронизации КАК КодСинхронизации
	|ПОМЕСТИТЬ ВТ_РеквизитыИзОднойДолжности
	|ИЗ
	|	ВТ_ОднаДолжность КАК ВТ_ОднаДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДолжностиИзШР.Должность КАК ШР_Должность,
	|	ВТ_ДолжностиИзШР.Наименование КАК ШР_Наименование,
	|	ВТ_ДолжностиИзШР.КодСинхронизации КАК ШР_КодСинхронизации,
	|	ВТ_РеквизитыИзОднойДолжности.Должность КАК СПР_Должность,
	|	ВТ_РеквизитыИзОднойДолжности.Наименование КАК СПР_Наименование,
	|	ВТ_РеквизитыИзОднойДолжности.КодСинхронизации КАК СПР_КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ОбъединенныеДолжности
	|ИЗ
	|	ВТ_РеквизитыИзОднойДолжности КАК ВТ_РеквизитыИзОднойДолжности
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДолжностиИзШР КАК ВТ_ДолжностиИзШР
	|		ПО (ВТ_ДолжностиИзШР.Должность = ВТ_РеквизитыИзОднойДолжности.Должность)
	|			И (ВТ_ДолжностиИзШР.Наименование = ВТ_РеквизитыИзОднойДолжности.Наименование)
	|			И (ВТ_ДолжностиИзШР.КодСинхронизации = ВТ_РеквизитыИзОднойДолжности.КодСинхронизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности.СПР_Должность
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности.ШР_Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности.СПР_Наименование
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности.ШР_Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности.СПР_КодСинхронизации
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности.ШР_КодСинхронизации
	|	КОНЕЦ КАК КодСинхронизации,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоДолжностьИзШР
	|ПОМЕСТИТЬ ВТ_ПодготовленныеДолжности
	|ИЗ
	|	ВТ_ОбъединенныеДолжности КАК ВТ_ОбъединенныеДолжности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование КАК Наименование,
	|	ШтатноеРасписаниеСрезПоследних.Должность.КодСинхронизации КАК КодСинхронизации,
	|	МИНИМУМ(ШтатноеРасписаниеСрезПоследних.Должность) КАК Должность
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание_ЕстьКодСинхронизации
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование,
	|	ШтатноеРасписаниеСрезПоследних.Должность.КодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации.Должность КАК Должность,
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации.Должность.Наименование КАК Наименование,
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации.Должность.КодСинхронизации КАК КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ДолжностиИзШР_ЕстьКодСинхронизации
	|ИЗ
	|	ВТ_ШтатноеРасписание_ЕстьКодСинхронизации КАК ВТ_ШтатноеРасписание_ЕстьКодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолжностиИПрофессии.Наименование КАК Наименование,
	|	ДолжностиИПрофессии.КодСинхронизации КАК КодСинхронизации,
	|	МИНИМУМ(ДолжностиИПрофессии.Ссылка) КАК Должность
	|ПОМЕСТИТЬ ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации
	|ИЗ
	|	Справочник.ДолжностиИПрофессии КАК ДолжностиИПрофессии
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолжностиИПрофессии.КодСинхронизации,
	|	ДолжностиИПрофессии.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Должность КАК ШР_Должность,
	|	ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Наименование КАК ШР_Наименование,
	|	ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.КодСинхронизации КАК ШР_КодСинхронизации,
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Должность КАК СПР_Должность,
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Наименование КАК СПР_Наименование,
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.КодСинхронизации КАК СПР_КодСинхронизации
	|ПОМЕСТИТЬ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации
	|ИЗ
	|	ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации КАК ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДолжностиИзШР_ЕстьКодСинхронизации КАК ВТ_ДолжностиИзШР_ЕстьКодСинхронизации
	|		ПО (ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Должность = ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Должность)
	|			И (ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.Наименование = ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.Наименование)
	|			И (ВТ_ДолжностиИзШР_ЕстьКодСинхронизации.КодСинхронизации = ВТ_РеквизитыИзОднойДолжности_ЕстьКодСинхронизации.КодСинхронизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.СПР_Должность
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.СПР_Наименование
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.СПР_КодСинхронизации
	|		ИНАЧЕ ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_КодСинхронизации
	|	КОНЕЦ КАК КодСинхронизации,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации.ШР_Должность ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоДолжностьИзШР
	|ПОМЕСТИТЬ ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации
	|ИЗ
	|	ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации КАК ВТ_ОбъединенныеДолжности_ЕстьКодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|			ТОГДА ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.Должность
	|		ИНАЧЕ ВТ_ПодготовленныеДолжности.Должность
	|	КОНЕЦ КАК НоваяДолжность,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|			ТОГДА ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.ЭтоДолжностьИзШР
	|		ИНАЧЕ ВТ_ПодготовленныеДолжности.ЭтоДолжностьИзШР
	|	КОНЕЦ КАК ЭтоДолжностьИзШР,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	|ПОМЕСТИТЬ ВТ_Должности
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодготовленныеДолжности КАК ВТ_ПодготовленныеДолжности
	|		ПО ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_ПодготовленныеДолжности.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации КАК ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.КодСинхронизации
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_ПодготовленныеДолжности_ЕстьКодСинхронизации.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_РабочиеМеста
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
	|		ПО (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = РабочиеМестаАСТБ.Наименование
	|							И РабочиеМестаАСТБ.Владелец = &Организация
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК ТекущееПодразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность КАК ТекущаяДолжность,
	|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК ТекущееРабочееМесто,
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток КАК ТекущееКоличествоСтавок,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение.Родитель КАК ТекущееПодразделениеРодитель
	|ПОМЕСТИТЬ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			,
	|			Организация = &Организация
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ЗанятыеРабочиеМестаОстатки
	|ГДЕ
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК ТекущееПодразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность КАК ТекущаяДолжность,
	|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК ТекущееРабочееМесто,
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток КАК ТекущееКоличествоСтавок,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение.Родитель КАК ТекущееПодразделениеРодитель
	|ПОМЕСТИТЬ ВТ_ЗРМ_ЕстьВБазе_НетВФайле
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Сотрудник В
	|						(ВЫБРАТЬ
	|							ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник КАК Сотрудник
	|						ИЗ
	|							ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле)) КАК ЗанятыеРабочиеМестаОстатки
	|ГДЕ
	|	ЗанятыеРабочиеМестаОстатки.КоличествоОстаток >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗСотрудников.МВЗ КАК ТекущееМВЗСотрудника,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников_Текущие
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|		ПО ВТ_Сотрудники.Сотрудник = МВЗСотрудников.Сотрудник
	|			И (МВЗСотрудников.Организация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпрМВЗ.Ссылка КАК МВЗ,
	|	ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников_ИзСПР
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МВЗ КАК СпрМВЗ
	|		ПО (СпрМВЗ.Владелец = &Организация)
	|			И ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла = СпрМВЗ.Наименование
	|			И (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла = СпрМВЗ.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_Должности.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_Должности.ЭтоДолжностьИзШР КАК ЭтоДолжностьИзШР,
	|	ВТ_Подразделения.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА &УчитыватьФизическоеЛицо
	|			ТОГДА ВЫБОР
	|					КОГДА &ИзменятьФИО
	|						ТОГДА ВТ_Сотрудники.ФизлицоИзСотрудника
	|					КОГДА ВТ_Сотрудники.ФизлицоИзСотрудника = ВТ_Физлица.Физлицо
	|						ТОГДА ВТ_Сотрудники.ФизлицоИзСотрудника
	|					ИНАЧЕ ВТ_Физлица.Физлицо
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Сотрудники.ФизлицоИзСотрудника
	|	КОНЕЦ КАК Физлицо,
	|	ВЫБОР
	|		КОГДА &УчитыватьФизическоеЛицо
	|			ТОГДА ВЫБОР
	|					КОГДА &ИзменятьФИО
	|						ТОГДА ЛОЖЬ
	|					КОГДА ВТ_Сотрудники.ФизлицоИзСотрудника = ВТ_Физлица.Физлицо
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьФизЛицо,
	|	ВЫБОР
	|		КОГДА &ИзменятьФИО
	|				И ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла <> ВТ_Сотрудники.Сотрудник.Наименование
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьФИО,
	|	ВЫБОР
	|		КОГДА &ИзменятьТабельныйНомер
	|				И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла <> ВТ_Сотрудники.Сотрудник.ТабельныйНомер
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменитьТабельныйНомер,
	|	ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_МВЗСотрудников_ИзСПР.МВЗ КАК НовоеМВЗСотрудника,
	|	ВТ_РабочиеМеста.НовоеРабочееМесто КАК НовоеРабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ПО ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = ВТ_Сотрудники.ФИОСотрудникаИзФайла
	|			И ВТ_ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = ВТ_Сотрудники.ТабельныйНомерСотрудникаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Физлица КАК ВТ_Физлица
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла = ВТ_Физлица.КодСинхронизацииФизлицаИзФайла
	|			И ВТ_ТаблицаСотрудники.ФИОСотрудникаИзФайла = ВТ_Физлица.ФИОСотрудникаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = ВТ_Подразделения.КодСинхронизацииПодразделенияИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = ВТ_Подразделения.НаименованиеПодразделенияИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияРодители КАК ВТ_ПодразделенияРодители
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = ВТ_ПодразделенияРодители.КодСинхронизацииПодразделенияРодителяИзФайла
	|			И (&УчитыватьГоловноеПодразделение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должности КАК ВТ_Должности
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_Должности.КодСинхронизацииДолжностиИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_Должности.НаименованиеДолжностиИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеМеста КАК ВТ_РабочиеМеста
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = ВТ_РабочиеМеста.КодСинхронизацииРабочегоМестаИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = ВТ_РабочиеМеста.НаименованиеРабочегоМестаИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников_ИзСПР КАК ВТ_МВЗСотрудников_ИзСПР
	|		ПО ВТ_ТаблицаСотрудники.НаименованиеМВЗСотрудникаИзФайла = ВТ_МВЗСотрудников_ИзСПР.НаименованиеМВЗСотрудникаИзФайла
	|			И (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииМВЗСотрудникаИзФайла = ВТ_МВЗСотрудников_ИзСПР.КодСинхронизацииМВЗСотрудникаИзФайла
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок, 0) КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)) КАК НоваяДолжность,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.Физлицо КАК Физлицо,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ЕСТЬNULL(ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееКоличествоСтавок, 0) КАК ТекущееКоличествоСтавок,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФизЛицо КАК ИзменитьФизЛицо,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьТабельныйНомер КАК ИзменитьТабельныйНомер,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.ЭтоДолжностьИзШР, ЛОЖЬ) КАК ЭтоДолжностьИзШР,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ЕСТЬNULL(ВТ_МВЗСотрудников_Текущие.ТекущееМВЗСотрудника, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК ТекущееМВЗСотрудника,
	|	ЕСТЬNULL(ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеМВЗСотрудника, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК НовоеМВЗСотрудника,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ИзменитьФИО КАК ИзменитьФИО
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Итоговая
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле КАК ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_ЗРМ_ЕстьВБазе_ЕстьВФайле.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников_Текущие КАК ВТ_МВЗСотрудников_Текущие
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.Сотрудник = ВТ_МВЗСотрудников_Текущие.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.Сотрудник,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.Сотрудник.ФизическоеЛицо,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееПодразделение,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущаяДолжность,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееКоличествоСтавок,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееПодразделениеРодитель,
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле.ТекущееРабочееМесто,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_ЗРМ_ЕстьВБазе_НетВФайле КАК ВТ_ЗРМ_ЕстьВБазе_НетВФайле
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_Итоговая.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_Итоговая.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЭтоДолжностьИзШР КАК ЭтоДолжностьИзШР,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_Итоговая.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаСотрудники_Итоговая.Физлицо КАК Физлицо,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок КАК ТекущееКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеМВЗСотрудникаИзФайла КАК НаименованиеМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииМВЗСотрудникаИзФайла КАК КодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииМВЗСотрудникаИзФайла КАК ЕстьКодСинхронизацииМВЗСотрудникаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника КАК ТекущееМВЗСотрудника,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника КАК НовоеМВЗСотрудника,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок = 0
	|			ТОГДА ""Увольнение""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок = 0
	|			ТОГДА ""Прием""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность <> ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность
	|				ИЛИ ВЫБОР
	|					КОГДА &ИспользоватьРабочиеМеста
	|						ТОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто <> ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто
	|				КОНЕЦ
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок <> ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок
	|			ТОГДА ""Перемещение""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель
	|				И &УчитыватьГоловноеПодразделение
	|			ТОГДА ""Замена ГП""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФИО
	|			ТОГДА ""Замена ФИО""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФизЛицо
	|			ТОГДА ""Замена ФЛ""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьТабельныйНомер
	|			ТОГДА ""Замена ТН""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника
	|				И (ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|					ИЛИ ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка))
	|				И &ОсобыеНастройки = ""2""
	|				И ВТ_ТаблицаСотрудники_Итоговая.НаименованиеМВЗСотрудникаИзФайла <> """"
	|			ТОГДА ""Замена МВЗ""
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|				И &ОсобыеНастройки = ""2""
	|				И ВТ_ТаблицаСотрудники_Итоговая.НаименованиеМВЗСотрудникаИзФайла <> """"
	|			ТОГДА ""Создание МВЗ""
	|		ИНАЧЕ ""Не изменять""
	|	КОНЕЦ КАК Действие,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок = 0
	|			ТОГДА 9
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок = 0
	|			ТОГДА 7
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделение <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделение
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущаяДолжность <> ВТ_ТаблицаСотрудники_Итоговая.НоваяДолжность
	|				ИЛИ ВЫБОР
	|					КОГДА &ИспользоватьРабочиеМеста
	|						ТОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееРабочееМесто <> ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто
	|				КОНЕЦ
	|				ИЛИ ВТ_ТаблицаСотрудники_Итоговая.ТекущееКоличествоСтавок <> ВТ_ТаблицаСотрудники_Итоговая.НовоеКоличествоСтавок
	|			ТОГДА 8
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееПодразделениеРодитель <> ВТ_ТаблицаСотрудники_Итоговая.НовоеПодразделениеРодитель
	|				И &УчитыватьГоловноеПодразделение
	|			ТОГДА 3
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФИО
	|			ТОГДА 1
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьФизЛицо
	|			ТОГДА 2
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ИзменитьТабельныйНомер
	|			ТОГДА 4
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника
	|				И (ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|					ИЛИ ВТ_ТаблицаСотрудники_Итоговая.НовоеМВЗСотрудника <> ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка))
	|				И &ОсобыеНастройки = ""2""
	|				И ВТ_ТаблицаСотрудники_Итоговая.НаименованиеМВЗСотрудникаИзФайла <> """"
	|			ТОГДА 5
	|		КОГДА ВТ_ТаблицаСотрудники_Итоговая.ТекущееМВЗСотрудника = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|				И &ОсобыеНастройки = ""2""
	|				И ВТ_ТаблицаСотрудники_Итоговая.НаименованиеМВЗСотрудникаИзФайла <> """"
	|			ТОГДА 6
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокДействийДляСортировки,
	|	ВТ_ТаблицаСотрудники_Итоговая.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_Итоговая.НовоеРабочееМесто КАК НовоеРабочееМесто
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Итоговая КАК ВТ_ТаблицаСотрудники_Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокДействийДляСортировки,
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудники", ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ИспользоватьРабочиеМеста", Объект.Организация.ИспользоватьРабочиеМеста);
	Запрос.УстановитьПараметр("УчитыватьФизическоеЛицо", Объект.УчитыватьФизическоеЛицо);
	Запрос.УстановитьПараметр("ИзменятьФИО", Объект.ИзменятьФИО);
	Запрос.УстановитьПараметр("ИзменятьТабельныйНомер", Объект.ИзменятьТабельныйНомер);
	Запрос.УстановитьПараметр("УчитыватьГоловноеПодразделение", Ложь);
	Запрос.УстановитьПараметр("ОсобыеНастройки", Объект.ОсобыеНастройки);
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();	
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Обработать = ?(НоваяСтрока.Действие = "Не изменять", Ложь, Истина);
	КонецЦикла;
	
	// Обработка строк без сотрудника
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_Исходная
	|ИЗ
	|	&ТаблицаСотрудники КАК ТаблицаСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла КАК ФИОСотрудникаИзФайла,
	|	ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла КАК ТабельныйНомерСотрудникаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииФизлицаИзФайла КАК КодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ТаблицаСотрудники.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ТаблицаСотрудники.ФамилияСотрудникаИзФайла КАК ФамилияСотрудникаИзФайла,
	|	ТаблицаСотрудники.ИмяСотрудникаИзФайла КАК ИмяСотрудникаИзФайла,
	|	ТаблицаСотрудники.ОтчествоСотрудникаИзФайла КАК ОтчествоСотрудникаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииФизлицаИзФайла КАК ЕстьКодСинхронизацииФизлицаИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники
	|ИЗ
	|	ВТ_ТаблицаСотрудники_Исходная КАК ТаблицаСотрудники
	|ГДЕ
	|	ТаблицаСотрудники.ФИОСотрудникаИзФайла = """"
	|	И ТаблицаСотрудники.ТабельныйНомерСотрудникаИзФайла = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделение,
	|	Подразделения.Родитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла
	|ПОМЕСТИТЬ ВТ_Подразделения
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = Подразделения.КодСинхронизации
	|			И ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = Подразделения.Наименование
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Ссылка КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла
	|ПОМЕСТИТЬ ВТ_ПодразделенияРодители
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = Подразделения.КодСинхронизации
	|			И (Подразделения.Владелец = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Должности.Ссылка КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла
	|ПОМЕСТИТЬ ВТ_Должности
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолжностиИПрофессии КАК Должности
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла
	|					ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = Должности.КодСинхронизации
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = Должности.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеМестаАСТБ.Ссылка КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла
	|ПОМЕСТИТЬ ВТ_РабочиеМеста
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаАСТБ КАК РабочиеМестаАСТБ
	|		ПО (ВЫБОР
	|				КОГДА &ИспользоватьРабочиеМеста
	|					ТОГДА ВЫБОР
	|								КОГДА ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла
	|									ТОГДА ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = РабочиеМестаАСТБ.КодСинхронизации
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = РабочиеМестаАСТБ.Наименование
	|							И РабочиеМестаАСТБ.Владелец = &Организация
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_ТаблицаСотрудники.НовоеКоличествоСтавок
	|	КОНЕЦ КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ЕСТЬNULL(ВТ_Должности.НоваяДолжность, ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)) КАК НоваяДолжность,
	|	ЕСТЬNULL(ВТ_Подразделения.НовоеПодразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_Подразделения.ТекущееПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК ТекущееПодразделениеРодитель,
	|	ЕСТЬNULL(ВТ_ПодразделенияРодители.НовоеПодразделениеРодитель, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК НовоеПодразделениеРодитель,
	|	ЕСТЬNULL(ВТ_РабочиеМеста.НовоеРабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)) КАК НовоеРабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаСотрудники_НовоеИзФайла
	|ИЗ
	|	ВТ_ТаблицаСотрудники КАК ВТ_ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияИзФайла = ВТ_Подразделения.КодСинхронизацииПодразделенияИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеПодразделенияИзФайла = ВТ_Подразделения.НаименованиеПодразделенияИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияРодители КАК ВТ_ПодразделенияРодители
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииПодразделенияРодителяИзФайла = ВТ_ПодразделенияРодители.КодСинхронизацииПодразделенияРодителяИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должности КАК ВТ_Должности
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииДолжностиИзФайла = ВТ_Должности.КодСинхронизацииДолжностиИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеДолжностиИзФайла = ВТ_Должности.НаименованиеДолжностиИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеМеста КАК ВТ_РабочиеМеста
	|		ПО ВТ_ТаблицаСотрудники.КодСинхронизацииРабочегоМестаИзФайла = ВТ_РабочиеМеста.КодСинхронизацииРабочегоМестаИзФайла
	|			И ВТ_ТаблицаСотрудники.НаименованиеРабочегоМестаИзФайла = ВТ_РабочиеМеста.НаименованиеРабочегоМестаИзФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписаниеСрезПоследних.Период КАК Период,
	|	ШтатноеРасписаниеСрезПоследних.Организация КАК Организация,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение КАК ТекущееПодразделение,
	|	ШтатноеРасписаниеСрезПоследних.Подразделение.Родитель КАК ТекущееПодразделениеРодитель,
	|	ШтатноеРасписаниеСрезПоследних.Должность КАК ТекущаяДолжность,
	|	ШтатноеРасписаниеСрезПоследних.КоличествоСтавок КАК ТекущееКоличествоСтавок
	|ПОМЕСТИТЬ ВТ_ШтатноеРасписание
	|ИЗ
	|	РегистрСведений.ШтатноеРасписание.СрезПоследних(&ПериодШР, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение КАК НовоеПодразделение,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееПодразделениеРодитель, ВТ_ТаблицаСотрудники_НовоеИзФайла.ТекущееПодразделениеРодитель) КАК ТекущееПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеРабочееМесто КАК ТекущееРабочееМесто,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееКоличествоСтавок, 0) КАК ТекущееКоличествоСтавок,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущееПодразделение, ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение) КАК ТекущееПодразделение,
	|	ЕСТЬNULL(ВТ_ШтатноеРасписание.ТекущаяДолжность, ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность) КАК ТекущаяДолжность
	|ПОМЕСТИТЬ ВТ_ПодготовленнаяТаблица
	|ИЗ
	|	ВТ_ТаблицаСотрудники_НовоеИзФайла КАК ВТ_ТаблицаСотрудники_НовоеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтатноеРасписание КАК ВТ_ШтатноеРасписание
	|		ПО ВТ_ТаблицаСотрудники_НовоеИзФайла.НовоеПодразделение = ВТ_ШтатноеРасписание.ТекущееПодразделение
	|			И ВТ_ТаблицаСотрудники_НовоеИзФайла.НоваяДолжность = ВТ_ШтатноеРасписание.ТекущаяДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодготовленнаяТаблица.НаименованиеПодразделенияИзФайла КАК НаименованиеПодразделенияИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияИзФайла КАК КодСинхронизацииПодразделенияИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияРодителяИзФайла КАК КодСинхронизацииПодразделенияРодителяИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НаименованиеДолжностиИзФайла КАК НаименованиеДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииДолжностиИзФайла КАК КодСинхронизацииДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НовоеКоличествоСтавок КАК НовоеКоличествоСтавок,
	|	ВТ_ПодготовленнаяТаблица.ЕстьКодСинхронизацииДолжностиИзФайла КАК ЕстьКодСинхронизацииДолжностиИзФайла,
	|	ВТ_ПодготовленнаяТаблица.ЕстьКодСинхронизацииРабочегоМестаИзФайла КАК ЕстьКодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НаименованиеРабочегоМестаИзФайла КАК НаименованиеРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.КодСинхронизацииРабочегоМестаИзФайла КАК КодСинхронизацииРабочегоМестаИзФайла,
	|	ВТ_ПодготовленнаяТаблица.НоваяДолжность КАК НоваяДолжность,
	|	ВТ_ПодготовленнаяТаблица.НовоеПодразделение КАК НовоеПодразделение,
	|	ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель КАК ТекущееПодразделениеРодитель,
	|	ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель КАК НовоеПодразделениеРодитель,
	|	ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто КАК НовоеРабочееМесто,
	|	ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто КАК ТекущееРабочееМесто,
	|	ВТ_ПодготовленнаяТаблица.ТекущееКоличествоСтавок КАК ТекущееКоличествоСтавок,
	|	ВТ_ПодготовленнаяТаблица.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ВТ_ПодготовленнаяТаблица.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоДолжности
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НоваяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущаяДолжность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НоваяДолжность = ВТ_ПодготовленнаяТаблица.ТекущаяДолжность
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьДолжность,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоПодразделения
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделение = ВТ_ПодготовленнаяТаблица.ТекущееПодразделение
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьПодразделение,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоПодразделения
	|				И &УчитыватьГоловноеПодразделение
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И НЕ ВТ_ПодготовленнаяТаблица.КодСинхронизацииПодразделенияРодителяИзФайла = """"
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеПодразделениеРодитель = ВТ_ПодготовленнаяТаблица.ТекущееПодразделениеРодитель
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьПодразделениеРодитель,
	|	ВЫБОР
	|		КОГДА &ЗагружатьТолькоРабочиеМеста
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|							И ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					КОГДА ВТ_ПодготовленнаяТаблица.НовоеРабочееМесто = ВТ_ПодготовленнаяТаблица.ТекущееРабочееМесто
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗагружатьРабочееМесто
	|ИЗ
	|	ВТ_ПодготовленнаяТаблица КАК ВТ_ПодготовленнаяТаблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	НовоеПодразделениеРодитель,
	|	НовоеПодразделение,
	|	НоваяДолжность,
	|	НовоеРабочееМесто
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаСотрудники", ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ИспользоватьРабочиеМеста", Объект.Организация.ИспользоватьРабочиеМеста);
	Запрос.УстановитьПараметр("ПериодШР", ТекущаяДата());
	Запрос.УстановитьПараметр("ЗагружатьТолькоДолжности", Истина);
	Запрос.УстановитьПараметр("ЗагружатьТолькоПодразделения", Истина);
	Запрос.УстановитьПараметр("ЗагружатьТолькоРабочиеМеста", Истина);
	Запрос.УстановитьПараметр("УчитыватьГоловноеПодразделение", Объект.УчитыватьГоловноеПодразделение);
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка ИЗ ТЗ_Результат Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Действие = "Не изменять";
		ПорядокДействийДляСортировки = 99;
		
		Если Строка.ЗагружатьДолжность
			ИЛИ Строка.ЗагружатьПодразделение 
			ИЛИ Строка.ЗагружатьПодразделениеРодитель
			ИЛИ Строка.ЗагружатьРабочееМесто
			Тогда
			Действие = "Справочники";
			ПорядокДействийДляСортировки = 10;
		КонецЕсли;
			
		НоваяСтрока.Действие = Действие;
		НоваяСтрока.ПорядокДействийДляСортировки = ПорядокДействийДляСортировки;
		НоваяСтрока.Обработать = ?(НоваяСтрока.Действие = "Не изменять", Ложь, Истина);
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("ПорядокДействийДляСортировки");	
	
КонецПроцедуры //+++АСТБ_Горюшин_Алексей_59691