
&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	
	ОбменДаннымиВендингБокс.ВендингВыполнитьПервоначальнуюРегистрацию(Узел);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	
	ЗарегистрироватьИзмененияНаСервере(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредопределенныйУзел(Узел)
	
	Возврат Узел = ПланыОбмена.ВендингБокс.ЭтотУзел();	
	
КонецФункции	

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ПредопределенныйУзел(Элемент.ТекущаяСтрока) Тогда
		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Ложь;
		Элементы.ФормаОтменитьРегистрацию.Доступность = Ложь;		
	Иначе
		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Истина;
		Элементы.ФормаОтменитьРегистрацию.Доступность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРегистрацию(Команда)
	
	ОбменДаннымиВендингБокс.ВендингУдалитьРегистрацию(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры
