#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("РазрешитьОтрицательныеОстатки");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Возвращает описание блокируемых реквизитов
// Возвращаемое значение: массив
// Элемент массива: строка в формате
//		ИмяРеквизита[;ИмяЭлементаФормы,...]
// где	ИмяРеквизита - имя реквизита объекта
//		ИмяЭлементаФормы - имя элемента формы, связанного с реквизитом
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("LGNUM_LGTYP");
	БлокируемыеРеквизиты.Добавить("КодСинхронизации");
	БлокируемыеРеквизиты.Добавить("КодЗаводаДляВыгрузкиВSAP");
	
	//***НСК Трегубов А.А.*** --  --  31.01.2020 <<<
	БлокируемыеРеквизиты.Добавить("КодСинхронизацииВендинг");	
	//***НСК Трегубов А.А.*** --  --  31.01.2020 >>>
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

#КонецЕсли