
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//***НСК Трегубов А.А.*** -- Адресное хранение --  02.09.2019 <<<	
	Если АХ_СлотовыйУчетПоСкладу Тогда		
		ПроверяемыеРеквизиты.Добавить("АХ_КодУзлаТочкиХранения");		
	КонецЕсли;
	//***НСК Трегубов А.А.*** -- Адресное хранение --  02.09.2019 >>>
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	//***НСК Трегубов А.А.*** -- проверка на уникальность КодСинхронизацииВендинг --  30.01.2020 <<<	
	Если АвтоматизированнаяВыдача и ЗначениеЗаполнено(КодСинхронизацииВендинг) Тогда
		
		ТекстСообщения = "Обнаружены неуникальные склады по коду синхронизации вендинг, список складов:" + Символы.ПС; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка <> &Ссылка
		|	И Склады.КодСинхронизацииВендинг = &КодСинхронизацииВендинг";
		
		Запрос.УстановитьПараметр("КодСинхронизацииВендинг", КодСинхронизацииВендинг);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			ТекстСообщения = ТекстСообщения + Выборка.Ссылка + Символы.ПС;
			
		КонецЦикла;
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	//***НСК Трегубов А.А.*** -- проверка на уникальность КодСинхронизацииВендинг --  30.01.2020 >>>
	
	// Вызывается непосредственно до записи объекта в базу данных.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Наименование = &Наименование
	|	И Склады.КодСинхронизации = &КодСинхронизации
	|	И НЕ Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", 		Наименование);
	Запрос.УстановитьПараметр("КодСинхронизации", 	КодСинхронизации);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Склад с такими наименованием и кодом синхронизации уже существует.";
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли