
&НаКлиенте
Процедура ПолучитьТаблицуНеПереданныхДокументов(Команда)
	ПолучитьТаблицуНеПереданныхДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуНеПереданныхДокументовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	               |ГДЕ
	               |	ВыдачаСредствЗащитыСотруднику.Проведен
	               |	И ВыдачаСредствЗащитыСотруднику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	               |	И ВЫБОР
	               |			КОГДА ВыдачаСредствЗащитыСотруднику.ДокументОснование ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику
	               |				ТОГДА ВЫБОР
	               |						КОГДА ВЫРАЗИТЬ(ВыдачаСредствЗащитыСотруднику.ДокументОснование КАК Документ.ВыдачаСредствЗащитыСотруднику).Проведен
	               |								И ВЫРАЗИТЬ(ВыдачаСредствЗащитыСотруднику.ДокументОснование КАК Документ.ВыдачаСредствЗащитыСотруднику).ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	               |								И ВЫРАЗИТЬ(ВыдачаСредствЗащитыСотруднику.ДокументОснование КАК Документ.ВыдачаСредствЗащитыСотруднику).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка)
	               |							ТОГДА ЛОЖЬ
	               |						ИНАЧЕ ИСТИНА
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",  ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ДатаНачала",    Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = РеквизитФормыВЗначение("ДеревоДанных");
	Дерево.Строки.Очистить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//в цикле и пох, нет времени
		
		МассивВидов = Новый Массив;
		МассивВидов.Добавить(Перечисления.АХ_ВидыДокументовАдресногоХранения.ПланСнятия);
		МассивВидов.Добавить(Перечисления.АХ_ВидыДокументовАдресногоХранения.ПустаяСсылка());
		
		ТаблицаРасхождений = АХ_ОбменВызовСервера.ПолучитьТаблицуРасхожденийОбъектаИПодчиненных(Выборка.Ссылка,МассивВидов,"ТолькоПоложительные");		
		Если ТаблицаРасхождений.Количество() > 0 Тогда
						
			ВерхнийУровень = Дерево.Строки.Добавить();
			
			ВерхнийУровень.Документ = Выборка.Ссылка;
			
			Для Каждого СтрокаТаблицы из ТаблицаРасхождений цикл
				
				ПодчиненныйУзел = ВерхнийУровень.Строки.добавить();
				ЗаполнитьЗначенияСвойств(ПодчиненныйУзел,СтрокаТаблицы);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево,"ДеревоДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если Поле.Гиперссылкаячейки и ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
			СтруктураОткрытия = Новый Структура("Ключ",Элемент.ТекущиеДанные.Документ);
			ОткрытьФорму("Документ.ВыдачаСредствЗащитыСотруднику.Форма.ФормаДокумента",СтруктураОткрытия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
