//АСТБ_Горюшин_Алексей_32324
// Добавлена форма выбора

//+++АСТБ_Горюшин_Алексей_32324
&НаКлиенте
Процедура СоздатьШаблон(Команда)
	
	ПараметрыДляФормы = Новый Структура();
	
	Для Каждого СтрокаОтбора ИЗ Этаформа.Список.Отбор.Элементы Цикл
	
		Если Строка(СтрокаОтбора.ЛевоеЗначение) = "ПредназначенДляSMS"
			И СтрокаОтбора.ПравоеЗначение = Истина
			Тогда
			ПараметрыДляФормы.Вставить("ВидСообщения", "СообщениеSMS");
		КонецЕсли;
		
		Если Строка(СтрокаОтбора.ЛевоеЗначение) = "ПредназначенДляЭлектронныхПисем"
			И СтрокаОтбора.ПравоеЗначение = Истина
			Тогда
			ПараметрыДляФормы.Вставить("ВидСообщения", "ЭлектронноеПисьмо");
		КонецЕсли;
	
	КонецЦикла;
	
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта",ПараметрыДляФормы, ЭтаФорма);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_32324
