
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов",
		"СредстваЗащитыСотрудникаНаХранении",
		Новый Структура("Сотрудник", ПараметрКоманды),
		Истина,
		Ложь);    		
		
	ОткрытьФорму(
		"Отчет.СредстваЗащитыСотрудникаНаХранении.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры
