
&НаКлиенте
Процедура НподразделенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Отчет.ОтчетПоОбеспеченности.Форма.ФормаВыбораДереваПодразделений",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Данные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВыбранноеЗначение);
	Отчет.НПодразделения.Очистить();
	Для каждого Элемент Из Данные Цикл	
		Отчет.НПодразделения.Добавить(Элемент);	
	КонецЦикла;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура НПериодПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Отчет.НПериод.ДатаНачала) Или НЕ ЗначениеЗаполнено(Отчет.НПериод.ДатаОкончания) Тогда
		Отчет.НПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Отчет.НПериод.ДатаОкончания = КонецМесяца(Отчет.НПериод.ДатаНачала);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Отчет.НПериод.ДатаНачала) Или НЕ ЗначениеЗаполнено(Отчет.НПериод.ДатаОкончания) Тогда
		Отчет.НПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Отчет.НПериод.ДатаОкончания = КонецМесяца(Отчет.НПериод.ДатаНачала);
	КонецЕсли;
КонецПроцедуры

