
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ИмяМакета = Параметры.ИмяМакета;
	
	Макет = ТекущийОбъект.ПолучитьМакет(ИмяМакета);
	Область = Макет.ПолучитьОбласть("Заголовок");
	ФорматЗагрузки.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Пробел");
	ФорматЗагрузки.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Формат");
	ФорматЗагрузки.Вывести(Область);  
	Область = Макет.ПолучитьОбласть("Пробел");
	ФорматЗагрузки.Вывести(Область);
	Область = Макет.ПолучитьОбласть("УсловияЗагрузки");
	ФорматЗагрузки.Вывести(Область);
	
КонецПроцедуры
