
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;  
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//+++АСТБ_Горюшин_Алексей_13335
	ПараметрРассчитыватьПотребностьОтносительноДаты = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РассчитыватьПотребностьОтносительноДаты"));
	Если не ПараметрРассчитыватьПотребностьОтносительноДаты = Неопределено Тогда
		РассчитыватьПотребностьОтносительноДаты = ПараметрРассчитыватьПотребностьОтносительноДаты.Значение;
		ПараметрРассчитыватьПотребностьОтносительноДаты.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	//было
	//ПараметрРассчитыватьПотребностьОтносительноТекущейДаты = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РассчитыватьПотребностьОтносительноТекущейДаты"));
	//Если не ПараметрРассчитыватьПотребностьОтносительноТекущейДаты = Неопределено Тогда
	//	РассчитыватьПотребностьОтносительноТекущейДаты = ПараметрРассчитыватьПотребностьОтносительноТекущейДаты.Значение;
	//	ПараметрРассчитыватьПотребностьОтносительноТекущейДаты.Использование = Истина;
	//Иначе
	//	Возврат;
	//КонецЕсли;
	//---АСТБ_Горюшин_Алексей_13335
	
	ПараметрОтображатьНоменклатурныеНомера = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтображатьНоменклатурныеНомера"));
	Если не ПараметрОтображатьНоменклатурныеНомера = Неопределено Тогда
		ОтображатьНоменклатурныеНомера = ПараметрОтображатьНоменклатурныеНомера.Значение;
		ПараметрОтображатьНоменклатурныеНомера.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	//+++АСТБ_Горюшин_Алексей_23751
	ПараметрОтображатьНаименованиеОрганизации = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтображатьНаименованиеОрганизации"));
	Если не ПараметрОтображатьНаименованиеОрганизации = Неопределено Тогда
		ОтображатьНаименованиеОрганизации = ПараметрОтображатьНаименованиеОрганизации.Значение;
		ПараметрОтображатьНаименованиеОрганизации.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_23751
	
	ПараметрТипПериода = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипПериода"));
	Если не ПараметрТипПериода = Неопределено Тогда
		ТипПериода = ПараметрТипПериода.Значение;
		ПараметрТипПериода.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	Если не ПараметрПериод = Неопределено Тогда
		ДатаНачала 		= ПараметрПериод.Значение.ДатаНачала;
		ДатаОкончания 	= ПараметрПериод.Значение.ДатаОкончания;
		ПараметрПериод.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	//***Новосибирск Трегубов А.А.*** -- НеУчитыватьНевыданноеРанее --  16.04.2019 <<<	
	ПараметрНеУчитыватьНевыданноеРанее = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НеУчитыватьНевыданноеРанее"));
	Если не ПараметрНеУчитыватьНевыданноеРанее = Неопределено Тогда
		НеУчитыватьНевыданноеРанее = ПараметрНеУчитыватьНевыданноеРанее.Значение;
	Иначе
		Возврат;
	КонецЕсли;
	//***Новосибирск Трегубов А.А.*** -- НеУчитыватьНевыданноеРанее --  16.04.2019 >>>	
	
	//NSK_Dolmatov_12/12/2019>>
	ПараметрСклад = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыбранныйСклад"));
	СкладНеВыбран = Истина;
	//ВыбранныйСклад = Справочники
	Если ПараметрСклад = Неопределено Тогда
		Возврат
	КонецЕсли;	
	
	ВыбранныйСклад = ПараметрСклад.Значение;
	Если ВыбранныйСклад<>Неопределено И ВыбранныйСклад<>Справочники.Склады.ПустаяСсылка() И ПараметрСклад.Использование = Истина Тогда
		//ПараметрСклад.Использование = Истина;
		СкладНеВыбран = Ложь;
	КонецЕсли;		
	
	//NSK_Dolmatovv_12/12/2019<<

	//+++АСТБ_Горюшин_Алексей_67572
	ПоставщикВыбран = Ложь;
	ПараметрПоставщик = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Поставщик"));
	Если НЕ ПараметрПоставщик = Неопределено Тогда
		ВыбранныйПоставщик = ПараметрПоставщик.Значение;
		Если ВыбранныйПоставщик <> Справочники.Контрагенты.ПустаяСсылка()
			И ПараметрПоставщик.Использование = Истина Тогда
			ПоставщикВыбран = Истина;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрПриоритетНоменклатурыСЦенами = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПриоритетНоменклатурыСЦенами"));
	Если НЕ ПараметрПриоритетНоменклатурыСЦенами = Неопределено Тогда
		ПриоритетНоменклатурыСЦенами = ПараметрПриоритетНоменклатурыСЦенами.Значение;
	Иначе
		Возврат;
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_67572
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+++АСТБ_Горюшин_Алексей_67572
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Организация КАК _Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Организация,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//было
	//"ВЫБРАТЬ
	//---АСТБ_Горюшин_Алексей_67572
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_Сотрудник_Подразделение_Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Подразделение,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Должность,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация,
	|		ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК _Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК _Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК _Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец КАК _Организация
	|ПОМЕСТИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, ) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	//+++АСТБ_Горюшин_Алексей_67572	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|	ПО ВТ_ЦеныНоменклатуры._Организация = СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации.Владелец
	|		И ВТ_ЦеныНоменклатуры.Номенклатура = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура
	|		И ВТ_ЦеныНоменклатуры.Поставщик = СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик
	//---АСТБ_Горюшин_Алексей_67572
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	//+++АСТБ_Горюшин_Алексей_67572
	|	И ВЫБОР
	|		КОГДА &ПоставщикВыбран
	|			ТОГДА СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура.Поставщик В (&ВыбранныйПоставщик)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПриоритетНоменклатурыСЦенами
	|			ТОГДА НЕ ВТ_ЦеныНоменклатуры.Цена ЕСТЬ NULL
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	//---АСТБ_Горюшин_Алексей_67572
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос._Организация КАК _Организация,
	|	ВложенныйЗапрос._Сотрудник КАК _Сотрудник,
	|	ВложенныйЗапрос._Подразделение КАК _Подразделение,
	|	ВложенныйЗапрос._Должность КАК _Должность,
	|	ВложенныйЗапрос.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет КАК Приоритет,
	|	ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация КАК _Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник КАК _Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Подразделение КАК _Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Должность КАК _Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|		МИНИМУМ(ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет) КАК Приоритет,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол КАК НоменклатураПол
	|	ИЗ
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Подразделение,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Должность,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация,
	|		ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВложенныйЗапрос._Сотрудник = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|			И ВложенныйЗапрос._Подразделение = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Подразделение
	|			И ВложенныйЗапрос._Должность = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Должность
	|			И ВложенныйЗапрос.НоменклатураНормыОрганизации = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|			И ВложенныйЗапрос.Приоритет = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|			И ВложенныйЗапрос._Организация = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|			И ВложенныйЗапрос.НоменклатураПол = ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВесьМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|;
	//+++АСТБ_Горюшин_Алексей_67572
	//было
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЦеныНоменклатурыСрезПоследних.Организация КАК _Организация,
	//|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	//|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
	//|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	//|ИЗ
	//|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	//|	ЦеныНоменклатурыСрезПоследних.Организация,
	//|	ЦеныНоменклатурыСрезПоследних.Поставщик
	//|;
	//---АСТБ_Горюшин_Алексей_67572
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияАнтропометрическихСвойств.Сотрудник КАК Сотрудник,
	|	ЗначенияАнтропометрическихСвойств.ВидСвойства КАК ВидСвойства,
	|	ЗначенияАнтропометрическихСвойств.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_АнтропометрияСотрудников
	|ИЗ
	|	РегистрСведений.ЗначенияАнтропометрическихСвойств КАК ЗначенияАнтропометрическихСвойств
	|ГДЕ
	//+++АСТБ_ALEXEY_110616_**************************************************************
	//|	НЕ ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.Рост)
	|	НЕ (ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.Рост) ИЛИ ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РостВерхОдежды) ИЛИ ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РостНизОдежды))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияАнтропометрическихСвойств.Сотрудник КАК Сотрудник,
	|	ЗначенияАнтропометрическихСвойств.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РостСотрудников
	|ИЗ
	|	РегистрСведений.ЗначенияАнтропометрическихСвойств КАК ЗначенияАнтропометрическихСвойств
	|ГДЕ
	|	ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.Рост)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияАнтропометрическихСвойств.Сотрудник КАК Сотрудник,
	|	ЗначенияАнтропометрическихСвойств.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РостВерхОдеждыСотрудников
	|ИЗ
	|	РегистрСведений.ЗначенияАнтропометрическихСвойств КАК ЗначенияАнтропометрическихСвойств
	|ГДЕ
	|	ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РостВерхОдежды)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияАнтропометрическихСвойств.Сотрудник КАК Сотрудник,
	|	ЗначенияАнтропометрическихСвойств.ЗначениеСвойства КАК ЗначениеСвойства
	|ПОМЕСТИТЬ ВТ_РостНизОдеждыСотрудников
	|ИЗ
	|	РегистрСведений.ЗначенияАнтропометрическихСвойств КАК ЗначенияАнтропометрическихСвойств
	|ГДЕ
	|	ЗначенияАнтропометрическихСвойств.ВидСвойства = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РостНизОдежды)
	|;
	//--АСТБ_ALEXEY_110616_**************************************************************
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК _Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК _Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы КАК ОсновноеМестоРаботы,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК _Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК _Должность
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.ДатаПотребности < &ДатаНачала
	|			ТОГДА ВЫБОР
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 1
	|						ТОГДА &ТекущаяДата
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 2
	|						ТОГДА &ДатаНачала
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		КОГДА ПотребностьВыдачиСИЗОстатки.ДатаПотребности < &ТекущаяДата
	|			ТОГДА ВЫБОР
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 1
	|						ТОГДА &ТекущаяДата
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 2
	|						ТОГДА &ДатаНачала
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВТ_ОсновноеМестоРаботы._Подразделение КАК Подразделение,
	|	ВТ_ОсновноеМестоРаботы._Должность КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_АнтропометрияСотрудников.ВидСвойства ЕСТЬ NULL
	|			ТОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ВидАнтропометрическогоСвойства
	|		ИНАЧЕ ВТ_АнтропометрияСотрудников.ВидСвойства
	|	КОНЕЦ КАК ВидАнтропометрии,
	|	ЕСТЬNULL(ВТ_АнтропометрияСотрудников.ЗначениеСвойства, """") КАК ЗначениеАнтропометрии,
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ИспользоватьРост
	|			ТОГДА ЕСТЬNULL(ВТ_РостСотрудников.ЗначениеСвойства, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ИспользоватьРост
	|			ТОГДА ЕСТЬNULL(ВТ_РостВерхОдеждыСотрудников.ЗначениеСвойства, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК РостВерхОдежды,
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ИспользоватьРост
	|			ТОГДА ЕСТЬNULL(ВТ_РостНизОдеждыСотрудников.ЗначениеСвойства, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	//+++АСТБ_Горюшин_Алексей_57395
	|	,МАКСИМУМ(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоМаксимум,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) КАК МесяцПотребности
	|ПОМЕСТИТЬ ВТ_Потребность_Предварительная
	//было
	//|ПОМЕСТИТЬ ВТ_Потребность
	//---АСТБ_Горюшин_Алексей_57395
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = НормыВыдачиСИЗСоставНормы.Ссылка.Владелец
	|			И ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_ОсновноеМестоРаботы._Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОсновноеМестоРаботы._Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АнтропометрияСотрудников КАК ВТ_АнтропометрияСотрудников
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_АнтропометрияСотрудников.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ВидАнтропометрическогоСвойства = ВТ_АнтропометрияСотрудников.ВидСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РостСотрудников КАК ВТ_РостСотрудников
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_РостСотрудников.Сотрудник
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РостВерхОдеждыСотрудников КАК ВТ_РостВерхОдеждыСотрудников
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_РостВерхОдеждыСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РостНизОдеждыСотрудников КАК ВТ_РостНизОдеждыСотрудников
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_РостНизОдеждыСотрудников.Сотрудник
	//---АСТБ_ALEXEY_110616_**************************************************************
	|ГДЕ
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности <= &ДатаОкончания
	|	И НЕ НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &НеУчитыватьНевыданноеРанее
	|				ТОГДА ПотребностьВыдачиСИЗОстатки.ДатаПотребности >= &ДатаНачала
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТ_АнтропометрияСотрудников.ВидСвойства ЕСТЬ NULL
	|			ТОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ВидАнтропометрическогоСвойства
	|		ИНАЧЕ ВТ_АнтропометрияСотрудников.ВидСвойства
	|	КОНЕЦ,
	|	ВТ_ОсновноеМестоРаботы._Должность,
	|	ВТ_ОсновноеМестоРаботы._Подразделение,
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.ДатаПотребности < &ДатаНачала
	|			ТОГДА ВЫБОР
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 1
	|						ТОГДА &ТекущаяДата
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 2
	|						ТОГДА &ДатаНачала
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		КОГДА ПотребностьВыдачиСИЗОстатки.ДатаПотребности < &ТекущаяДата
	|			ТОГДА ВЫБОР
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 1
	|						ТОГДА &ТекущаяДата
	|					КОГДА &РассчитыватьПотребностьОтносительноДаты = 2
	|						ТОГДА &ДатаНачала
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|	КОНЕЦ,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.Организация,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи.ВидВыдачиСИЗ,
	|	ЕСТЬNULL(ВТ_АнтропометрияСотрудников.ЗначениеСвойства, """"),
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ИспользоватьРост
	|			ТОГДА ЕСТЬNULL(ВТ_РостСотрудников.ЗначениеСвойства, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ИспользоватьРост
	|			ТОГДА ЕСТЬNULL(ВТ_РостВерхОдеждыСотрудников.ЗначениеСвойства, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПотребностьВыдачиСИЗОстатки.НоменклатураНормы.ИспользоватьРост
	|			ТОГДА ЕСТЬNULL(ВТ_РостНизОдеждыСотрудников.ЗначениеСвойства, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов
	//+++АСТБ_Горюшин_Алексей_57395
	|	,НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ)
	//---АСТБ_Горюшин_Алексей_57395
	|;
	//+++АСТБ_Горюшин_Алексей_57395
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоВыданныеСИЗОстаток,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
	|	НАЧАЛОПЕРИОДА(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ) КАК МесяцВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки() КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.ВидВыдачиСИЗ,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	НАЧАЛОПЕРИОДА(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ),
	|	ВыданныеСредстваЗащитыОстатки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_Предварительная.Организация КАК Организация,
	|	ВТ_Потребность_Предварительная.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_Предварительная.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность_Предварительная.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность_Предварительная.НормаВыдачи.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_Потребность_Предварительная.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВТ_Потребность_Предварительная.КоличествоОстаток) КАК КоличествоОстаток,
	|	МАКСИМУМ(ВТ_Потребность_Предварительная.КоличествоМаксимум) КАК КоличествоМаксимум,
	|	СУММА(ВТ_ВыданныеСИЗ.КоличествоВыданныеСИЗОстаток) КАК КоличествоВыданныеСИЗОстаток,
	|	ВТ_Потребность_Предварительная.Подразделение КАК Подразделение,
	|	ВТ_Потребность_Предварительная.Должность КАК Должность,
	|	ВТ_Потребность_Предварительная.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_Потребность_Предварительная.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_Потребность_Предварительная.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_Предварительная.РостВерхОдежды КАК РостВерхОдежды,
	|	ВТ_Потребность_Предварительная.РостНизОдежды КАК РостНизОдежды,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_Предварительная.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_Потребность_Предварительная.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|ПОМЕСТИТЬ ВТ_Потребность_И_ВыданныеСИЗ	
	|ИЗ 
	|	ВТ_Потребность_Предварительная КАК ВТ_Потребность_Предварительная
	|	    ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_Потребность_Предварительная.МесяцПотребности = ВТ_ВыданныеСИЗ.МесяцВыдачи
	|			И ВТ_Потребность_Предварительная.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_Потребность_Предварительная.НоменклатураНормы = ВТ_ВыданныеСИЗ.НоменклатураНормы
	|			И ВТ_Потребность_Предварительная.ВидВыдачиСИЗ = ВТ_ВыданныеСИЗ.ВидВыдачиСИЗ
	|			И (ВЫБОР
	|				КОГДА ВТ_Потребность_Предварительная.Организация.СверткаПотребностиПоНоменклатуреНормы
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_Потребность_Предварительная.НормаВыдачи = ВТ_ВыданныеСИЗ.НормаВыдачи
	|			КОНЕЦ)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность_Предварительная.Организация,
	|	ВТ_Потребность_Предварительная.Сотрудник,
	|	ВТ_Потребность_Предварительная.НормаВыдачи,
	|	ВТ_Потребность_Предварительная.НоменклатураНормы,
	|	ВТ_Потребность_Предварительная.НормаВыдачи.ВидВыдачиСИЗ,
	|	ВТ_Потребность_Предварительная.ДатаПотребности,
	|	ВТ_Потребность_Предварительная.Подразделение,
	|	ВТ_Потребность_Предварительная.Должность,
	|	ВТ_Потребность_Предварительная.ВидАнтропометрии,
	|	ВТ_Потребность_Предварительная.ЗначениеАнтропометрии,
	|	ВТ_Потребность_Предварительная.Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_Предварительная.РостВерхОдежды,
	|	ВТ_Потребность_Предварительная.РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_Предварительная.ПериодичностьВыдачиТипПериода,
	|	ВТ_Потребность_Предварительная.ПериодичностьВыдачиКоличествоПериодов
	|;	
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_И_ВыданныеСИЗ.Организация КАК Организация,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_И_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность_И_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность_И_ВыданныеСИЗ.НормаВыдачи.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Потребность_И_ВыданныеСИЗ.Организация.ЧастичнаяВыдача = 3
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Потребность_И_ВыданныеСИЗ.Организация.СверткаПотребностиПоНоменклатуреНормы
	|							ТОГДА ВТ_Потребность_И_ВыданныеСИЗ.КоличествоМаксимум
	|						ИНАЧЕ ВТ_Потребность_И_ВыданныеСИЗ.КоличествоОстаток
	|					КОНЕЦ
	|			КОГДА ВТ_Потребность_И_ВыданныеСИЗ.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Потребность_И_ВыданныеСИЗ.Организация.СверткаПотребностиПоНоменклатуреНормы
	|							ТОГДА ВТ_Потребность_И_ВыданныеСИЗ.КоличествоМаксимум
	|						ИНАЧЕ ВТ_Потребность_И_ВыданныеСИЗ.КоличествоОстаток
	|					КОНЕЦ - ЕСТЬNULL(ВТ_Потребность_И_ВыданныеСИЗ.КоличествоВыданныеСИЗОстаток, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Потребность_И_ВыданныеСИЗ.Организация.СверткаПотребностиПоНоменклатуреНормы
	|						ТОГДА ВТ_Потребность_И_ВыданныеСИЗ.КоличествоМаксимум
	|					ИНАЧЕ ВТ_Потребность_И_ВыданныеСИЗ.КоличествоОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Подразделение КАК Подразделение,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Должность КАК Должность,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_И_ВыданныеСИЗ.РостВерхОдежды КАК РостВерхОдежды,
	|	ВТ_Потребность_И_ВыданныеСИЗ.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_И_ВыданныеСИЗ.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|ПОМЕСТИТЬ ВТ_Потребность	
	|ИЗ 
	|	ВТ_Потребность_И_ВыданныеСИЗ КАК ВТ_Потребность_И_ВыданныеСИЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность_И_ВыданныеСИЗ.Организация,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Сотрудник,
	|	ВТ_Потребность_И_ВыданныеСИЗ.НормаВыдачи,
	|	ВТ_Потребность_И_ВыданныеСИЗ.НоменклатураНормы,
	|	ВТ_Потребность_И_ВыданныеСИЗ.НормаВыдачи.ВидВыдачиСИЗ,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ДатаПотребности,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Подразделение,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Должность,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ВидАнтропометрии,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ЗначениеАнтропометрии,
	|	ВТ_Потребность_И_ВыданныеСИЗ.Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_И_ВыданныеСИЗ.РостВерхОдежды,
	|	ВТ_Потребность_И_ВыданныеСИЗ.РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_Потребность_И_ВыданныеСИЗ.ПериодичностьВыдачиТипПериода,
	|	ВТ_Потребность_И_ВыданныеСИЗ.ПериодичностьВыдачиКоличествоПериодов
	|;
	//---АСТБ_Горюшин_Алексей_57395
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Организация
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Организация
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Организация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Сотрудник
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.НормаВыдачи
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.НормаВыдачи
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.НормаВыдачи
	|	КОНЕЦ КАК НормаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.НоменклатураНормы
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.НоменклатураНормы
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.НоменклатураНормы
	|	КОНЕЦ КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.ВидВыдачиСИЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.ВидВыдачиСИЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.ВидВыдачиСИЗ
	|	КОНЕЦ КАК ВидВыдачиСИЗ,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.ДатаПотребности
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.КоличествоОстаток
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.КоличествоОстаток
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Подразделение
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Подразделение
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Должность
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Должность
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.ВидАнтропометрии
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.ВидАнтропометрии
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.ВидАнтропометрии
	|	КОНЕЦ КАК ВидАнтропометрии,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.ЗначениеАнтропометрии
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.ЗначениеАнтропометрии
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.ЗначениеАнтропометрии
	|	КОНЕЦ КАК ЗначениеАнтропометрии,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Рост
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Рост
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Рост
	|	КОНЕЦ КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.РостВерхОдежды
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.РостВерхОдежды
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.РостВерхОдежды
	|	КОНЕЦ КАК РостВерхОдежды,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.РостНизОдежды
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.РостНизОдежды
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.РостНизОдежды
	|	КОНЕЦ КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Приоритет
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Приоритет
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Приоритет
	|	КОНЕЦ КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.ПериодичностьВыдачиТипПериода
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.ПериодичностьВыдачиТипПериода
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.ПериодичностьВыдачиТипПериода
	|	КОНЕЦ КАК ПериодичностьВыдачиТипПериода,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.ПериодичностьВыдачиКоличествоПериодов
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.ПериодичностьВыдачиКоличествоПериодов
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.ПериодичностьВыдачиКоличествоПериодов
	|	КОНЕЦ КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура ЕСТЬ NULL
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Пустой.Номенклатура
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура
	|	КОНЕЦ КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НоменклатураБезМетрик
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_НоменклатураБезМетрик1.Организация КАК Организация,
	|			ВТ_НоменклатураБезМетрик1.Сотрудник КАК Сотрудник,
	|			ВТ_НоменклатураБезМетрик1.НормаВыдачи КАК НормаВыдачи,
	|			ВТ_НоменклатураБезМетрик1.НоменклатураНормы КАК НоменклатураНормы,
	|			ВТ_НоменклатураБезМетрик1.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|			ВТ_НоменклатураБезМетрик1.ДатаПотребности КАК ДатаПотребности,
	|			ВТ_НоменклатураБезМетрик1.КоличествоОстаток КАК КоличествоОстаток,
	|			ВТ_НоменклатураБезМетрик1.Подразделение КАК Подразделение,
	|			ВТ_НоменклатураБезМетрик1.Должность КАК Должность,
	|			ВТ_НоменклатураБезМетрик1.ВидАнтропометрии КАК ВидАнтропометрии,
	|			ВТ_НоменклатураБезМетрик1.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|			ВТ_НоменклатураБезМетрик1.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|			ВТ_НоменклатураБезМетрик1.РостВерхОдежды КАК РостВерхОдежды,
	|			ВТ_НоменклатураБезМетрик1.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|			ВТ_НоменклатураБезМетрик1.Приоритет КАК Приоритет,
	|			ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|			ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|			ВТ_НоменклатураБезМетрик2.Номенклатура КАК Номенклатура
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_Потребность.Организация КАК Организация,
	|				ВТ_Потребность.Сотрудник КАК Сотрудник,
	|				ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|				ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|				ВТ_Потребность.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|				ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|				ВТ_Потребность.КоличествоОстаток КАК КоличествоОстаток,
	|				ВТ_Потребность.Подразделение КАК Подразделение,
	|				ВТ_Потребность.Должность КАК Должность,
	|				ВТ_Потребность.ВидАнтропометрии КАК ВидАнтропометрии,
	|				ВТ_Потребность.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|				ВТ_Потребность.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.РостВерхОдежды КАК РостВерхОдежды,
	|				ВТ_Потребность.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|				МИНИМУМ(ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА 0
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|					КОНЕЦ) КАК Приоритет,
	|				ВТ_Потребность.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|				ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|			ИЗ
	|				ВТ_Потребность КАК ВТ_Потребность
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|						И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|						И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|					ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|					ПО ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТ_Потребность.Организация,
	|				ВТ_Потребность.Сотрудник,
	|				ВТ_Потребность.НормаВыдачи,
	|				ВТ_Потребность.НоменклатураНормы,
	|				ВТ_Потребность.ВидВыдачиСИЗ,
	|				ВТ_Потребность.ДатаПотребности,
	|				ВТ_Потребность.КоличествоОстаток,
	|				ВТ_Потребность.Подразделение,
	|				ВТ_Потребность.Должность,
	|				ВТ_Потребность.ВидАнтропометрии,
	|				ВТ_Потребность.ЗначениеАнтропометрии,
	|				ВТ_Потребность.Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.РостВерхОдежды,
	|				ВТ_Потребность.РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.ПериодичностьВыдачиТипПериода,
	|				ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов) КАК ВТ_НоменклатураБезМетрик1
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВТ_Потребность.Организация КАК Организация,
	|					ВТ_Потребность.Сотрудник КАК Сотрудник,
	|					ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|					ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|					ВТ_Потребность.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|					ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|					ВТ_Потребность.КоличествоОстаток КАК КоличествоОстаток,
	|					ВТ_Потребность.Подразделение КАК Подразделение,
	|					ВТ_Потребность.Должность КАК Должность,
	|					ВТ_Потребность.ВидАнтропометрии КАК ВидАнтропометрии,
	|					ВТ_Потребность.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|					ВТ_Потребность.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|					ВТ_Потребность.РостВерхОдежды КАК РостВерхОдежды,
	|					ВТ_Потребность.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|					ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА 0
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|					КОНЕЦ КАК Приоритет,
	|					ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|					КОНЕЦ КАК Номенклатура,
	|					ВТ_Потребность.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|					ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|				ИЗ
	|					ВТ_Потребность КАК ВТ_Потребность
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|							И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|							И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|						ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|						ПО ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской))) КАК ВТ_НоменклатураБезМетрик2
	|				ПО ВТ_НоменклатураБезМетрик1.Организация = ВТ_НоменклатураБезМетрик2.Организация
	|					И ВТ_НоменклатураБезМетрик1.Сотрудник = ВТ_НоменклатураБезМетрик2.Сотрудник
	|					И ВТ_НоменклатураБезМетрик1.НормаВыдачи = ВТ_НоменклатураБезМетрик2.НормаВыдачи
	|					И ВТ_НоменклатураБезМетрик1.НоменклатураНормы = ВТ_НоменклатураБезМетрик2.НоменклатураНормы
	|					И ВТ_НоменклатураБезМетрик1.ВидВыдачиСИЗ = ВТ_НоменклатураБезМетрик2.ВидВыдачиСИЗ
	|					И ВТ_НоменклатураБезМетрик1.ДатаПотребности = ВТ_НоменклатураБезМетрик2.ДатаПотребности
	|					И ВТ_НоменклатураБезМетрик1.КоличествоОстаток = ВТ_НоменклатураБезМетрик2.КоличествоОстаток
	|					И ВТ_НоменклатураБезМетрик1.ВидАнтропометрии = ВТ_НоменклатураБезМетрик2.ВидАнтропометрии
	|					И ВТ_НоменклатураБезМетрик1.ЗначениеАнтропометрии = ВТ_НоменклатураБезМетрик2.ЗначениеАнтропометрии
	|					И ВТ_НоменклатураБезМетрик1.Рост = ВТ_НоменклатураБезМетрик2.Рост
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|					И ВТ_НоменклатураБезМетрик1.РостВерхОдежды = ВТ_НоменклатураБезМетрик2.РостВерхОдежды
	|					И ВТ_НоменклатураБезМетрик1.РостНизОдежды = ВТ_НоменклатураБезМетрик2.РостНизОдежды
	//---АСТБ_ALEXEY_110616_**************************************************************
	|					И ВТ_НоменклатураБезМетрик1.Приоритет = ВТ_НоменклатураБезМетрик2.Приоритет
	|					И ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиТипПериода = ВТ_НоменклатураБезМетрик2.ПериодичностьВыдачиТипПериода
	|					И ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиКоличествоПериодов = ВТ_НоменклатураБезМетрик2.ПериодичностьВыдачиКоличествоПериодов) КАК ВТ_НоменклатураБезМетрик_Пол_Мужской
	|		ПО ВТ_Потребность.Организация = ВТ_НоменклатураБезМетрик_Пол_Мужской.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_НоменклатураБезМетрик_Пол_Мужской.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_НоменклатураБезМетрик_Пол_Мужской.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_НоменклатураБезМетрик_Пол_Мужской.НоменклатураНормы
	|			И ВТ_Потребность.ВидВыдачиСИЗ = ВТ_НоменклатураБезМетрик_Пол_Мужской.ВидВыдачиСИЗ
	|			И ВТ_Потребность.ДатаПотребности = ВТ_НоменклатураБезМетрик_Пол_Мужской.ДатаПотребности
	|			И ВТ_Потребность.КоличествоОстаток = ВТ_НоменклатураБезМетрик_Пол_Мужской.КоличествоОстаток
	|			И ВТ_Потребность.Подразделение = ВТ_НоменклатураБезМетрик_Пол_Мужской.Подразделение
	|			И ВТ_Потребность.Должность = ВТ_НоменклатураБезМетрик_Пол_Мужской.Должность
	|			И ВТ_Потребность.ВидАнтропометрии = ВТ_НоменклатураБезМетрик_Пол_Мужской.ВидАнтропометрии
	|			И ВТ_Потребность.ЗначениеАнтропометрии = ВТ_НоменклатураБезМетрик_Пол_Мужской.ЗначениеАнтропометрии
	|			И ВТ_Потребность.Рост = ВТ_НоменклатураБезМетрик_Пол_Мужской.Рост
	|			И ВТ_Потребность.ПериодичностьВыдачиТипПериода = ВТ_НоменклатураБезМетрик_Пол_Мужской.ПериодичностьВыдачиТипПериода
	|			И ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов = ВТ_НоменклатураБезМетрик_Пол_Мужской.ПериодичностьВыдачиКоличествоПериодов
	|			И (ВТ_НоменклатураБезМетрик_Пол_Мужской.Номенклатура.Пол = ВТ_Потребность.Сотрудник.ФизическоеЛицо.Пол)
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|			И ВТ_Потребность.РостВерхОдежды = ВТ_НоменклатураБезМетрик_Пол_Мужской.РостВерхОдежды
	|			И ВТ_Потребность.РостНизОдежды = ВТ_НоменклатураБезМетрик_Пол_Мужской.РостНизОдежды
	//---АСТБ_ALEXEY_110616_**************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_НоменклатураБезМетрик1.Организация КАК Организация,
	|			ВТ_НоменклатураБезМетрик1.Сотрудник КАК Сотрудник,
	|			ВТ_НоменклатураБезМетрик1.НормаВыдачи КАК НормаВыдачи,
	|			ВТ_НоменклатураБезМетрик1.НоменклатураНормы КАК НоменклатураНормы,
	|			ВТ_НоменклатураБезМетрик1.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|			ВТ_НоменклатураБезМетрик1.ДатаПотребности КАК ДатаПотребности,
	|			ВТ_НоменклатураБезМетрик1.КоличествоОстаток КАК КоличествоОстаток,
	|			ВТ_НоменклатураБезМетрик1.Подразделение КАК Подразделение,
	|			ВТ_НоменклатураБезМетрик1.Должность КАК Должность,
	|			ВТ_НоменклатураБезМетрик1.ВидАнтропометрии КАК ВидАнтропометрии,
	|			ВТ_НоменклатураБезМетрик1.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|			ВТ_НоменклатураБезМетрик1.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|			ВТ_НоменклатураБезМетрик1.РостВерхОдежды КАК РостВерхОдежды,
	|			ВТ_НоменклатураБезМетрик1.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|			ВТ_НоменклатураБезМетрик1.Приоритет КАК Приоритет,
	|			ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|			ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|			ВТ_НоменклатураБезМетрик2.Номенклатура КАК Номенклатура
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_Потребность.Организация КАК Организация,
	|				ВТ_Потребность.Сотрудник КАК Сотрудник,
	|				ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|				ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|				ВТ_Потребность.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|				ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|				ВТ_Потребность.КоличествоОстаток КАК КоличествоОстаток,
	|				ВТ_Потребность.Подразделение КАК Подразделение,
	|				ВТ_Потребность.Должность КАК Должность,
	|				ВТ_Потребность.ВидАнтропометрии КАК ВидАнтропометрии,
	|				ВТ_Потребность.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|				ВТ_Потребность.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.РостВерхОдежды КАК РостВерхОдежды,
	|				ВТ_Потребность.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|				МИНИМУМ(ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА 0
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|					КОНЕЦ) КАК Приоритет,
	|				ВТ_Потребность.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|				ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|			ИЗ
	|				ВТ_Потребность КАК ВТ_Потребность
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|						И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|						И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|					ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|					ПО ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТ_Потребность.Организация,
	|				ВТ_Потребность.Сотрудник,
	|				ВТ_Потребность.НормаВыдачи,
	|				ВТ_Потребность.НоменклатураНормы,
	|				ВТ_Потребность.ВидВыдачиСИЗ,
	|				ВТ_Потребность.ДатаПотребности,
	|				ВТ_Потребность.КоличествоОстаток,
	|				ВТ_Потребность.Подразделение,
	|				ВТ_Потребность.Должность,
	|				ВТ_Потребность.ВидАнтропометрии,
	|				ВТ_Потребность.ЗначениеАнтропометрии,
	|				ВТ_Потребность.Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.РостВерхОдежды,
	|				ВТ_Потребность.РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.ПериодичностьВыдачиТипПериода,
	|				ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов) КАК ВТ_НоменклатураБезМетрик1
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВТ_Потребность.Организация КАК Организация,
	|					ВТ_Потребность.Сотрудник КАК Сотрудник,
	|					ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|					ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|					ВТ_Потребность.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|					ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|					ВТ_Потребность.КоличествоОстаток КАК КоличествоОстаток,
	|					ВТ_Потребность.Подразделение КАК Подразделение,
	|					ВТ_Потребность.Должность КАК Должность,
	|					ВТ_Потребность.ВидАнтропометрии КАК ВидАнтропометрии,
	|					ВТ_Потребность.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|					ВТ_Потребность.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|					ВТ_Потребность.РостВерхОдежды КАК РостВерхОдежды,
	|					ВТ_Потребность.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|					ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА 0
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|					КОНЕЦ КАК Приоритет,
	|					ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|					КОНЕЦ КАК Номенклатура,
	|					ВТ_Потребность.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|					ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|				ИЗ
	|					ВТ_Потребность КАК ВТ_Потребность
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|							И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|							И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|						ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|						ПО ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский))) КАК ВТ_НоменклатураБезМетрик2
	|				ПО ВТ_НоменклатураБезМетрик1.Организация = ВТ_НоменклатураБезМетрик2.Организация
	|					И ВТ_НоменклатураБезМетрик1.Сотрудник = ВТ_НоменклатураБезМетрик2.Сотрудник
	|					И ВТ_НоменклатураБезМетрик1.НормаВыдачи = ВТ_НоменклатураБезМетрик2.НормаВыдачи
	|					И ВТ_НоменклатураБезМетрик1.НоменклатураНормы = ВТ_НоменклатураБезМетрик2.НоменклатураНормы
	|					И ВТ_НоменклатураБезМетрик1.ВидВыдачиСИЗ = ВТ_НоменклатураБезМетрик2.ВидВыдачиСИЗ
	|					И ВТ_НоменклатураБезМетрик1.ДатаПотребности = ВТ_НоменклатураБезМетрик2.ДатаПотребности
	|					И ВТ_НоменклатураБезМетрик1.КоличествоОстаток = ВТ_НоменклатураБезМетрик2.КоличествоОстаток
	|					И ВТ_НоменклатураБезМетрик1.ВидАнтропометрии = ВТ_НоменклатураБезМетрик2.ВидАнтропометрии
	|					И ВТ_НоменклатураБезМетрик1.ЗначениеАнтропометрии = ВТ_НоменклатураБезМетрик2.ЗначениеАнтропометрии
	|					И ВТ_НоменклатураБезМетрик1.Рост = ВТ_НоменклатураБезМетрик2.Рост
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|					И ВТ_НоменклатураБезМетрик1.РостВерхОдежды = ВТ_НоменклатураБезМетрик2.РостВерхОдежды
	|					И ВТ_НоменклатураБезМетрик1.РостНизОдежды = ВТ_НоменклатураБезМетрик2.РостНизОдежды
	//---АСТБ_ALEXEY_110616_**************************************************************
	|					И ВТ_НоменклатураБезМетрик1.Приоритет = ВТ_НоменклатураБезМетрик2.Приоритет
	|					И ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиТипПериода = ВТ_НоменклатураБезМетрик2.ПериодичностьВыдачиТипПериода
	|					И ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиКоличествоПериодов = ВТ_НоменклатураБезМетрик2.ПериодичностьВыдачиКоличествоПериодов) КАК ВТ_НоменклатураБезМетрик_Пол_Женский
	|		ПО ВТ_Потребность.Организация = ВТ_НоменклатураБезМетрик_Пол_Женский.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_НоменклатураБезМетрик_Пол_Женский.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_НоменклатураБезМетрик_Пол_Женский.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_НоменклатураБезМетрик_Пол_Женский.НоменклатураНормы
	|			И ВТ_Потребность.ВидВыдачиСИЗ = ВТ_НоменклатураБезМетрик_Пол_Женский.ВидВыдачиСИЗ
	|			И ВТ_Потребность.ДатаПотребности = ВТ_НоменклатураБезМетрик_Пол_Женский.ДатаПотребности
	|			И ВТ_Потребность.КоличествоОстаток = ВТ_НоменклатураБезМетрик_Пол_Женский.КоличествоОстаток
	|			И ВТ_Потребность.Подразделение = ВТ_НоменклатураБезМетрик_Пол_Женский.Подразделение
	|			И ВТ_Потребность.Должность = ВТ_НоменклатураБезМетрик_Пол_Женский.Должность
	|			И ВТ_Потребность.ВидАнтропометрии = ВТ_НоменклатураБезМетрик_Пол_Женский.ВидАнтропометрии
	|			И ВТ_Потребность.ЗначениеАнтропометрии = ВТ_НоменклатураБезМетрик_Пол_Женский.ЗначениеАнтропометрии
	|			И ВТ_Потребность.Рост = ВТ_НоменклатураБезМетрик_Пол_Женский.Рост
	|			И ВТ_Потребность.ПериодичностьВыдачиТипПериода = ВТ_НоменклатураБезМетрик_Пол_Женский.ПериодичностьВыдачиТипПериода
	|			И ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов = ВТ_НоменклатураБезМетрик_Пол_Женский.ПериодичностьВыдачиКоличествоПериодов
	|			И (ВТ_НоменклатураБезМетрик_Пол_Женский.Номенклатура.Пол = ВТ_Потребность.Сотрудник.ФизическоеЛицо.Пол)
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|			И ВТ_Потребность.РостВерхОдежды = ВТ_НоменклатураБезМетрик_Пол_Женский.РостВерхОдежды
	|			И ВТ_Потребность.РостНизОдежды = ВТ_НоменклатураБезМетрик_Пол_Женский.РостНизОдежды
	//---АСТБ_ALEXEY_110616_**************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_НоменклатураБезМетрик1.Организация КАК Организация,
	|			ВТ_НоменклатураБезМетрик1.Сотрудник КАК Сотрудник,
	|			ВТ_НоменклатураБезМетрик1.НормаВыдачи КАК НормаВыдачи,
	|			ВТ_НоменклатураБезМетрик1.НоменклатураНормы КАК НоменклатураНормы,
	|			ВТ_НоменклатураБезМетрик1.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|			ВТ_НоменклатураБезМетрик1.ДатаПотребности КАК ДатаПотребности,
	|			ВТ_НоменклатураБезМетрик1.КоличествоОстаток КАК КоличествоОстаток,
	|			ВТ_НоменклатураБезМетрик1.Подразделение КАК Подразделение,
	|			ВТ_НоменклатураБезМетрик1.Должность КАК Должность,
	|			ВТ_НоменклатураБезМетрик1.ВидАнтропометрии КАК ВидАнтропометрии,
	|			ВТ_НоменклатураБезМетрик1.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|			ВТ_НоменклатураБезМетрик1.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|			ВТ_НоменклатураБезМетрик1.РостВерхОдежды КАК РостВерхОдежды,
	|			ВТ_НоменклатураБезМетрик1.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|			ВТ_НоменклатураБезМетрик1.Приоритет КАК Приоритет,
	|			ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|			ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|			ВТ_НоменклатураБезМетрик2.Номенклатура КАК Номенклатура
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_Потребность.Организация КАК Организация,
	|				ВТ_Потребность.Сотрудник КАК Сотрудник,
	|				ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|				ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|				ВТ_Потребность.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|				ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|				ВТ_Потребность.КоличествоОстаток КАК КоличествоОстаток,
	|				ВТ_Потребность.Подразделение КАК Подразделение,
	|				ВТ_Потребность.Должность КАК Должность,
	|				ВТ_Потребность.ВидАнтропометрии КАК ВидАнтропометрии,
	|				ВТ_Потребность.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|				ВТ_Потребность.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.РостВерхОдежды КАК РостВерхОдежды,
	|				ВТ_Потребность.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|				МИНИМУМ(ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА 0
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|					КОНЕЦ) КАК Приоритет,
	|				ВТ_Потребность.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|				ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|			ИЗ
	|				ВТ_Потребность КАК ВТ_Потребность
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|						И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|						И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|					ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|						И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|					ПО ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|						И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|					ПО ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|						И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|						И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТ_Потребность.Организация,
	|				ВТ_Потребность.Сотрудник,
	|				ВТ_Потребность.НормаВыдачи,
	|				ВТ_Потребность.НоменклатураНормы,
	|				ВТ_Потребность.ВидВыдачиСИЗ,
	|				ВТ_Потребность.ДатаПотребности,
	|				ВТ_Потребность.КоличествоОстаток,
	|				ВТ_Потребность.Подразделение,
	|				ВТ_Потребность.Должность,
	|				ВТ_Потребность.ВидАнтропометрии,
	|				ВТ_Потребность.ЗначениеАнтропометрии,
	|				ВТ_Потребность.Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.РостВерхОдежды,
	|				ВТ_Потребность.РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|				ВТ_Потребность.ПериодичностьВыдачиТипПериода,
	|				ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов) КАК ВТ_НоменклатураБезМетрик1
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВТ_Потребность.Организация КАК Организация,
	|					ВТ_Потребность.Сотрудник КАК Сотрудник,
	|					ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|					ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|					ВТ_Потребность.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|					ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|					ВТ_Потребность.КоличествоОстаток КАК КоличествоОстаток,
	|					ВТ_Потребность.Подразделение КАК Подразделение,
	|					ВТ_Потребность.Должность КАК Должность,
	|					ВТ_Потребность.ВидАнтропометрии КАК ВидАнтропометрии,
	|					ВТ_Потребность.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|					ВТ_Потребность.Рост КАК Рост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|					ВТ_Потребность.РостВерхОдежды КАК РостВерхОдежды,
	|					ВТ_Потребность.РостНизОдежды КАК РостНизОдежды,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|					ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА 0
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Приоритет
	|					КОНЕЦ КАК Приоритет,
	|					ВЫБОР
	|						КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|													ТОГДА ВЫБОР
	|															КОГДА ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																ТОГДА ВЫБОР
	|																		КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура ЕСТЬ NULL
	|																			ТОГДА ВЫБОР
	|																					КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура ЕСТЬ NULL
	|																						ТОГДА ВЫБОР
	|																								КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																									ТОГДА ВЫБОР
	|																											КОГДА ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура ЕСТЬ NULL
	|																												ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|																											ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|																										КОНЕЦ
	|																								ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|																							КОНЕЦ
	|																					ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|																				КОНЕЦ
	|																		ИНАЧЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|																	КОНЕЦ
	|															ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|														КОНЕЦ
	|												ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|											КОНЕЦ
	|									ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|					КОНЕЦ КАК Номенклатура,
	|					ВТ_Потребность.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|					ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|				ИЗ
	|					ВТ_Потребность КАК ВТ_Потребность
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Сотрудник
	|							И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Подразделение
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Сотрудник
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Сотрудник
	|							И ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Подразделение
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Сотрудник = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Сотрудник
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность
	|						ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Подразделение
	|							И ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|						ПО ВТ_Потребность.Должность = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Должность
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.Подразделение = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Подразделение
	|							И ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|						ПО ВТ_Потребность.НоменклатураНормы = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|							И ВТ_Потребность.Организация = ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность._Организация
	|							И (ВТ_ИтоговыйМаппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка))) КАК ВТ_НоменклатураБезМетрик2
	|				ПО ВТ_НоменклатураБезМетрик1.Организация = ВТ_НоменклатураБезМетрик2.Организация
	|					И ВТ_НоменклатураБезМетрик1.Сотрудник = ВТ_НоменклатураБезМетрик2.Сотрудник
	|					И ВТ_НоменклатураБезМетрик1.НормаВыдачи = ВТ_НоменклатураБезМетрик2.НормаВыдачи
	|					И ВТ_НоменклатураБезМетрик1.НоменклатураНормы = ВТ_НоменклатураБезМетрик2.НоменклатураНормы
	|					И ВТ_НоменклатураБезМетрик1.ВидВыдачиСИЗ = ВТ_НоменклатураБезМетрик2.ВидВыдачиСИЗ
	|					И ВТ_НоменклатураБезМетрик1.ДатаПотребности = ВТ_НоменклатураБезМетрик2.ДатаПотребности
	|					И ВТ_НоменклатураБезМетрик1.КоличествоОстаток = ВТ_НоменклатураБезМетрик2.КоличествоОстаток
	|					И ВТ_НоменклатураБезМетрик1.ВидАнтропометрии = ВТ_НоменклатураБезМетрик2.ВидАнтропометрии
	|					И ВТ_НоменклатураБезМетрик1.ЗначениеАнтропометрии = ВТ_НоменклатураБезМетрик2.ЗначениеАнтропометрии
	|					И ВТ_НоменклатураБезМетрик1.Рост = ВТ_НоменклатураБезМетрик2.Рост
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|					И ВТ_НоменклатураБезМетрик1.РостВерхОдежды = ВТ_НоменклатураБезМетрик2.РостВерхОдежды
	|					И ВТ_НоменклатураБезМетрик1.РостНизОдежды = ВТ_НоменклатураБезМетрик2.РостНизОдежды
	//---АСТБ_ALEXEY_110616_**************************************************************
	|					И ВТ_НоменклатураБезМетрик1.Приоритет = ВТ_НоменклатураБезМетрик2.Приоритет
	|					И ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиТипПериода = ВТ_НоменклатураБезМетрик2.ПериодичностьВыдачиТипПериода
	|					И ВТ_НоменклатураБезМетрик1.ПериодичностьВыдачиКоличествоПериодов = ВТ_НоменклатураБезМетрик2.ПериодичностьВыдачиКоличествоПериодов) КАК ВТ_НоменклатураБезМетрик_Пол_Пустой
	|		ПО ВТ_Потребность.Организация = ВТ_НоменклатураБезМетрик_Пол_Пустой.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_НоменклатураБезМетрик_Пол_Пустой.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_НоменклатураБезМетрик_Пол_Пустой.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_НоменклатураБезМетрик_Пол_Пустой.НоменклатураНормы
	|			И ВТ_Потребность.ВидВыдачиСИЗ = ВТ_НоменклатураБезМетрик_Пол_Пустой.ВидВыдачиСИЗ
	|			И ВТ_Потребность.ДатаПотребности = ВТ_НоменклатураБезМетрик_Пол_Пустой.ДатаПотребности
	|			И ВТ_Потребность.КоличествоОстаток = ВТ_НоменклатураБезМетрик_Пол_Пустой.КоличествоОстаток
	|			И ВТ_Потребность.Подразделение = ВТ_НоменклатураБезМетрик_Пол_Пустой.Подразделение
	|			И ВТ_Потребность.Должность = ВТ_НоменклатураБезМетрик_Пол_Пустой.Должность
	|			И ВТ_Потребность.ВидАнтропометрии = ВТ_НоменклатураБезМетрик_Пол_Пустой.ВидАнтропометрии
	|			И ВТ_Потребность.ЗначениеАнтропометрии = ВТ_НоменклатураБезМетрик_Пол_Пустой.ЗначениеАнтропометрии
	|			И ВТ_Потребность.Рост = ВТ_НоменклатураБезМетрик_Пол_Пустой.Рост
	//+++АСТБ_ALEXEY_110616_**************************************************************
	|			И ВТ_Потребность.РостВерхОдежды = ВТ_НоменклатураБезМетрик_Пол_Пустой.РостВерхОдежды
	|			И ВТ_Потребность.РостНизОдежды = ВТ_НоменклатураБезМетрик_Пол_Пустой.РостНизОдежды
	//---АСТБ_ALEXEY_110616_**************************************************************
	|			И ВТ_Потребность.ПериодичностьВыдачиТипПериода = ВТ_НоменклатураБезМетрик_Пол_Пустой.ПериодичностьВыдачиТипПериода
	|			И ВТ_Потребность.ПериодичностьВыдачиКоличествоПериодов = ВТ_НоменклатураБезМетрик_Пол_Пустой.ПериодичностьВыдачиКоличествоПериодов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры,
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Метрика КАК Метрика
	|ПОМЕСТИТЬ ВТ_ХарактеристикиНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_НоменклатураБезМетрик.Номенклатура
	|			ИЗ
	|				ВТ_НоменклатураБезМетрик КАК ВТ_НоменклатураБезМетрик)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Метрика,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ХарактеристикиНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НоменклатураСХарактеристикой
	|ИЗ
	|	ВТ_ХарактеристикиНоменклатуры КАК ВТ_ХарактеристикиНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураБезМетрик.Организация КАК Организация,
	|	ВТ_НоменклатураБезМетрик.Сотрудник КАК Сотрудник,
	|	ВТ_НоменклатураБезМетрик.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_НоменклатураБезМетрик.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_НоменклатураБезМетрик.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_НоменклатураБезМетрик.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_НоменклатураБезМетрик.КоличествоОстаток КАК Количество,
	|	ВТ_НоменклатураБезМетрик.Подразделение КАК Подразделение,
	|	ВТ_НоменклатураБезМетрик.Должность КАК Должность,
	|	ВТ_НоменклатураБезМетрик.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_НоменклатураБезМетрик.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_НоменклатураБезМетрик.Номенклатура.ИспользоватьРост КАК ИспользоватьРост,
	//+++АСТБ_ALEXEY_110616_**************************************************************
	//|	ВТ_НоменклатураБезМетрик.Рост КАК Рост,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураБезМетрик.Номенклатура.ИспользоватьРост
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НоменклатураБезМетрик.Номенклатура.ВидРоста = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.Рост)
	|						ТОГДА ВТ_НоменклатураБезМетрик.Рост
	|					КОГДА ВТ_НоменклатураБезМетрик.Номенклатура.ВидРоста = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РостВерхОдежды)
	|						ТОГДА ВТ_НоменклатураБезМетрик.РостВерхОдежды
	|					КОГДА ВТ_НоменклатураБезМетрик.Номенклатура.ВидРоста = ЗНАЧЕНИЕ(Справочник.ВидыАнтропометрическихСвойств.РостНизОдежды)
	|						ТОГДА ВТ_НоменклатураБезМетрик.РостНизОдежды
	|					ИНАЧЕ ВТ_НоменклатураБезМетрик.Рост
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_НоменклатураБезМетрик.Рост
	|	КОНЕЦ КАК Рост,
	//---АСТБ_ALEXEY_110616_**************************************************************
	|	ВТ_НоменклатураБезМетрик.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураБезМетрик.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_НоменклатураБезМетрик.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_НоменклатураБезМетрик.Номенклатура.ВидАнтропометрическогоСвойства КАК ВидАнтропометрииНоменклатуры,
	|	ЕСТЬNULL(ВТ_АнтропометрияСотрудников.ЗначениеСвойства, 0) КАК ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_НоменклатураБезМетрик.Сотрудник.ФизическоеЛицо.Пол КАК ПолСотрудника,
	|	ВТ_НоменклатураБезМетрик.Номенклатура.ВидСИЗ КАК ВидСИЗ,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_НоменклатураБезМетрик.КоличествоОстаток КАК Сумма,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК НачалоИнтервала,
	|	"""" КАК ПредставлениеИнтервала,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1000)) КАК НоменклатурныйНомер,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1000)) КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураСХарактеристикой.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьРазмеры
	|ПОМЕСТИТЬ ВТ_РезультатНоменклатураБезМетрик
	|ИЗ
	|	ВТ_НоменклатураБезМетрик КАК ВТ_НоменклатураБезМетрик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АнтропометрияСотрудников КАК ВТ_АнтропометрияСотрудников
	|		ПО ВТ_НоменклатураБезМетрик.Сотрудник = ВТ_АнтропометрияСотрудников.Сотрудник
	|			И ВТ_НоменклатураБезМетрик.Номенклатура.ВидАнтропометрическогоСвойства = ВТ_АнтропометрияСотрудников.ВидСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_НоменклатураБезМетрик.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_НоменклатураБезМетрик.Организация = ВТ_ЦеныНоменклатуры._Организация
	|			И ВТ_НоменклатураБезМетрик.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатураСХарактеристикой КАК ВТ_НоменклатураСХарактеристикой
	|		ПО ВТ_НоменклатураБезМетрик.Номенклатура = ВТ_НоменклатураСХарактеристикой.Номенклатура
	|ГДЕ
	|	НЕ ВТ_НоменклатураБезМетрик.Номенклатура = НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураБезМетрик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РезультатНоменклатураБезМетрик.Организация КАК Организация,
	|	ВТ_РезультатНоменклатураБезМетрик.Сотрудник КАК Сотрудник,
	|	ВТ_РезультатНоменклатураБезМетрик.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_РезультатНоменклатураБезМетрик.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_РезультатНоменклатураБезМетрик.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_РезультатНоменклатураБезМетрик.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_РезультатНоменклатураБезМетрик.Подразделение КАК Подразделение,
	|	ВТ_РезультатНоменклатураБезМетрик.Должность КАК Должность,
	|	ВТ_РезультатНоменклатураБезМетрик.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_РезультатНоменклатураБезМетрик.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_РезультатНоменклатураБезМетрик.Рост КАК Рост,
	|	ВТ_РезультатНоменклатураБезМетрик.Номенклатура КАК Номенклатура,
	|	ВТ_РезультатНоменклатураБезМетрик.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_РезультатНоменклатураБезМетрик.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_РезультатНоменклатураБезМетрик.ВидАнтропометрииНоменклатуры КАК ВидАнтропометрииНоменклатуры,
	|	ВТ_РезультатНоменклатураБезМетрик.ЗначениеАнтропометрииНоменклатуры КАК ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_РезультатНоменклатураБезМетрик.Количество КАК Количество,
	|	ВТ_РезультатНоменклатураБезМетрик.Цена КАК Цена,
	|	ВТ_РезультатНоменклатураБезМетрик.Сумма КАК Сумма,
	|	ВТ_РезультатНоменклатураБезМетрик.НачалоИнтервала КАК НачалоИнтервала,
	|	ВТ_РезультатНоменклатураБезМетрик.ПредставлениеИнтервала КАК ПредставлениеИнтервала,
	|	ВТ_РезультатНоменклатураБезМетрик.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ВТ_РезультатНоменклатураБезМетрик.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ЕСТЬNULL(СоответствияХарактеристикНоменклатуры.Метрика, ЗНАЧЕНИЕ(Справочник.Метрики.ПустаяСсылка)) КАК Метрика
	|ПОМЕСТИТЬ ВТ_РезультатНоменклатураСМетрикой
	|ИЗ
	|	ВТ_РезультатНоменклатураБезМетрик КАК ВТ_РезультатНоменклатураБезМетрик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияХарактеристикНоменклатуры КАК СоответствияХарактеристикНоменклатуры
	|		ПО (ВЫБОР
	|				КОГДА ВТ_РезультатНоменклатураБезМетрик.ЕстьРазмеры
	|					ТОГДА ВТ_РезультатНоменклатураБезМетрик.ЗначениеАнтропометрииНоменклатуры = СоответствияХарактеристикНоменклатуры.Размер
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_РезультатНоменклатураБезМетрик.ЕстьРазмеры
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_РезультатНоменклатураБезМетрик.ИспользоватьРост
	|								ТОГДА ВТ_РезультатНоменклатураБезМетрик.Рост = СоответствияХарактеристикНоменклатуры.Рост
	|							ИНАЧЕ СоответствияХарактеристикНоменклатуры.Рост = 0
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_РезультатНоменклатураБезМетрик.ЕстьРазмеры
	|					ТОГДА ВЫБОР
	|							КОГДА СоответствияХарактеристикНоменклатуры.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
	|								ТОГДА ВТ_РезультатНоменклатураБезМетрик.ПолСотрудника = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
	|							КОГДА СоответствияХарактеристикНоменклатуры.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	|								ТОГДА ВТ_РезультатНоменклатураБезМетрик.ПолСотрудника = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВТ_РезультатНоменклатураБезМетрик.ЕстьРазмеры
	|					ТОГДА ВЫБОР
	|							КОГДА СоответствияХарактеристикНоменклатуры.ДополнительноеУсловие = ЗНАЧЕНИЕ(Справочник.ВидыСИЗ.ПустаяСсылка)
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ВТ_РезультатНоменклатураБезМетрик.ВидСИЗ = СоответствияХарактеристикНоменклатуры.ДополнительноеУсловие
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Метрика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РезультатНоменклатураБезМетрик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Организация КАК Организация,
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатурыПоСкладам
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ДатаОкончания,
	|			Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_РезультатНоменклатураСМетрикой.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_РезультатНоменклатураСМетрикой КАК ВТ_РезультатНоменклатураСМетрикой)
	|				И ВЫБОР
	|					КОГДА &ОстаткиБезОрганизации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								ВТ_РезультатНоменклатураСМетрикой.Организация КАК Организация
	|							ИЗ
	|								ВТ_РезультатНоменклатураСМетрикой КАК ВТ_РезультатНоменклатураСМетрикой)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА НЕ &СкладНеВыбран
	|						ТОГДА Склад В (&Склад)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ОстаткиНоменклатурыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РезультатНоменклатураСМетрикой.Организация КАК Организация,
	|	ВТ_РезультатНоменклатураСМетрикой.Сотрудник КАК Сотрудник,
	|	ВТ_РезультатНоменклатураСМетрикой.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_РезультатНоменклатураСМетрикой.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_РезультатНоменклатураСМетрикой.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_РезультатНоменклатураСМетрикой.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_РезультатНоменклатураСМетрикой.Подразделение КАК Подразделение,
	|	ВТ_РезультатНоменклатураСМетрикой.Должность КАК Должность,
	|	ВТ_РезультатНоменклатураСМетрикой.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_РезультатНоменклатураСМетрикой.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_РезультатНоменклатураСМетрикой.Рост КАК Рост,
	|	ВТ_РезультатНоменклатураСМетрикой.Номенклатура КАК Номенклатура,
	|	ВТ_РезультатНоменклатураСМетрикой.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_РезультатНоменклатураСМетрикой.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_РезультатНоменклатураСМетрикой.ВидАнтропометрииНоменклатуры КАК ВидАнтропометрииНоменклатуры,
	|	ВТ_РезультатНоменклатураСМетрикой.ЗначениеАнтропометрииНоменклатуры КАК ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_РезультатНоменклатураСМетрикой.Количество КАК Количество,
	|	ВТ_РезультатНоменклатураСМетрикой.Цена КАК Цена,
	|	ВТ_РезультатНоменклатураСМетрикой.Сумма КАК Сумма,
	|	ВТ_РезультатНоменклатураСМетрикой.НачалоИнтервала КАК НачалоИнтервала,
	|	ВТ_РезультатНоменклатураСМетрикой.ПредставлениеИнтервала КАК ПредставлениеИнтервала,
	|	ВТ_РезультатНоменклатураСМетрикой.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ВТ_РезультатНоменклатураСМетрикой.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ХарактеристикиНоменклатуры.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_РезультатНоменклатураСМетрикой КАК ВТ_РезультатНоменклатураСМетрикой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиНоменклатуры КАК ВТ_ХарактеристикиНоменклатуры
	|		ПО ВТ_РезультатНоменклатураСМетрикой.Номенклатура = ВТ_ХарактеристикиНоменклатуры.Номенклатура
	|			И ВТ_РезультатНоменклатураСМетрикой.Метрика = ВТ_ХарактеристикиНоменклатуры.Метрика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РезультатНоменклатураСМетрикой.ДатаПотребности,
	|	ВТ_РезультатНоменклатураСМетрикой.НормаВыдачи,
	|	ВТ_РезультатНоменклатураСМетрикой.НоменклатураНормы,
	|	ВТ_РезультатНоменклатураСМетрикой.ВидВыдачиСИЗ,
	|	ВТ_РезультатНоменклатураСМетрикой.Организация,
	|	ВТ_РезультатНоменклатураСМетрикой.Сотрудник,
	|	ВТ_РезультатНоменклатураСМетрикой.Номенклатура,
	|	ВТ_РезультатНоменклатураСМетрикой.ВидАнтропометрии,
	|	ВТ_РезультатНоменклатураСМетрикой.Должность,
	|	ВТ_РезультатНоменклатураСМетрикой.Подразделение,
	|	ВТ_РезультатНоменклатураСМетрикой.ПериодичностьВыдачиТипПериода,
	|	ВТ_РезультатНоменклатураСМетрикой.ВидАнтропометрииНоменклатуры,
	|	ВТ_РезультатНоменклатураСМетрикой.НачалоИнтервала,
	|	ВТ_РезультатНоменклатураСМетрикой.ПредставлениеИнтервала,
	|	ВТ_РезультатНоменклатураСМетрикой.НоменклатурныйНомер,
	|	ВТ_РезультатНоменклатураСМетрикой.НаименованиеОрганизации,
	|	ВТ_РезультатНоменклатураСМетрикой.ЗначениеАнтропометрии,
	|	ВТ_РезультатНоменклатураСМетрикой.Рост,
	|	ВТ_РезультатНоменклатураСМетрикой.ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_РезультатНоменклатураСМетрикой.ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_РезультатНоменклатураСМетрикой.Количество,
	|	ВТ_РезультатНоменклатураСМетрикой.Цена,
	|	ВТ_РезультатНоменклатураСМетрикой.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатурныеНомераОрганизаций.Организация КАК Организация,
	|	НоменклатурныеНомераОрганизаций.Номенклатура КАК Номенклатура,
	|	НоменклатурныеНомераОрганизаций.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	НоменклатурныеНомераОрганизаций.НаименованиеОрганизации КАК НаименованиеОрганизации
	|ИЗ
	|	РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Итог.Организация КАК Организация,
	|	ВТ_Итог.Сотрудник КАК Сотрудник,
	|	ВТ_Итог.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Итог.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Итог.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_Итог.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Итог.Подразделение КАК Подразделение,
	|	ВТ_Итог.Должность КАК Должность,
	|	ВТ_Итог.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_Итог.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_Итог.Рост КАК Рост,
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_Итог.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_Итог.ВидАнтропометрииНоменклатуры КАК ВидАнтропометрииНоменклатуры,
	|	ВТ_Итог.ЗначениеАнтропометрииНоменклатуры КАК ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.Цена КАК Цена,
	|	ВТ_Итог.Сумма КАК Сумма,
	|	ВТ_Итог.НачалоИнтервала КАК НачалоИнтервала,
	|	ВТ_Итог.ПредставлениеИнтервала КАК ПредставлениеИнтервала,
	|	ВТ_Итог.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ВТ_Итог.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ВТ_Итог.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//АсТБ_Alexey_71263********************************************************************
	|	ВЫБОР
	|		КОГДА МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ МВЗСотрудников.МВЗ
	|	КОНЕЦ КАК МВЗ,
	//АсТБ_Alexey_71263********************************************************************
	|	ЕСТЬNULL(УстановленныеНормыВыдачиСИЗ.УсловиеНормы, ЗНАЧЕНИЕ(Справочник.УсловияНорм.ПустаяСсылка)) КАК УсловиеНормы,
	|	ЕСТЬNULL(ВТ_ОстаткиНоменклатурыПоСкладам.КоличествоОстаток, 0) КАК КоличествоНаСкладе
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатурыПоСкладам КАК ВТ_ОстаткиНоменклатурыПоСкладам
	|		ПО (ВЫБОР
	|				КОГДА &ОстаткиБезОрганизации
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_Итог.Организация = ВТ_ОстаткиНоменклатурыПоСкладам.Организация
	|			КОНЕЦ)
	|			И ВТ_Итог.Номенклатура = ВТ_ОстаткиНоменклатурыПоСкладам.Номенклатура
	|			И ВТ_Итог.ХарактеристикаНоменклатуры = ВТ_ОстаткиНоменклатурыПоСкладам.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|		ПО ВТ_Итог.Организация = МВЗСотрудников.Организация
	|			И ВТ_Итог.Сотрудник = МВЗСотрудников.Сотрудник
	//+++АСТБ_Горюшин_Алексей_37995
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЗ_МВЗПодразделенийСрезПоследних.МВЗ КАК МВЗ,
	|			ВТ_МВЗПодразделений_Подразделения.Подразделение КАК Подразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|				МАКСИМУМ(МВЗПодразделенийСрезПоследних.Период) КАК Период,
	|				МИНИМУМ(МВЗПодразделенийСрезПоследних.НомерСтроки) КАК НомерСтроки
	|			ИЗ
	|				РегистрСведений.МВЗПодразделений.СрезПоследних(&ТекущаяДата, ) КАК МВЗПодразделенийСрезПоследних
	|			ГДЕ
	|				МВЗПодразделенийСрезПоследних.Использовать = ИСТИНА
	|			
	|			СГРУППИРОВАТЬ ПО
	|				МВЗПодразделенийСрезПоследних.Подразделение) КАК ВТ_МВЗПодразделений_Подразделения
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МВЗПодразделенийСрезПоследних.МВЗ КАК МВЗ,
	|					МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|					МВЗПодразделенийСрезПоследних.Период КАК Период,
	|					МВЗПодразделенийСрезПоследних.НомерСтроки КАК НомерСтроки
	|				ИЗ
	|					РегистрСведений.МВЗПодразделений.СрезПоследних(&ТекущаяДата, ) КАК МВЗПодразделенийСрезПоследних
	|				ГДЕ
	|					МВЗПодразделенийСрезПоследних.Использовать = ИСТИНА) КАК ВЗ_МВЗПодразделенийСрезПоследних
	|				ПО ВТ_МВЗПодразделений_Подразделения.Подразделение = ВЗ_МВЗПодразделенийСрезПоследних.Подразделение
	|					И ВТ_МВЗПодразделений_Подразделения.Период = ВЗ_МВЗПодразделенийСрезПоследних.Период
	|					И ВТ_МВЗПодразделений_Подразделения.НомерСтроки = ВЗ_МВЗПодразделенийСрезПоследних.НомерСтроки) КАК МВЗПодразделений
	//было
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			МВЗПодразделенийСрезПоследних.МВЗ КАК МВЗ,
	//|			МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение
	//|		ИЗ
	//|			РегистрСведений.МВЗПодразделений.СрезПоследних(&ТекущаяДата, ) КАК МВЗПодразделенийСрезПоследних
	//|		ГДЕ
	//|			МВЗПодразделенийСрезПоследних.Использовать = ИСТИНА) КАК МВЗПодразделений
	//---АСТБ_Горюшин_Алексей_37995
	|		ПО ВТ_Итог.Подразделение = МВЗПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УстановленныеНормыВыдачиСИЗСрезПоследних.Организация КАК Организация,
	|			УстановленныеНормыВыдачиСИЗСрезПоследних.Подразделение КАК Подразделение,
	|			УстановленныеНормыВыдачиСИЗСрезПоследних.Должность КАК Должность,
	|			УстановленныеНормыВыдачиСИЗСрезПоследних.УсловиеНормы КАК УсловиеНормы,
	|			УстановленныеНормыВыдачиСИЗСрезПоследних.НормаВыдачи КАК НормаВыдачи
	|		ИЗ
	|			РегистрСведений.УстановленныеНормыВыдачиСИЗ.СрезПоследних(&ТекущаяДата, ) КАК УстановленныеНормыВыдачиСИЗСрезПоследних
	|		ГДЕ
	|			УстановленныеНормыВыдачиСИЗСрезПоследних.Использовать = ИСТИНА) КАК УстановленныеНормыВыдачиСИЗ
	|		ПО ВТ_Итог.Организация = УстановленныеНормыВыдачиСИЗ.Организация
	|			И ВТ_Итог.Подразделение = УстановленныеНормыВыдачиСИЗ.Подразделение
	|			И ВТ_Итог.Должность = УстановленныеНормыВыдачиСИЗ.Должность
	|			И ВТ_Итог.НормаВыдачи = УстановленныеНормыВыдачиСИЗ.НормаВыдачи
	//---АСТБ_Горюшин_Алексей_13335
	//АсТБ_Alexey_71263********************************************************************
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЗ_МВЗДолжностейСрезПоследних.МВЗ КАК МВЗ,
	|			ВТ_МВЗДолжностей_Должности.Организация КАК Организация,
	|			ВТ_МВЗДолжностей_Должности.Должность КАК Должность
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(МВЗДолжностейСрезПоследних.Период) КАК Период,
	|				МВЗДолжностейСрезПоследних.Организация КАК Организация,
	|				МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|				МИНИМУМ(МВЗДолжностейСрезПоследних.НомерСтроки) КАК НомерСтроки
	|			ИЗ
	|				РегистрСведений.МВЗДолжностей.СрезПоследних КАК МВЗДолжностейСрезПоследних
	|			ГДЕ
	|				МВЗДолжностейСрезПоследних.Использовать
	|			
	|			СГРУППИРОВАТЬ ПО
	|				МВЗДолжностейСрезПоследних.Организация,
	|				МВЗДолжностейСрезПоследних.Должность) КАК ВТ_МВЗДолжностей_Должности
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МВЗДолжностейСрезПоследних.Организация КАК Организация,
	|					МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|					МВЗДолжностейСрезПоследних.Период КАК Период,
	|					МВЗДолжностейСрезПоследних.НомерСтроки КАК НомерСтроки,
	|					МВЗДолжностейСрезПоследних.МВЗ КАК МВЗ
	|				ИЗ
	|					РегистрСведений.МВЗДолжностей.СрезПоследних(&ТекущаяДата, ) КАК МВЗДолжностейСрезПоследних
	|				ГДЕ
	|					МВЗДолжностейСрезПоследних.Использовать) КАК ВЗ_МВЗДолжностейСрезПоследних
	|				ПО ВТ_МВЗДолжностей_Должности.Организация = ВЗ_МВЗДолжностейСрезПоследних.Организация
	|					И ВТ_МВЗДолжностей_Должности.Должность = ВЗ_МВЗДолжностейСрезПоследних.Должность
	|					И ВТ_МВЗДолжностей_Должности.Период = ВЗ_МВЗДолжностейСрезПоследних.Период
	|					И ВТ_МВЗДолжностей_Должности.НомерСтроки = ВЗ_МВЗДолжностейСрезПоследних.НомерСтроки) КАК МВЗДолжностей
	|		ПО ВТ_Итог.Организация = МВЗДолжностей.Организация
	|			И ВТ_Итог.Должность = МВЗДолжностей.Должность";
	//АсТБ_Alexey_71263********************************************************************
	
	Запрос.УстановитьПараметр("ТекущаяДата",									ТекущаяДата());
	//+++АСТБ_Горюшин_Алексей_13335
	Запрос.УстановитьПараметр("РассчитыватьПотребностьОтносительноДаты",		РассчитыватьПотребностьОтносительноДаты);
	//было
	//Запрос.УстановитьПараметр("РассчитыватьПотребностьОтносительноТекущейДаты",	РассчитыватьПотребностьОтносительноТекущейДаты);
	//---АСТБ_Горюшин_Алексей_13335
	Запрос.УстановитьПараметр("ДатаНачала",										ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",									ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаОкончания",									ДатаОкончания);
	//***Новосибирск Трегубов А.А.*** --  --  16.04.2019 <<<
	Запрос.УстановитьПараметр("НеУчитыватьНевыданноеРанее",						НеУчитыватьНевыданноеРанее);
	//***Новосибирск Трегубов А.А.*** --  --  16.04.2019 >>>
	
	//NSK_Dolmatov_12/12/2019>>
	Запрос.УстановитьПараметр("Склад",									        ВыбранныйСклад);
	Запрос.УстановитьПараметр("СкладНеВыбран",									СкладНеВыбран);
	//NSK_Dolmatovv_12/12/2019<<
	
	//+++АСТБ_Горюшин_Алексей_13335
	Запрос.УстановитьПараметр("ОстаткиБезОрганизации",					        ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"));
	//---АСТБ_Горюшин_Алексей_13335
	
	//+++АСТБ_Горюшин_Алексей_67572
	Запрос.УстановитьПараметр("ВыбранныйПоставщик",							    ВыбранныйПоставщик);
	Запрос.УстановитьПараметр("ПоставщикВыбран",								ПоставщикВыбран);
	Запрос.УстановитьПараметр("ПриоритетНоменклатурыСЦенами",					ПриоритетНоменклатурыСЦенами);
	//---АСТБ_Горюшин_Алексей_67572
	
	Результат = Запрос.ВыполнитьПакет();
	
	//предварительная таблица
	//+++АСТБ_Горюшин_Алексей_57395
	//+++АСТБ_ALEXEY_110616_**************************************************************
	//ТаблицаЗапроса = Результат[42].Выгрузить();
	ТаблицаЗапроса = Результат[44].Выгрузить();
	//---АСТБ_ALEXEY_110616_**************************************************************
	//было
	//ТаблицаЗапроса = Результат[39].Выгрузить();
	//---АСТБ_Горюшин_Алексей_57395
	
	//номенклатурные номера
	Если ОтображатьНоменклатурныеНомера Тогда
		
		//+++АСТБ_Горюшин_Алексей_57395
		//+++АСТБ_ALEXEY_110616_**************************************************************
		//ТаблицаНоменклатурныхНомеров = Результат[41].Выгрузить();
		ТаблицаНоменклатурныхНомеров = Результат[43].Выгрузить();
		//---АСТБ_ALEXEY_110616_**************************************************************
		//было
		//ТаблицаНоменклатурныхНомеров = Результат[38].Выгрузить();
		//---АСТБ_Горюшин_Алексей_57395
		
		//+++АСТБ_Горюшин_Алексей_67572
		ТаблицаНоменклатурныхНомеров.Индексы.Добавить("Организация, Номенклатура");
		//---АСТБ_Горюшин_Алексей_67572
		
		//заполнение номенклатурных номеров
		Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
			
			СтруктураПоиска = Новый Структура("Организация, Номенклатура", СтрокаТаблицыЗапроса.Организация, СтрокаТаблицыЗапроса.Номенклатура);
			
			НайденныеСтроки = ТаблицаНоменклатурныхНомеров.НайтиСтроки(СтруктураПоиска);
			
			ПерваяСтрока = Истина;
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если ПерваяСтрока Тогда
					СтрокаТаблицыЗапроса.НоменклатурныйНомер = НайденнаяСтрока.НоменклатурныйНомер;
					ПерваяСтрока = Ложь;
				Иначе
					СтрокаТаблицыЗапроса.НоменклатурныйНомер = СтрокаТаблицыЗапроса.НоменклатурныйНомер + ", " + НайденнаяСтрока.НоменклатурныйНомер;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//+++АСТБ_Горюшин_Алексей_23751
	//наименование организации номенклатуры
	Если ОтображатьНаименованиеОрганизации Тогда
		
		//+++АСТБ_Горюшин_Алексей_57395
		//+++АСТБ_ALEXEY_110616_**************************************************************
		//ТаблицаНоменклатурныхНомеров = Результат[41].Выгрузить();
		ТаблицаНоменклатурныхНомеров = Результат[43].Выгрузить();
		//---АСТБ_ALEXEY_110616_**************************************************************
		//было
		//ТаблицаНоменклатурныхНомеров = Результат[38].Выгрузить();
		//---АСТБ_Горюшин_Алексей_57395
		
		//+++АСТБ_Горюшин_Алексей_67572
		ТаблицаНоменклатурныхНомеров.Индексы.Добавить("Организация, Номенклатура");
		//---АСТБ_Горюшин_Алексей_67572
		
		//заполнение наименований организации
		Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
			
			СтруктураПоиска = Новый Структура("Организация, Номенклатура", СтрокаТаблицыЗапроса.Организация, СтрокаТаблицыЗапроса.Номенклатура);
			
			НайденныеСтроки = ТаблицаНоменклатурныхНомеров.НайтиСтроки(СтруктураПоиска);
			
			ПерваяСтрока = Истина;
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если ПерваяСтрока Тогда
					СтрокаТаблицыЗапроса.НаименованиеОрганизации = НайденнаяСтрока.НаименованиеОрганизации;
					ПерваяСтрока = Ложь;
				Иначе
					СтрокаТаблицыЗапроса.НаименованиеОрганизации = СтрокаТаблицыЗапроса.НаименованиеОрганизации + ", " + НайденнаяСтрока.НаименованиеОрганизации;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	//---АСТБ_Горюшин_Алексей_23751

	//результат для передачи в СКД
	ТаблицаДляВывода = ТаблицаЗапроса.Скопировать();
	ТаблицаДляВывода.Очистить();
	
	Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Если СтрокаТаблицыЗапроса.ПериодичностьВыдачиТипПериода = Перечисления.ДоступныеПериодыОтчета.Год Тогда
			Множитель = 12 * СтрокаТаблицыЗапроса.ПериодичностьВыдачиКоличествоПериодов;
		Иначе
			Множитель = СтрокаТаблицыЗапроса.ПериодичностьВыдачиКоличествоПериодов;
		КонецЕсли;
		
		Если СтрокаТаблицыЗапроса.ДатаПотребности < ДатаНачала Тогда
			
			СледующаяДатаПотребности = ДобавитьМесяц(СтрокаТаблицыЗапроса.ДатаПотребности,Множитель);
			
			//догоняем потребность до попадания в период
			Пока СледующаяДатаПотребности < ДатаНачала Цикл
				
				СледующаяДатаПотребности = ДобавитьМесяц(СледующаяДатаПотребности,Множитель);
			
			КонецЦикла;
			
			Если СледующаяДатаПотребности >= НачалоДня(ДатаНачала) И СледующаяДатаПотребности <= КонецДня(ДатаОкончания) Тогда
				
				НоваяСтрока = ТаблицаДляВывода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
				
				Если ТипПериода = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда
					НоваяСтрока.НачалоИнтервала = НачалоМесяца(СледующаяДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Квартал Тогда
					НоваяСтрока.НачалоИнтервала = НачалоКвартала(СледующаяДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год Тогда
					НоваяСтрока.НачалоИнтервала = НачалоГода(СледующаяДатаПотребности);
				КонецЕсли;
				
			КонецЕсли;
		
			СледующаяДатаПотребности = ДобавитьМесяц(СледующаяДатаПотребности,Множитель);
			
			//бежим дальше
			Пока СледующаяДатаПотребности < КонецДня(ДатаОкончания) Цикл
				
				НоваяСтрока = ТаблицаДляВывода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
				
				Если ТипПериода = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда
					НоваяСтрока.НачалоИнтервала = НачалоМесяца(СледующаяДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Квартал Тогда
					НоваяСтрока.НачалоИнтервала = НачалоКвартала(СледующаяДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год Тогда
					НоваяСтрока.НачалоИнтервала = НачалоГода(СледующаяДатаПотребности);
				КонецЕсли;
				
				СледующаяДатаПотребности = ДобавитьМесяц(СледующаяДатаПотребности,Множитель);
				
			КонецЦикла;
			
		Иначе
			
			Если СтрокаТаблицыЗапроса.ДатаПотребности >= НачалоДня(ДатаНачала) И СтрокаТаблицыЗапроса.ДатаПотребности <= КонецДня(ДатаОкончания) Тогда
				
				НоваяСтрока = ТаблицаДляВывода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
				
				Если ТипПериода = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда
					НоваяСтрока.НачалоИнтервала = НачалоМесяца(СтрокаТаблицыЗапроса.ДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Квартал Тогда
					НоваяСтрока.НачалоИнтервала = НачалоКвартала(СтрокаТаблицыЗапроса.ДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год Тогда
					НоваяСтрока.НачалоИнтервала = НачалоГода(СтрокаТаблицыЗапроса.ДатаПотребности);
				КонецЕсли;
				
			КонецЕсли;
			
			СледующаяДатаПотребности = ДобавитьМесяц(СтрокаТаблицыЗапроса.ДатаПотребности,Множитель);
			
			//бежим дальше
			Пока СледующаяДатаПотребности < ДатаОкончания Цикл
				
				НоваяСтрока = ТаблицаДляВывода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
				
				Если ТипПериода = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда
					НоваяСтрока.НачалоИнтервала = НачалоМесяца(СледующаяДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Квартал Тогда
					НоваяСтрока.НачалоИнтервала = НачалоКвартала(СледующаяДатаПотребности);
				ИначеЕсли ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год Тогда
					НоваяСтрока.НачалоИнтервала = НачалоГода(СледующаяДатаПотребности);
				КонецЕсли;
				
				СледующаяДатаПотребности = ДобавитьМесяц(СледующаяДатаПотребности,Множитель);
				
			КонецЦикла;			
			
		КонецЕсли;	
		
	КонецЦикла;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	//+++АСТБ_Горюшин_Алексей_54520
	ДобавлениеУточненныхОснованийНорм(ТаблицаДляВывода);
	//---АСТБ_Горюшин_Алексей_54520
	
	НаборыВнешнихДанных = Новый Структура;
	НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаДляВывода);
	
	//Инициализировать(<Макет>, <ВнешниеНаборыДанных>, <ДанныеРасшифровки>, <ВозможностьИспользованияВнешнихФункций>) 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,НаборыВнешнихДанных , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры	

//+++АСТБ_Горюшин_Алексей_54520
Процедура ДобавлениеУточненныхОснованийНорм(ТаблицаНорм)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНорм.Организация КАК Организация,
	|	ТаблицаНорм.Сотрудник КАК Сотрудник,
	|	ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаНорм.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаНорм.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ТаблицаНорм.ДатаПотребности КАК ДатаПотребности,
	|	ТаблицаНорм.Подразделение КАК Подразделение,
	|	ТаблицаНорм.Должность КАК Должность,
	|	ТаблицаНорм.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаНорм.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаНорм.Рост КАК Рост,
	|	ТаблицаНорм.Номенклатура КАК Номенклатура,
	|	ТаблицаНорм.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ТаблицаНорм.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ТаблицаНорм.ВидАнтропометрииНоменклатуры КАК ВидАнтропометрииНоменклатуры,
	|	ТаблицаНорм.ЗначениеАнтропометрииНоменклатуры КАК ЗначениеАнтропометрииНоменклатуры,
	|	ТаблицаНорм.Количество КАК Количество,
	|	ТаблицаНорм.Цена КАК Цена,
	|	ТаблицаНорм.Сумма КАК Сумма,
	|	ТаблицаНорм.НачалоИнтервала КАК НачалоИнтервала,
	|	ТаблицаНорм.ПредставлениеИнтервала КАК ПредставлениеИнтервала,
	|	ТаблицаНорм.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ТаблицаНорм.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ТаблицаНорм.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаНорм.МВЗ КАК МВЗ,
	|	ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	|	ТаблицаНорм.КоличествоНаСкладе КАК КоличествоНаСкладе
	|ПОМЕСТИТЬ ВТ_ТаблицаНорм_Предварительная
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы КАК ОсновноеМестоРаботы,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНорм_Предварительная.Организация КАК Организация,
	|	ВТ_ТаблицаНорм_Предварительная.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаНорм_Предварительная.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаНорм_Предварительная.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаНорм_Предварительная.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_ТаблицаНорм_Предварительная.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаНорм_Предварительная.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаНорм_Предварительная.Должность КАК Должность,
	|	ВТ_ОсновноеМестоРаботы.РабочееМесто КАК РабочееМесто,
	|	ВТ_ТаблицаНорм_Предварительная.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_ТаблицаНорм_Предварительная.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_ТаблицаНорм_Предварительная.Рост КАК Рост,
	|	ВТ_ТаблицаНорм_Предварительная.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаНорм_Предварительная.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_ТаблицаНорм_Предварительная.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_ТаблицаНорм_Предварительная.ВидАнтропометрииНоменклатуры КАК ВидАнтропометрииНоменклатуры,
	|	ВТ_ТаблицаНорм_Предварительная.ЗначениеАнтропометрииНоменклатуры КАК ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_ТаблицаНорм_Предварительная.Количество КАК Количество,
	|	ВТ_ТаблицаНорм_Предварительная.Цена КАК Цена,
	|	ВТ_ТаблицаНорм_Предварительная.Сумма КАК Сумма,
	|	ВТ_ТаблицаНорм_Предварительная.НачалоИнтервала КАК НачалоИнтервала,
	|	ВТ_ТаблицаНорм_Предварительная.ПредставлениеИнтервала КАК ПредставлениеИнтервала,
	|	ВТ_ТаблицаНорм_Предварительная.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ВТ_ТаблицаНорм_Предварительная.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ВТ_ТаблицаНорм_Предварительная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаНорм_Предварительная.МВЗ КАК МВЗ,
	|	ВТ_ТаблицаНорм_Предварительная.УсловиеНормы КАК УсловиеНормы,
	|	ВТ_ТаблицаНорм_Предварительная.КоличествоНаСкладе КАК КоличествоНаСкладе
	|ПОМЕСТИТЬ ВТ_ТаблицаНорм
	|ИЗ
	|	ВТ_ТаблицаНорм_Предварительная КАК ВТ_ТаблицаНорм_Предварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_ТаблицаНорм_Предварительная.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|			И ВТ_ТаблицаНорм_Предварительная.Организация = ВТ_ОсновноеМестоРаботы.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	НЕ УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	НЕ УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	НЕ УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	НЕ УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УточненныеОснованияНормВыдачи.Организация КАК Организация,
	|	УточненныеОснованияНормВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	УточненныеОснованияНормВыдачи.Подразделение КАК Подразделение,
	|	УточненныеОснованияНормВыдачи.Должность КАК Должность,
	|	УточненныеОснованияНормВыдачи.РабочееМесто КАК РабочееМесто,
	|	УточненныеОснованияНормВыдачи.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|ИЗ
	|	РегистрСведений.УточненныеОснованияНормВыдачи КАК УточненныеОснованияНормВыдачи
	|ГДЕ
	|	УточненныеОснованияНормВыдачи.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|	И УточненныеОснованияНормВыдачи.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НормаВыдачи,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНорм.Организация КАК Организация,
	|	ВТ_ТаблицаНорм.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаНорм.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаНорм.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаНорм.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ,
	|	ВТ_ТаблицаНорм.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаНорм.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаНорм.Должность КАК Должность,
	|	ВТ_ТаблицаНорм.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ВТ_ТаблицаНорм.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ВТ_ТаблицаНорм.Рост КАК Рост,
	|	ВТ_ТаблицаНорм.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаНорм.ПериодичностьВыдачиТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	ВТ_ТаблицаНорм.ПериодичностьВыдачиКоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов,
	|	ВТ_ТаблицаНорм.ВидАнтропометрииНоменклатуры КАК ВидАнтропометрииНоменклатуры,
	|	ВТ_ТаблицаНорм.ЗначениеАнтропометрииНоменклатуры КАК ЗначениеАнтропометрииНоменклатуры,
	|	ВТ_ТаблицаНорм.Количество КАК Количество,
	|	ВТ_ТаблицаНорм.Цена КАК Цена,
	|	ВТ_ТаблицаНорм.Сумма КАК Сумма,
	|	ВТ_ТаблицаНорм.НачалоИнтервала КАК НачалоИнтервала,
	|	ВТ_ТаблицаНорм.ПредставлениеИнтервала КАК ПредставлениеИнтервала,
	|	ВТ_ТаблицаНорм.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ВТ_ТаблицаНорм.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ВТ_ТаблицаНорм.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаНорм.МВЗ КАК МВЗ,
	|	ВТ_ТаблицаНорм.УсловиеНормы КАК УсловиеНормы,
	|	ВТ_ТаблицаНорм.КоличествоНаСкладе КАК КоличествоНаСкладе,
	|	ВЫБОР
	|		КОГДА ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто.Основание ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто.Основание ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|															ТОГДА ВЫБОР
	|																	КОГДА ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																		ТОГДА ВЫБОР
	|																				КОГДА ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание ЕСТЬ NULL
	|																					ТОГДА """"
	|																				ИНАЧЕ ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|																			КОНЕЦ
	|																	ИНАЧЕ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Основание
	|																КОНЕЦ
	|														ИНАЧЕ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Основание
	|													КОНЕЦ
	|											ИНАЧЕ ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Основание
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто.Основание
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто.Основание
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.Основание
	|	КОНЕЦ КАК Основание
	|ИЗ
	|	ВТ_ТаблицаНорм КАК ВТ_ТаблицаНорм
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто КАК ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто
	|		ПО ВТ_ТаблицаНорм.Подразделение = ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.Подразделение
	|			И ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Должность = ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.Должность
	|			И ВТ_ТаблицаНорм.РабочееМесто = ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.РабочееМесто
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_Подразделение_Должность_РабочееМесто.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто КАК ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто
	|		ПО ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Должность = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто.Должность
	|			И ВТ_ТаблицаНорм.РабочееМесто = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто.РабочееМесто
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_РабочееМесто.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто КАК ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто
	|		ПО ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Подразделение = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто.Подразделение
	|			И ВТ_ТаблицаНорм.РабочееМесто = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто.РабочееМесто
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_РабочееМесто.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.Подразделение = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Должность = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Должность
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_Подразделение_Должность_ПустоеРабочееМесто.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Должность = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Должность
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_ПустоеПодразделение_Должность_ПустоеРабочееМесто.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Подразделение = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Подразделение
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_Подразделение_ПустаяДолжность_ПустоеРабочееМесто.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто КАК ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто
	|		ПО ВТ_ТаблицаНорм.НормаВыдачи = ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.НормаВыдачи
	|			И ВТ_ТаблицаНорм.Организация = ВТ_УОНВ_Организация_ПустоеПодразделение_ПустаяДолжность_ПустоеРабочееМесто.Организация";
	
	Запрос.УстановитьПараметр("ТаблицаНорм", ТаблицаНорм);
	
	ТаблицаНорм = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_54520

//+++АСТБ_Горюшин_Алексей_65854
// Добавлен вывод даты потребности во все варианты отчёта
//---АСТБ_Горюшин_Алексей_65854