
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Сотрудник_Подразделение_Должность <> Неопределено Тогда
		
		Если ТипЗнч(Параметры.Сотрудник_Подразделение_Должность) = Тип("СправочникСсылка.Сотрудники") Тогда
		
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Сотрудник",Параметры.Сотрудник_Подразделение_Должность,Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Подразделение",Справочники.Подразделения.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Должность",Справочники.ДолжностиИПрофессии.ПустаяСсылка(),Истина);
			
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по сотруднику (занятые рабочие места)";
			
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаСотрудник.Видимость = Ложь;
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаСотрудникТабельныйНомер.Видимость = Ложь;
			
		ИначеЕсли ТипЗнч(Параметры.Сотрудник_Подразделение_Должность) = Тип("СправочникСсылка.Подразделения") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Сотрудник",Справочники.Сотрудники.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Подразделение",Параметры.Сотрудник_Подразделение_Должность,Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Должность",Справочники.ДолжностиИПрофессии.ПустаяСсылка(),Истина);
			
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по подразделению (занятые рабочие места)";
			
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаПодразделение.Видимость = Ложь;
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаПодразделениеКодСинхронизации.Видимость = Ложь;
			
		ИначеЕсли ТипЗнч(Параметры.Сотрудник_Подразделение_Должность) = Тип("СправочникСсылка.ДолжностиИПрофессии") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Сотрудник",Справочники.Сотрудники.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Подразделение",Справочники.Подразделения.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Должность",Параметры.Сотрудник_Подразделение_Должность,Истина);
			
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по должности (занятые рабочие места)";	
			
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаДолжность.Видимость = Ложь;
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаДолжностьКод.Видимость = Ложь;
			
		Иначе
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры