
&НаКлиенте
Процедура ИерархияПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока = Неопределено Тогда
		ТекущаяИерархия = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель", ТекущаяИерархия,ВидСравненияКомпоновкиДанных.Равно, "Родитель", Истина);
	Иначе
		Если ЗначениеЗаполнено(ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока) Тогда
			ТекущаяИерархия = ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель", ТекущаяИерархия,ВидСравненияКомпоновкиДанных.Равно, "Родитель", Истина);
		Иначе
			ТекущаяИерархия = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель", ТекущаяИерархия,ВидСравненияКомпоновкиДанных.Равно, "Родитель", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ТекущаяИерархия = ТекущаяИерархия; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьНастройкиФормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Справочник_НоменклатураВыдачи_ФормаВыбора","ФормаВыбора" , Новый Структура("ТекущаяИерархия",ЭтаФорма.ТекущаяИерархия));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Справочник_НоменклатураВыдачи_ФормаВыбора","ФормаВыбора");
	
	Если Настройки <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Настройки.ТекущаяИерархия) Тогда
			
			Если Не (Настройки.ТекущаяИерархия.ПолучитьОбъект() = Неопределено) Тогда
				ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока = Настройки.ТекущаяИерархия;
				ЭтаФорма.ТекущаяИерархия = Настройки.ТекущаяИерархия;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	//отбор при заполнении комплектующих
	Если ЗначениеЗаполнено(Параметры.СписокНоменклатуры) Тогда
		Если Параметры.ПодлежитУтилизации Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНоменклатуры,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНоменклатуры,ВидСравненияКомпоновкиДанных.НеВСписке, "Ссылка", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Комплект", Ложь,ВидСравненияКомпоновкиДанных.Равно, "Комплект", Истина);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНоменклатуры,ВидСравненияКомпоновкиДанных.НеВСписке, "Ссылка", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Комплект", Ложь,ВидСравненияКомпоновкиДанных.Равно, "Комплект", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	
	
КонецПроцедуры

