
&НаСервере
Процедура ВыгрузитьНаСервере(ДатаОстатков, Поставщики)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура.КодСинхронизации КАК КодОра,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры.Код КАК ХарактеристикаКод,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиНоменклатурыОстатки.Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ДатаОстатков, ) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.Номенклатура.КодСинхронизации <> 0
		|	И ВЫБОР
		|			КОГДА &Кол > 0
		|				ТОГДА ОстаткиНоменклатурыОстатки.Номенклатура.Поставщик В (&Поставщики)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КолСкладов > 0
		|				ТОГДА ОстаткиНоменклатурыОстатки.Склад В (&Склады)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодОра";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Поставщики", Поставщики);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Кол", Поставщики.Количество());
	Запрос.УстановитьПараметр("КолСкладов", Склады.Количество());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Остатки.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Остатки.Очистить();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Объект.Путь);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("root");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
		ЗаписьXML.ЗаписатьТекст(Строка(Объект.ДатаОстатков));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ВыгрузитьНаСервере(Объект.ДатаОстатков, Поставщики);
	Для Каждого Стр из Остатки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("tovar");
		ЗаписьXML.ЗаписатьАтрибут("ORA", Стр.КодОра);
		ЗаписьXML.ЗаписатьАтрибут("Name", Стр.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("Size", Стр.ХарактеристикаКод);
		ЗаписьXML.ЗаписатьАтрибут("Kol", Строка(Стр.Количество));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогСохраненияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Файлы XML'") + "(*.xml)|*.xml|";
	ДиалогСохраненияФайла.Фильтр = Фильтр;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;


	Если ДиалогСохраненияФайла.Выбрать() Тогда  
		 Объект.Путь = ДиалогСохраненияФайла.ПолноеИмяФайла;	
	КонецЕсли;
КонецПроцедуры
