
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СписокФККО) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокФККО,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокФККО,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Ложь);
	КонецЕсли;
	
КонецПроцедуры
