#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Дата КАК Период,
	|	ВыдачаПоПотребностиОстатки.Организация КАК Организация,
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	ЗачетВыданныхСредствЗащитыТовары.Количество КАК КоличествоОстаток,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НормаВыдачи КАК НоваяНормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НоменклатураНормы КАК НоваяНоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности_Приход
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|				&ПериодРасчета,
	|				Организация = &Организация
	|					И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|		ПО ЗачетВыданныхСредствЗащитыТовары.Сотрудник = ВыдачаПоПотребностиОстатки.Сотрудник
	|			И ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи = ВыдачаПоПотребностиОстатки.НормаВыдачи
	|			И ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы = ВыдачаПоПотребностиОстатки.НоменклатураНормы
	|			И ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи = ВыдачаПоПотребностиОстатки.ДатаВыдачи
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|	И НЕ ВыдачаПоПотребностиОстатки.КоличествоОстаток ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Дата КАК Период,
	|	ВыдачаПоПотребностиОстатки.Организация КАК Организация,
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	ЗачетВыданныхСредствЗащитыТовары.Количество КАК КоличествоОстаток,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НормаВыдачи КАК НоваяНормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НоменклатураНормы КАК НоваяНоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности_Расход
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|				&ПериодРасчета,
	|				Организация = &Организация
	|					И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|		ПО ЗачетВыданныхСредствЗащитыТовары.Сотрудник = ВыдачаПоПотребностиОстатки.Сотрудник
	|			И ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы = ВыдачаПоПотребностиОстатки.НоменклатураНормы
	|			И ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи = ВыдачаПоПотребностиОстатки.ДатаВыдачи
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|	И НЕ ВыдачаПоПотребностиОстатки.КоличествоОстаток ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Дата КАК Период,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Организация КАК Организация,
	|	ЗачетВыданныхСредствЗащитыТовары.Сотрудник КАК Сотрудник,
	|	ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи КАК НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ЗачетВыданныхСредствЗащитыТовары.Номенклатура КАК Номенклатура,
	|	ЗачетВыданныхСредствЗащитыТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Количество КАК Количество,
	|	ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса КАК ПроцентИзноса
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Дата,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Организация,
	|	ЗачетВыданныхСредствЗащитыТовары.Сотрудник,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НоменклатураНормы,
	|	ЗачетВыданныхСредствЗащитыТовары.Номенклатура,
	|	ЗачетВыданныхСредствЗащитыТовары.ХарактеристикаНоменклатуры,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Количество,
	|	ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ВыдачаПоПотребности.Период КАК Период,
	|	ВТ_ВыдачаПоПотребности.Организация КАК Организация,
	|	ВТ_ВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ВыдачаПоПотребности.КоличествоОстаток КАК Количество
	|ИЗ
	|	ВТ_ВыдачаПоПотребности_Расход КАК ВТ_ВыдачаПоПотребности
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи,
	|	ДатаПотребности,
	|	Количество УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.Организация КАК Организация,
	|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	ВыдачаПоПотребностиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|ГДЕ
	|	НЕ ВыдачаПоПотребностиОстатки.КоличествоОстаток ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Организация КАК Организация,
	|	ЗачетВыданныхСредствЗащитыТовары.Сотрудник КАК Сотрудник,
	|	ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи КАК НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ЗачетВыданныхСредствЗащитыТовары.Количество) КАК КоличествоОстаток
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Организация,
	|	ЗачетВыданныхСредствЗащитыТовары.Сотрудник,
	|	ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетВыданныхСредствЗащиты.НормаВыдачи КАК НормаВыдачи,
	|	ЗачетВыданныхСредствЗащиты.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_НоваяНорма
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты КАК ЗачетВыданныхСредствЗащиты
	|ГДЕ
	|	ЗачетВыданныхСредствЗащиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	ВТ_НоваяНорма КАК ВТ_НоваяНорма
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВТ_НоваяНорма.НормаВыдачи)
	|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВТ_НоваяНорма.НоменклатураНормы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_ВыдачаПоПотребности.Период КАК Период,
	|	ВТ_ВыдачаПоПотребности.Организация КАК Организация,
	|	ВТ_ВыдачаПоПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаПоПотребности.НоваяНормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоваяНоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаПоПотребности.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВТ_ВыдачаПоПотребности.ДатаСледующейВыдачи
	|		ИНАЧЕ ВТ_ВыдачаПоПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ВыдачаПоПотребности.КоличествоОстаток КАК Количество,
	|	ВТ_ВыдачаПоПотребности.НормаВыдачи КАК СтараяНормаВыдачи,
	|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК СтараяНоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК СтараяДатаПотребности
	|ИЗ
	|	ВТ_ВыдачаПоПотребности_Приход КАК ВТ_ВыдачаПоПотребности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Дата,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Организация,
	|	ЗачетВыданныхСредствЗащитыТовары.Сотрудник,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Периодичность.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов * 12)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Периодичность.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов * 12 * ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса.Код / 100)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов * ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса.Код / 100)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи,
	|	0,
	|	ЗачетВыданныхСредствЗащитыТовары.Количество,
	|	ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|				&ПериодРасчета,
	|				Организация = &Организация
	|					И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|		ПО ЗачетВыданныхСредствЗащитыТовары.Сотрудник = ВыдачаПоПотребностиОстатки.Сотрудник
	|			И ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи = ВыдачаПоПотребностиОстатки.НормаВыдачи
	|			И ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы = ВыдачаПоПотребностиОстатки.НоменклатураНормы
	|			И ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи = ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВТ_Периодичность КАК ВТ_Периодичность
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|	И ВыдачаПоПотребностиОстатки.КоличествоОстаток ЕСТЬ NULL
	|	И ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Дата,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.Организация,
	|	ЗачетВыданныхСредствЗащитыТовары.Сотрудник,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Периодичность.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|						ТОГДА ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов * 12)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Периодичность.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов * 12 * ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса.Код / 100)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи, МЕСЯЦ, ВТ_Периодичность.ПериодичностьВыдачиКоличествоПериодов * ЗачетВыданныхСредствЗащитыТовары.ПроцентИзноса.Код / 100)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи,
	|	0,
	|	ЗачетВыданныхСредствЗащитыТовары.Количество,
	|	ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи,
	|	ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|ИЗ
	|	Документ.ЗачетВыданныхСредствЗащиты.Товары КАК ЗачетВыданныхСредствЗащитыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|				&ПериодРасчета,
	|				Организация = &Организация
	|					И Сотрудник В (&МассивСотрудников)) КАК ВыдачаПоПотребностиОстатки
	|		ПО ЗачетВыданныхСредствЗащитыТовары.Сотрудник = ВыдачаПоПотребностиОстатки.Сотрудник
	|			И ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи = ВыдачаПоПотребностиОстатки.НормаВыдачи
	|			И ЗачетВыданныхСредствЗащитыТовары.НоменклатураНормы = ВыдачаПоПотребностиОстатки.НоменклатураНормы
	|			И ЗачетВыданныхСредствЗащитыТовары.ДатаВыдачи = ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВТ_Периодичность КАК ВТ_Периодичность
	|ГДЕ
	|	ЗачетВыданныхСредствЗащитыТовары.Ссылка = &Ссылка
	|	И ВыдачаПоПотребностиОстатки.КоличествоОстаток ЕСТЬ NULL
	|	И НЕ ЗачетВыданныхСредствЗащитыТовары.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи УБЫВ,
	|	Количество УБЫВ";
	//было
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ВТ_ВыдачаПоПотребности.Период,
	//|	ВТ_ВыдачаПоПотребности.Организация,
	//|	ВТ_ВыдачаПоПотребности.Сотрудник,
	//|	ВТ_ВыдачаПоПотребности.НоваяНормаВыдачи,
	//|	ВТ_ВыдачаПоПотребности.НоваяНоменклатураНормы,
	//|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	//|	ВТ_ВыдачаПоПотребности.ДатаВыдачи,
	//|	ВТ_ВыдачаПоПотребности.ПроцентИзноса,
	//|	ВТ_ВыдачаПоПотребности.КоличествоОстаток
	//|ИЗ
	//|	ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности";
	//---АСТБ_Горюшин_Алексей_19737
	
	Запрос.УстановитьПараметр("Ссылка", 			ДокументСсылка);
	Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
	Запрос.УстановитьПараметр("Организация",		ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	ДокументСсылка.Товары.ВыгрузитьКолонку("Сотрудник"));
	
	Результат = Запрос.ВыполнитьПакет();
	
	//+++АСТБ_Горюшин_Алексей_19737
	ТаблицаВыдачаПоПотребностиРасход			= Результат[3].Выгрузить(); // таблица Расход для обработки
	ТаблицаВыдачаПоПотребностиОстатки			= Результат[4].Выгрузить(); // таблица Остатков ВПП для Расхода
	ТаблицаВыдачаПоПотребностиОстатки_Приход	= Результат[5].Выгрузить(); // таблица Остатков ВПП для Прихода
	ТаблицаВыдачаПоПотребностиПриход 			= Результат[8].Выгрузить(); // таблица Приход для обработки
	
	ТаблицаВыдачаПоПотребности = ТаблицаВыдачаПоПотребностиРасход.СкопироватьКолонки(); // итоговая таблица
	
	//цикл по сотрудникам
	ТЗ_Сотрудники = ДокументСсылка.Товары.Выгрузить();
	ТЗ_Сотрудники.Свернуть("Сотрудник");
	
	Для Каждого СтрокаТЗ_Сотрудники ИЗ ТЗ_Сотрудники Цикл
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Сотрудник", СтрокаТЗ_Сотрудники.Сотрудник);
		
		//Расход
		// Так как таблицы ВыдачаПоПотребностиОстатки и ЗачетВыданныхСредствЗащитыТовары
		// соединяются по неуникальным полям, необходим контроль остатков при добавлении
		// Расхода ВПП
		Строки_Расход = ТаблицаВыдачаПоПотребностиРасход.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Строка_Расход ИЗ Строки_Расход Цикл
			
			ПараметрыОтбора_Отстатки = Новый Структура();
			ПараметрыОтбора_Отстатки.Вставить("Организация",		Строка_Расход.Организация);
			ПараметрыОтбора_Отстатки.Вставить("Сотрудник",			Строка_Расход.Сотрудник);
			ПараметрыОтбора_Отстатки.Вставить("НоменклатураНормы",	Строка_Расход.НоменклатураНормы);
			ПараметрыОтбора_Отстатки.Вставить("ДатаВыдачи",			Строка_Расход.ДатаВыдачи);
			ПараметрыОтбора_Отстатки.Вставить("ДатаПотребности",	Строка_Расход.ДатаПотребности);
			ПараметрыОтбора_Отстатки.Вставить("НормаВыдачи",		Строка_Расход.НормаВыдачи);
			ПараметрыОтбора_Отстатки.Вставить("ПроцентИзноса",		Строка_Расход.ПроцентИзноса);
			
			СтрокиОстатков = ТаблицаВыдачаПоПотребностиОстатки.НайтиСтроки(ПараметрыОтбора_Отстатки);
			
			Если СтрокиОстатков[0].КоличествоОстаток = 0 Тогда
				// нет остатка, не добавляем строку
			ИначеЕсли СтрокиОстатков[0].КоличествоОстаток >= Строка_Расход.Количество Тогда
				
				НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка_Расход);
				СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
				
			ИначеЕсли СтрокиОстатков[0].КоличествоОстаток < Строка_Расход.Количество Тогда	
				
				НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка_Расход);
				НоваяСтрока.Количество = Строка_Расход.Количество - СтрокиОстатков[0].КоличествоОстаток;
				СтрокиОстатков[0].КоличествоОстаток = 0;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		//Приход
		// Тоже, что с Расходом
		КоличествоПоНовойНорме = ДокументСсылка.НормаВыдачи.СоставНормы[0].ПериодичностьВыдачи.КоличествоВпериоде;
		СтрокиТЗ = ТаблицаВыдачаПоПотребностиПриход.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Строка ИЗ СтрокиТЗ Цикл
			
			ПараметрыОтбора_Отстатки = Новый Структура();
			ПараметрыОтбора_Отстатки.Вставить("Организация",		Строка.Организация);
			ПараметрыОтбора_Отстатки.Вставить("Сотрудник",			Строка.Сотрудник);
			ПараметрыОтбора_Отстатки.Вставить("НоменклатураНормы",	Строка.СтараяНоменклатураНормы);
			ПараметрыОтбора_Отстатки.Вставить("ДатаВыдачи",			Строка.ДатаВыдачи);
			ПараметрыОтбора_Отстатки.Вставить("НормаВыдачи",		Строка.СтараяНормаВыдачи);
			
			СтрокиОстатков = ТаблицаВыдачаПоПотребностиОстатки_Приход.НайтиСтроки(ПараметрыОтбора_Отстатки);
			
			Если СтрокиОстатков.Количество() > 0 Тогда
				
				Если СтрокиОстатков[0].КоличествоОстаток = 0 Тогда
					// нет остатка, не добавляем строку
				ИначеЕсли СтрокиОстатков[0].КоличествоОстаток >= Строка.Количество Тогда	
					
					Если КоличествоПоНовойНорме = 0 Тогда
						
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.ДатаПотребности = Дата(1,1,1);
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
					ИначеЕсли КоличествоПоНовойНорме >= Строка.Количество Тогда
						
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						КоличествоПоНовойНорме = КоличествоПоНовойНорме - НоваяСтрока.Количество;
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
					ИначеЕсли КоличествоПоНовойНорме < Строка.Количество Тогда
						
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Количество = КоличествоПоНовойНорме;
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Количество = Строка.Количество - КоличествоПоНовойНорме;
						НоваяСтрока.ДатаПотребности = Дата(1,1,1);
						КоличествоПоНовойНорме = 0;
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
					КонецЕсли;
					
					СтрокиОстатков[0].КоличествоОстаток = Макс(СтрокиОстатков[0].КоличествоОстаток,0);
					
				ИначеЕсли СтрокиОстатков[0].КоличествоОстаток < Строка.Количество Тогда	
					
					Если КоличествоПоНовойНорме = 0 Тогда
						
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.ДатаПотребности = Дата(1,1,1);
						НоваяСтрока.Количество = Мин(НоваяСтрока.Количество,СтрокиОстатков[0].КоличествоОстаток);
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
					ИначеЕсли КоличествоПоНовойНорме >= Строка.Количество Тогда
						
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						КоличествоПоНовойНорме = КоличествоПоНовойНорме - НоваяСтрока.Количество;
						НоваяСтрока.Количество = Мин(НоваяСтрока.Количество,СтрокиОстатков[0].КоличествоОстаток);
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
					ИначеЕсли КоличествоПоНовойНорме < Строка.Количество Тогда
						
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Количество = КоличествоПоНовойНорме;
						НоваяСтрока.Количество = Мин(НоваяСтрока.Количество,СтрокиОстатков[0].КоличествоОстаток);
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
						НоваяСтрока = ТаблицаВыдачаПоПотребности.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Количество = Строка.Количество - КоличествоПоНовойНорме;
						НоваяСтрока.Количество = Мин(НоваяСтрока.Количество,СтрокиОстатков[0].КоличествоОстаток);
						НоваяСтрока.ДатаПотребности = Дата(1,1,1);
						КоличествоПоНовойНорме = 0;
						СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - НоваяСтрока.Количество;
					
					КонецЕсли;
					
					СтрокиОстатков[0].КоличествоОстаток = Макс(СтрокиОстатков[0].КоличествоОстаток,0);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	//---АСТБ_Горюшин_Алексей_19737
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	ТаблицыДляДвижений.Вставить("ТаблицаВыданныеСредстваЗащиты", 	Результат[2].Выгрузить());
	//+++АСТБ_Горюшин_Алексей_19737
	ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", 		ТаблицаВыдачаПоПотребности);
	//было
	//ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", 		Результат[2].Выгрузить());
	//---АСТБ_Горюшин_Алексей_19737
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьНаВыдачуСИЗ") Тогда

	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм, 
	//		"ВедомостьНаВыдачуСИЗ",
	//		"Ведомость на выдачу СИЗ",
	//		СформироватьПечатнуюФормуВедомостиНаВыдачуСИЗ(МассивОбъектов, ОбъектыПечати),,"Документ.ВыдачаСредствЗащитыПоВедомости.ПФ_MXL_ВедомостьНаВыдачуСИЗ");
	//			
	//КонецЕсли;
	
КонецПроцедуры

//Функция СформироватьПечатнуюФормуВедомостиНаВыдачуСИЗ(МассивОбъектов, ОбъектыПечати)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.АвтоМасштаб = Истина;
//	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСредствЗащитыПоВедомости_ВедомостьНаВыдачуСИЗ";
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Документы.Ссылка КАК Ссылка,
//	|	Документы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
//	|	Документы.Номер КАК Номер,
//	|	Документы.Дата КАК Дата,
//	|	Документы.Организация.Префикс КАК Префикс,
//	|	Документы.Дата КАК ПериодВыдачи
//	|ИЗ
//	|	Документ.ВыдачаСредствЗащитыПоВедомости КАК Документы
//	|ГДЕ
//	|	Документы.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Ссылка КАК Ссылка,
//	|	Товары.Количество КАК Количество,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	|	Товары.Сотрудник КАК Сотрудник,
//	|	Товары.НоменклатураНормы.Наименование КАК НоменклатураНормы
//	|ИЗ
//	|	Документ.ВыдачаСредствЗащитыПоВедомости.Товары КАК Товары
//	|ГДЕ
//	|	Товары.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	Товары.Сотрудник.Наименование,
//	|	Товары.НоменклатураНормы.Наименование,
//	|	Товары.Номенклатура.Наименование,
//	|	Товары.ХарактеристикаНоменклатуры.КодSAP
//	|ИТОГИ ПО
//	|	Ссылка");
//	
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСредствЗащитыПоВедомости.ПФ_MXL_ВедомостьНаВыдачуСИЗ");
//	
//	ПакетЗапросов = Запрос.ВыполнитьПакет();
//	ДанныеПечати = ПакетЗапросов[0].Выбрать();
//	ВыборкаПоДокументам = ПакетЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	ПервыйДокумент = Истина;
//	
//	Пока ДанныеПечати.Следующий() Цикл
//		
//		Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		Если Не ПервыйДокумент Тогда
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		
//		ПервыйДокумент = Ложь;
//			
//		Область = Макет.ПолучитьОбласть("Шапка");
//		Область.Параметры.Заполнить(ДанныеПечати);
//		
//		ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Ведомость на выдачу СИЗ");
//		Область.Параметры.ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + ?(ЗначениеЗаполнено(ДанныеПечати.ПериодВыдачи)," Период выдачи: " + Формат(ДанныеПечати.ПериодВыдачи,"ДФ='ММММ гггг'"),"");
//		ТабличныйДокумент.Вывести(Область);
//			
//		СчетСтрок = 1;
//		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
//		Пока ВыборкаПоТоварам.Следующий() Цикл
//			
//			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
//			Область.Параметры.НомерСтроки = СчетСтрок;
//			Область.Параметры.ТабельныйНомер = СокрЛП(ВыборкаПоТоварам.Сотрудник.ТабельныйНомер);
//			Область.Параметры.ПредставлениеСотрудника = ФизическиеЛица.ФамилияИнициалыФизЛица(ВыборкаПоТоварам.Сотрудник.ФизическоеЛицо);
//			Область.Параметры.НоменклатураНормы = ВыборкаПоТоварам.НоменклатураНормы;
//			Область.Параметры.КодСинхронизации = ВыборкаПоТоварам.Номенклатура.КодСинхронизации;
//			Область.Параметры.НаименованиеТовара = ВыборкаПоТоварам.Номенклатура;
//			Область.Параметры.Размер = ВыборкаПоТоварам.ХарактеристикаНоменклатуры;
//			//Область.Параметры.НаименованиеТовара = ПроцедурыРаботыСНормамиСервер.ПолучитьПредставлениеНоменклатуры(ВыборкаПоТоварам.Номенклатура,ВыборкаПоТоварам.ХарактеристикаНоменклатуры);
//			Область.Параметры.Количество = ВыборкаПоТоварам.Количество;
//			ТабличныйДокумент.Вывести(Область);
//			
//			СчетСтрок = СчетСтрок + 1;
//			
//		КонецЦикла;
//		
//		Область = Макет.ПолучитьОбласть("Подвал");
//		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
//		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
//		Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
//		Область.Параметры.ПредставлениеОтветственного = ФизическиеЛица.ФамилияИнициалыФизЛица(Строка(ДанныеПечати.Ссылка.Ответственный));
//		ТабличныйДокумент.Вывести(Область);
//		
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
//		
//	КонецЦикла;
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//ведомость
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ВыдачаСредствЗащитыПоВедомости";
	//КомандаПечати.Идентификатор = "ВедомостьНаВыдачуСИЗ";
	//КомандаПечати.Представление = НСтр("ru = 'Ведомость на выдачу СИЗ'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;

КонецПроцедуры

//Процедура заполняет табличную часть документа-объекта в зависимости от вида заполнения
//Параметры:
//ТекущийОбъект - документ-объект, который заполняется
//ВидЗаполнения - может прнимать значения: "ПоМВЗ", "ПоСпискуСотрудников", "ПоСкладуВыдачи", "ПоНормамВыдачи" или "ПоНоменклатуреНормы".
//ЗначениеПараметраЗаполнения - значение, по которому заполняется документ-объект: структура
//
Процедура ЗаполнитьТаблицуДокумента(ТекущийОбъект,ВидЗаполнения,ЗначениеПараметраЗаполнения) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка);
	ТекущаяДата = ?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата());
	
	Если ВидЗаполнения = "ПоМВЗ" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
		|	МВЗПодразделенийСрезПоследних.МВЗ КАК МВЗ
		|ПОМЕСТИТЬ ВТ_ПодразделенияПоМВЗ
		|ИЗ
		|	РегистрСведений.МВЗПодразделений.СрезПоследних(&ПериодАнализа, МВЗ = &МВЗ) КАК МВЗПодразделенийСрезПоследних
		|ГДЕ
		|	МВЗПодразделенийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МВЗДолжностейСрезПоследних.Должность КАК Должность,
		|	МВЗДолжностейСрезПоследних.МВЗ КАК МВЗ
		|ПОМЕСТИТЬ ВТ_ДолжностиПоМВЗ
		|ИЗ
		|	РегистрСведений.МВЗДолжностей.СрезПоследних(&ПериодАнализа, МВЗ = &МВЗ) КАК МВЗДолжностейСрезПоследних
		|ГДЕ
		|	МВЗДолжностейСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МВЗСотрудников.Сотрудник КАК Сотрудник,
		|	МВЗСотрудников.МВЗ КАК МВЗ
		|ПОМЕСТИТЬ ВТ_МВЗСотрудников
		|ИЗ
		|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
		|ГДЕ
		|	МВЗСотрудников.МВЗ = &МВЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ПодразделенияПоМВЗ.МВЗ ЕСТЬ NULL
		|						ТОГДА ВТ_ДолжностиПоМВЗ.МВЗ
		|					ИНАЧЕ ВТ_ПодразделенияПоМВЗ.МВЗ
		|				КОНЕЦ
		|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
		|	КОНЕЦ КАК МВЗ
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодАнализа, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
		|		ПО ЗанятыеРабочиеМестаОстатки.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияПоМВЗ КАК ВТ_ПодразделенияПоМВЗ
		|		ПО ЗанятыеРабочиеМестаОстатки.Подразделение = ВТ_ПодразделенияПоМВЗ.Подразделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДолжностиПоМВЗ КАК ВТ_ДолжностиПоМВЗ
		|		ПО ЗанятыеРабочиеМестаОстатки.Должность = ВТ_ДолжностиПоМВЗ.Должность
		|ГДЕ
		|	ЕСТЬNULL(ВТ_МВЗСотрудников.МВЗ, ВТ_ПодразделенияПоМВЗ.МВЗ) = &МВЗ
		|	И (ЗанятыеРабочиеМестаОстатки.Подразделение = &Подразделение
		|			ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|	И (ЗанятыеРабочиеМестаОстатки.Должность = &Должность
		|			ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяССылка))
		|	И ВЫБОР
		|			КОГДА ЗанятыеРабочиеМестаОстатки.Организация.ИспользоватьРабочиеМеста
		|				ТОГДА ЗанятыеРабочиеМестаОстатки.РабочееМесто = &РабочееМесто
		|						ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(&ПериодАнализа, Организация = &Организация) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы)
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 <<<
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫБОР
		|						КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|							ТОГДА ВЫБОР
		|									КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|							КОНЕЦ
		|					КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|		КОНЕЦ
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 >>>
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МВЗ",					ЗначениеПараметраЗаполнения);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",			ТекущийОбъект.НормаВыдачи.ВидВыдачиСИЗ);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
	ИначеЕсли ВидЗаполнения = "ПоСкладуВыдачи" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СкладыВыдачиСредствЗащиты.Склад КАК Склад,
		|	СкладыВыдачиСредствЗащиты.Получатель КАК Получатель
		|ПОМЕСТИТЬ ВТ_СкладыВыдачи
		|ИЗ
		|	РегистрСведений.СкладыВыдачиСредствЗащиты КАК СкладыВыдачиСредствЗащиты
		|ГДЕ
		|	СкладыВыдачиСредствЗащиты.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
		|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И (Подразделение = &Подразделение
		|					ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|				И (Должность = &Должность
		|					ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА Организация.ИспользоватьРабочиеМеста
		|						ТОГДА РабочееМесто = &РабочееМесто
		|								ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ЗРМ.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ВТ_СкладыВыдачи.Склад ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_СкладыВыдачи1.Склад ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ВТ_СкладыВыдачи2.Склад ЕСТЬ NULL
		|									ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|								ИНАЧЕ ВТ_СкладыВыдачи2.Склад
		|							КОНЕЦ
		|					ИНАЧЕ ВТ_СкладыВыдачи1.Склад
		|				КОНЕЦ
		|		ИНАЧЕ ВТ_СкладыВыдачи.Склад
		|	КОНЕЦ КАК СкладВыдачи
		|ПОМЕСТИТЬ ВТ_СкладыВыдачиСотрудников
		|ИЗ
		|	ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыВыдачи КАК ВТ_СкладыВыдачи
		|		ПО ВТ_ЗРМ.Сотрудник = ВТ_СкладыВыдачи.Получатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыВыдачи КАК ВТ_СкладыВыдачи1
		|		ПО ВТ_ЗРМ.Подразделение = ВТ_СкладыВыдачи1.Получатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыВыдачи КАК ВТ_СкладыВыдачи2
		|		ПО (ВЫБОР
		|				КОГДА ВТ_СкладыВыдачи2.Получатель = НЕОПРЕДЕЛЕНО
		|						ИЛИ ВТ_СкладыВыдачи2.Получатель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|						ИЛИ ВТ_СкладыВыдачи2.Получатель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ_СкладыВыдачи.Склад ЕСТЬ NULL
		|				ТОГДА ВЫБОР
		|						КОГДА ВТ_СкладыВыдачи1.Склад ЕСТЬ NULL
		|							ТОГДА ВЫБОР
		|									КОГДА ВТ_СкладыВыдачи2.Склад ЕСТЬ NULL
		|										ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|									ИНАЧЕ ВТ_СкладыВыдачи2.Склад
		|								КОНЕЦ
		|						ИНАЧЕ ВТ_СкладыВыдачи1.Склад
		|					КОНЕЦ
		|			ИНАЧЕ ВТ_СкладыВыдачи.Склад
		|		КОНЕЦ = &СкладВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(&ПериодАнализа, Организация = &Организация) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыВыдачиСотрудников КАК ВТ_СкладыВыдачиСотрудников
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_СкладыВыдачиСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 <<<
		|	ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ
		|	НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|					ТОГДА ВЫБОР
		|							КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|								ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|							ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|					КОНЕЦ
		|			КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|					КОНЕЦ
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 >>>
		|	И НЕ ВТ_СкладыВыдачиСотрудников.Сотрудник ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("СкладВыдачи",			ЗначениеПараметраЗаполнения);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",			ТекущийОбъект.НормаВыдачи.ВидВыдачиСИЗ);
		
	ИначеЕсли ВидЗаполнения = "ПоСпискуСотрудников" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И Сотрудник В (&СписокСотрудников)) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И Сотрудник В (&СписокСотрудников)) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 <<<
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ
		|	НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|					ТОГДА ВЫБОР
		|							КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|								ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|							ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|					КОНЕЦ
		|			КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|					КОНЕЦ
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 >>>
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("СписокСотрудников",		ЗначениеПараметраЗаполнения);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",			ТекущийОбъект.НормаВыдачи.ВидВыдачиСИЗ);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
	ИначеЕсли ВидЗаполнения = "ПоНормамВыдачи" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И (Подразделение = &Подразделение
		|					ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|				И (Должность = &Должность
		|					ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА Организация.ИспользоватьРабочиеМеста
		|						ТОГДА РабочееМесто = &РабочееМесто
		|								ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи В (&МассивНормВыдачи)) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 <<<
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ
		|	НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|					ТОГДА ВЫБОР
		|							КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|								ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|							ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|					КОНЕЦ
		|			КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|					КОНЕЦ
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 >>>
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("МассивНормВыдачи",		ЗначениеПараметраЗаполнения);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",			ТекущийОбъект.НормаВыдачи.ВидВыдачиСИЗ);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
	ИначеЕсли ВидЗаполнения = "ПоНоменклатуреНормы" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И (Подразделение = &Подразделение
		|					ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|				И (Должность = &Должность
		|					ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА Организация.ИспользоватьРабочиеМеста
		|						ТОГДА РабочееМесто = &РабочееМесто
		|								ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И НоменклатураНормы В (&МассивНоменклатурыНормы)) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 <<<
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ
		|	НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|					ТОГДА ВЫБОР
		|							КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|								ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|							ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|					КОНЕЦ
		|			КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|					КОНЕЦ
		//Танцюра А.Н. -- №139497 BUG: Документ "Зачет выданных СИЗ" -- 01.11.2021 >>>
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("МассивНоменклатурыНормы",ЗначениеПараметраЗаполнения);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",			ТекущийОбъект.НормаВыдачи.ВидВыдачиСИЗ);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
		//Танцюра А.Н. -- №142504 Доработка документа "Зачет выданных СИЗ" -- 03.11.2021 <<<
		
	ИначеЕсли ВидЗаполнения = "Полностью" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И (Подразделение = &Подразделение
		|					ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|				И (Должность = &Должность
		|					ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА Организация.ИспользоватьРабочиеМеста
		|						ТОГДА РабочееМесто = &РабочееМесто
		|								ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(&ПериодАнализа, Организация = &Организация) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫБОР
		|						КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|							ТОГДА ВЫБОР
		|									КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|							КОНЕЦ
		|					КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
	ИначеЕсли ВидЗаполнения = "ПоНоменклатуреВыдачи" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И (Подразделение = &Подразделение
		|					ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|				И (Должность = &Должность
		|					ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА Организация.ИспользоватьРабочиеМеста
		|						ТОГДА РабочееМесто = &РабочееМесто
		|								ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И Номенклатура В (&МассивНоменклатуры)) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫБОР
		|						КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|							ТОГДА ВЫБОР
		|									КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|							КОНЕЦ
		|					КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("МассивНоменклатуры",		ЗначениеПараметраЗаполнения);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
	ИначеЕсли ВидЗаполнения = "ПоПроизвольнойВыдаче" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗРМ
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И (Подразделение = &Подразделение
		|					ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|				И (Должность = &Должность
		|					ИЛИ &Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА Организация.ИспользоватьРабочиеМеста
		|						ТОГДА РабочееМесто = &РабочееМесто
		|								ИЛИ &РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_Периодичность
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|ГДЕ
		|	НормыВыдачиСИЗСоставНормы.Ссылка = &НоваяНормаВыдачи
		|	И НормыВыдачиСИЗСоставНормы.НоменклатураНормы = &НоваяНоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		|		ПО ВыданныеСредстваЗащитыОстатки.Сотрудник = ВТ_ЗРМ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО (НормыВыдачиСИЗСоставНормы.Ссылка = ВыданныеСредстваЗащитыОстатки.НормаВыдачи)
		|			И (НормыВыдачиСИЗСоставНормы.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы),
		|	ВТ_Периодичность КАК ВТ_Периодичность
		|ГДЕ
		|	НЕ ВТ_ЗРМ.Сотрудник ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫБОР
		|						КОГДА ВыданныеСредстваЗащитыОстатки.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|							ТОГДА ВЫБОР
		|									КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12 * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * (100 - ВыданныеСредстваЗащитыОстатки.ПроцентИзноса.Код) / 100)
		|							КОНЕЦ
		|					КОНЕЦ, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи.Наименование,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ПериодАнализа",			ДатаАнализа);
		Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Подразделение",			ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("Должность",				ТекущийОбъект.Должность);
		Запрос.УстановитьПараметр("РабочееМесто",			ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата);
		Запрос.УстановитьПараметр("НоваяНормаВыдачи",		ТекущийОбъект.НормаВыдачи);
		Запрос.УстановитьПараметр("НоваяНоменклатураНормы",	ТекущийОбъект.НоменклатураНормы);
		
		//Танцюра А.Н. -- №142504 Доработка документа "Зачет выданных СИЗ" -- 03.11.2021 >>>
	
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецЕсли