#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроведениеСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,Отказ,"Товары");	
	
	//+++АСТБ_Горюшин_Алексей_20521
	ПроверитьУникальностьСтрокТЧ_Товары(ЭтотОбъект,Отказ,"Товары");
	//---АСТБ_Горюшин_Алексей_20521
	
КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_20521
Процедура ПроверитьУникальностьСтрокТЧ_Товары(Объект,Отказ,ИмяТабличнойЧасти)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(1) КАК КоличествоПовторов
	|ПОМЕСТИТЬ ВТ_Повторы
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Повторы.Номенклатура КАК Номенклатура,
	|	ВТ_Повторы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	ВТ_Повторы КАК ВТ_Повторы
	|ГДЕ
	|	ВТ_Повторы.КоличествоПовторов > 1";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры",Объект[ИмяТабличнойЧасти].Выгрузить(,"НомерСтроки,Номенклатура,ХарактеристикаНоменклатуры"));
	
	КлючДанных = ПроцедурыРаботыСНормамиСервер.КлючДанныхДляСообщенияПользователю(Объект);
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	ПредставлениеТЧ                      = МетаданныеОбъекта.ТабличныеЧасти[ИмяТабличнойЧасти].Синоним;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ШаблонСообщения = НСтр("ru='Повторение номенклатуры ""%Номенклатура%"" (%ХарактеристикаНоменклатуры%) в строках %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	
		ЗапросСтрок = Новый Запрос;
		ЗапросСтрок.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|ГДЕ
		|	ТаблицаНоменклатуры.Номенклатура = &Номенклатура
		|	И ТаблицаНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		ЗапросСтрок.УстановитьПараметр("ТаблицаНоменклатуры",Объект[ИмяТабличнойЧасти].Выгрузить(,"НомерСтроки,Номенклатура,ХарактеристикаНоменклатуры"));
		ЗапросСтрок.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
		ЗапросСтрок.УстановитьПараметр("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры); 
		
		ВыборкаСтрок = ЗапросСтрок.Выполнить().Выбрать();
		
		НомераСтрок = "";
		
		Пока ВыборкаСтрок.Следующий() Цикл
			
			НомераСтрок = НомераСтрок + ВыборкаСтрок.НомерСтроки + ", ";
			
		КонецЦикла;	
		
		Если НЕ НомераСтрок = "" Тогда
			
			НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
			
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%", Выборка.Номенклатура);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ХарактеристикаНоменклатуры%", Выборка.ХарактеристикаНоменклатуры);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", ПредставлениеТЧ);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомераСтрок);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, ВыборкаСтрок.НомерСтроки, "ХарактеристикаНоменклатуры");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,КлючДанных,Поле,"Объект",Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры//---АСТБ_Горюшин_Алексей_20521

#КонецЕсли