
// Возвращает прокси сервиса обмена данными.
//
// Возвращаемое значение:
// WSПрокси
//
Функция ПолучитьПрокси(ПараметрыПодключения) Экспорт	
	
	Пользователь = ПараметрыПодключения.ИмяПользователя;
	Пароль 		 = ПараметрыПодключения.Пароль;	
	Адрес 		 = ПараметрыПодключения.АдресWSDL;
	
	Определения = Новый WSОпределения(Адрес, Пользователь, Пароль,,15);
	Прокси = Новый WSПрокси(Определения, ПараметрыПодключения.URIПространстваИмен , ПараметрыПодключения.ИмяСервиса, ПараметрыПодключения.ИмяТочкиПодключения,,ПараметрыПодключения.Таймаут);
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	Возврат Прокси;
	
КонецФункции // ПолучитьПрокси()

