
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Параметры.Отбор.Организация));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Должность") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Должность", Параметры.Отбор.Должность));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("НормаВыдачи") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("НормаВыдачи", Параметры.Отбор.НормаВыдачи));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВключитьНаСервере(МассивВыделенныхСтрок)
	
	Для Каждого ВыделеннаяСтрока Из МассивВыделенныхСтрок Цикл
		
		ЦелевойНаборЗаписей = РегистрыСведений.ИсходныеНормыВыдачиСИЗ.СоздатьНаборЗаписей();
		ЦелевойНаборЗаписей.Отбор.Организация.Установить(ВыделеннаяСтрока.Организация);
		ЦелевойНаборЗаписей.Отбор.Подразделение.Установить(ВыделеннаяСтрока.Подразделение);
		ЦелевойНаборЗаписей.Отбор.Должность.Установить(ВыделеннаяСтрока.Должность);
		ЦелевойНаборЗаписей.Отбор.РабочееМесто.Установить(ВыделеннаяСтрока.РабочееМесто);
		ЦелевойНаборЗаписей.Отбор.УсловиеНормы.Установить(ВыделеннаяСтрока.УсловиеНормы);
		ЦелевойНаборЗаписей.Отбор.НормаВыдачи.Установить(ВыделеннаяСтрока.НормаВыдачи);
		ЦелевойНаборЗаписей.Прочитать();
		ЦелевойНаборЗаписей[0].Использовать = Истина;		
		ЦелевойНаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Включить(Команда)
	
	МассивВыделенныхСтрок = Элементы.Список.ВыделенныеСтроки;
	
	ВключитьНаСервере(МассивВыделенныхСтрок);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьНаСервере(МассивВыделенныхСтрок)
	
	Для Каждого ВыделеннаяСтрока Из МассивВыделенныхСтрок Цикл
		
		ЦелевойНаборЗаписей = РегистрыСведений.ИсходныеНормыВыдачиСИЗ.СоздатьНаборЗаписей();
		ЦелевойНаборЗаписей.Отбор.Организация.Установить(ВыделеннаяСтрока.Организация);
		ЦелевойНаборЗаписей.Отбор.Подразделение.Установить(ВыделеннаяСтрока.Подразделение);
		ЦелевойНаборЗаписей.Отбор.Должность.Установить(ВыделеннаяСтрока.Должность);
		ЦелевойНаборЗаписей.Отбор.РабочееМесто.Установить(ВыделеннаяСтрока.РабочееМесто);
		ЦелевойНаборЗаписей.Отбор.УсловиеНормы.Установить(ВыделеннаяСтрока.УсловиеНормы);
		ЦелевойНаборЗаписей.Отбор.НормаВыдачи.Установить(ВыделеннаяСтрока.НормаВыдачи);
		ЦелевойНаборЗаписей.Прочитать();
		ЦелевойНаборЗаписей[0].Использовать = Ложь;		
		ЦелевойНаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выключить(Команда)
	
	МассивВыделенныхСтрок = Элементы.Список.ВыделенныеСтроки;
	
	ВыключитьНаСервере(МассивВыделенныхСтрок);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
