
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник",ТекущийСотрудник);
	
	УстановитьОтборПоСотруднику();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСотруднику()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратИзЧисткиТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратИзЧистки.Товары КАК ВозвратИзЧисткиТовары
	|ГДЕ
	|	ВозвратИзЧисткиТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратСредствЗащитыОтСотрудника.Ссылка
	|ИЗ
	|	Документ.ВозвратСредствЗащитыОтСотрудника КАК ВозвратСредствЗащитыОтСотрудника
	|ГДЕ
	|	ВозвратСредствЗащитыОтСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаДежурныхСредствЗащиты.Ссылка
	|ИЗ
	|	Документ.ВыдачаДежурныхСредствЗащиты КАК ВыдачаДежурныхСредствЗащиты
	|ГДЕ
	|	ВыдачаДежурныхСредствЗащиты.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Ссылка
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыПоВедомости.Товары КАК ВыдачаСредствЗащитыПоВедомостиТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗ.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ КАК ЗаявкаНаПроизвольнуюВыдачуСИЗ
	|ГДЕ
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗ.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнструктажСотрудникаРаботники.Ссылка
	|ИЗ
	|	Документ.ИнструктажСотрудников.Работники КАК ИнструктажСотрудникаРаботники
	|ГДЕ
	|	ИнструктажСотрудникаРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровоеПеремещениеРаботники.Ссылка
	|ИЗ
	|	Документ.КадровоеПеремещение.Работники КАК КадровоеПеремещениеРаботники
	|ГДЕ
	|	КадровоеПеремещениеРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбменСредствЗащитыСотрудника.Ссылка
	|ИЗ
	|	Документ.ОбменСредствЗащитыСотрудника КАК ОбменСредствЗащитыСотрудника
	|ГДЕ
	|	ОбменСредствЗащитыСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтсутствиеНаРабочемМесте.Ссылка
	|ИЗ
	|	Документ.ОтсутствиеНаРабочемМесте КАК ОтсутствиеНаРабочемМесте
	|ГДЕ
	|	ОтсутствиеНаРабочемМесте.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаВЧисткуТовары.Ссылка
	|ИЗ
	|	Документ.ПередачаВЧистку.Товары КАК ПередачаВЧисткуТовары
	|ГДЕ
	|	ПередачаВЧисткуТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботуРаботники.Ссылка
	|ИЗ
	|	Документ.ПриемНаРаботу.Работники КАК ПриемНаРаботуРаботники
	|ГДЕ
	|	ПриемНаРаботуРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеСредствЗащитыСотрудника.Ссылка
	|ИЗ
	|	Документ.СписаниеСредствЗащитыСотрудника КАК СписаниеСредствЗащитыСотрудника
	|ГДЕ
	|	СписаниеСредствЗащитыСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УвольнениеРаботники.Ссылка
	|ИЗ
	|	Документ.Увольнение.Работники КАК УвольнениеРаботники
	|ГДЕ
	|	УвольнениеРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаСоответствийНоменклатурыВыдачиСоответствия.Ссылка
	|ИЗ
	|	Документ.УстановкаСоответствийНоменклатурыВыдачи.Соответствия КАК УстановкаСоответствийНоменклатурыВыдачиСоответствия
	|ГДЕ
	|	УстановкаСоответствийНоменклатурыВыдачиСоответствия.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаУсловийРаботыСотрудника.Ссылка
	|ИЗ
	|	Документ.УстановкаУсловийРаботыСотрудника КАК УстановкаУсловийРаботыСотрудника
	|ГДЕ
	|	УстановкаУсловийРаботыСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратСредствЗащитыСХранения.Ссылка
	|ИЗ
	|	Документ.ВозвратСредствЗащитыСХранения КАК ВозвратСредствЗащитыСХранения
	|ГДЕ
	|	ВозвратСредствЗащитыСХранения.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемСредствЗащитыНаХранение.Ссылка
	|ИЗ
	|	Документ.ПриемСредствЗащитыНаХранение КАК ПриемСредствЗащитыНаХранение
	|ГДЕ
	|	ПриемСредствЗащитыНаХранение.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеСредствЗащитыНаХранении.Ссылка
	|ИЗ
	|	Документ.ПеремещениеСредствЗащитыНаХранении КАК ПеремещениеСредствЗащитыНаХранении
	|ГДЕ
	|	ПеремещениеСредствЗащитыНаХранении.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаОсновногоМестаРаботыСотрудника.Ссылка
	|ИЗ
	|	Документ.УстановкаОсновногоМестаРаботыСотрудника КАК УстановкаОсновногоМестаРаботыСотрудника
	|ГДЕ
	|	УстановкаОсновногоМестаРаботыСотрудника.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник",ТекущийСотрудник);	
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
КонецПроцедуры