#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	СтруктураТаблицДвижений = ПроцедурыРаботыСНормамиСервер.ПолучитьСтруктуруТаблицДвиженийПоДокументуЗачетаУпрощеннойВыдачи(ДокументСсылка);
	
	//движения по регистру "Выданные средства защиты"
	ТаблицыДляДвижений.Вставить("ТаблицаВыданныеСредстваЗащиты",СтруктураТаблицДвижений.ТаблицаВыданныеСредстваЗащиты);
	
	//движения по регистру "ПотребностьВыдачиСИЗ"
	ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВыдачиСИЗ", 	СтруктураТаблицДвижений.ТаблицаПотребностьВыдачиСИЗ);
	
	//движения по регистру "ВыдачаПоПотребности"
	ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", 	СтруктураТаблицДвижений.ТаблицаВыдачаПоПотребности);
	
КонецПроцедуры	

//Процедура заполняет табличную часть документа-объекта в зависимости от вида заполнения
//Параметры:
//ТекущийОбъект - документ-объект, который заполняется
//ВидЗаполнения - может прнимать значения: "Полностью", "ПоСотрудникам", "ПоПодразделениям", "ПоДолжностям" или "ПоНоменклатуреНормы".
//ЗначениеПараметраЗаполнения - значение, по которому заполняется документ-объект типа 
//"Сотрудники", "Подразделения", "Должности" или "НоменнклатураНормОрганизации"
//
Процедура ЗаполнитьТаблицуДокумента(ТекущийОбъект, ВидЗаполнения, ЗначениеПараметраЗаполнения = Неопределено) Экспорт
	
	АлгоритмФормированияПотребности = ПроцедурыРаботыСНормамиСервер.ПолучитьАлгоритмФормированияПотребности(ТекущийОбъект.Организация);
	
	Если АлгоритмФормированияПотребности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Выполнить("Алгоритм_" + АлгоритмФормированияПотребности + "_Сервер.ЗачетУпрощеннойВыдачи_ЗаполнитьТаблицуДокумента(ТекущийОбъект, ВидЗаполнения, ЗначениеПараметраЗаполнения)");
	
КонецПроцедуры

#КонецЕсли