
&НаКлиенте
Процедура НачальноеЗаполнение(Команда)	
	ОткрытьФорму("Обработка.АХ_НачальнальноеЗаполнение.Форма.ФормаНачальногоЗаполнения");
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатуры(Команда)
	ОткрытьФорму("Обработка.АХ_ШтрихкодыНоменклатурыАдресногоХранения.Форма.ФормаШтрихкодовНоменклатурыАдресногоХранения");
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеДокументыВыдачиКПередачиВАХ(Команда)
	ОткрытьФорму("Обработка.АХ_ДокументыДоступныеКПередачеНаСклад.Форма.Форма");
КонецПроцедуры
