
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов",
		"ОбеспеченностьСотрудника",
		Новый Структура("Организация, Сотрудник", ПолучитьОрганизацию(ПараметрКоманды), ПараметрКоманды),
		Истина,
		Ложь);    		
		
	ОткрытьФорму(
		"Отчет.ОбеспеченностьСотрудника.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно); 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизацию(Сотрудник)
	
	Возврат Сотрудник.Владелец;
	
КонецФункции