Процедура ВозвратСредствЗащитыОтСотрудника_ЗаполнитьТаблицуДокумента(ТекущийОбъект,Основание) Экспорт
	
	// Заполнение шапки
	ТекущийОбъект.Организация 			= Основание.Организация;
	ТекущийОбъект.Сотрудник 			= Основание.Сотрудник;
	ТекущийОбъект.ДокументОснование 	= Основание.Ссылка;
	
	Запрос = Новый Запрос;
	
	Если ТекущийОбъект.Организация.ИспользоватьПроцентИзноса Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаПоПотребностиОбороты.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОбороты.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОбороты.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОбороты.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребностиОбороты.ПроцентИзноса КАК ПроцентИзноса,
		|	МАКСИМУМ(ВыдачаПоПотребностиОбороты.Период) КАК ДатаДокумента
		|ПОМЕСТИТЬ ВТ_ПоследнийПриходВыдачиПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Обороты(, &ДатаАнализа, Регистратор, Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОбороты
		|ГДЕ
		|	НЕ ВыдачаПоПотребностиОбороты.КоличествоПриход = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаПоПотребностиОбороты.НормаВыдачи,
		|	ВыдачаПоПотребностиОбороты.НоменклатураНормы,
		|	ВыдачаПоПотребностиОбороты.ДатаПотребности,
		|	ВыдачаПоПотребностиОбороты.ДатаВыдачи,
		|	ВыдачаПоПотребностиОбороты.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзноса,
		|	ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента КАК ДатаДокумента
		|ПОМЕСТИТЬ ВТ_АктуальнаяВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(&ДатаАнализа, Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнийПриходВыдачиПоПотребности КАК ВТ_ПоследнийПриходВыдачиПоПотребности
		|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.НормаВыдачи
		|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВТ_ПоследнийПриходВыдачиПоПотребности.НоменклатураНормы
		|			И ВыдачаПоПотребностиОстатки.ДатаПотребности = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаПотребности
		|			И ВыдачаПоПотребностиОстатки.ДатаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаВыдачи
		|			И ВыдачаПоПотребностиОстатки.ПроцентИзноса = ВТ_ПоследнийПриходВыдачиПоПотребности.ПроцентИзноса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыдачаПоПотребности.Организация КАК Организация,
		|	ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачаПоПотребности.ПроцентИзноса КАК ПроцентИзноса,
		|	ВЫБОР
		|		КОГДА ВыдачаПоПотребности.Организация.ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|			ТОГДА РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, МЕСЯЦ)
		|	КОНЕЦ КАК РасчетныйПроцентИзноса,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|				КОГДА ВыдачаПоПотребности.Организация.ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|					ТОГДА РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, ДЕНЬ)
		|				ИНАЧЕ РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, МЕСЯЦ)
		|			КОНЕЦ >= 1
		|			ТОГДА 100
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВыдачаПоПотребности.ПроцентИзноса = 0
		|					ТОГДА ВЫБОР
		|							КОГДА ВыдачаПоПотребности.Организация.ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|								ТОГДА РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, ДЕНЬ)
		|							ИНАЧЕ РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, МЕСЯЦ)
		|						КОНЕЦ * 100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВыдачаПоПотребности.Организация.ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|							ТОГДА РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, ДЕНЬ)
		|						ИНАЧЕ РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_АктуальнаяВыдачаПоПотребности.ДатаДокумента, ВыдачаПоПотребности.ДатаПотребности, МЕСЯЦ)
		|					КОНЕЦ * (1 - ВыдачаПоПотребности.ПроцентИзноса / 100) * 100 + ВыдачаПоПотребности.ПроцентИзноса
		|			КОНЕЦ
		|	КОНЕЦ КАК ТекущийПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности КАК ВыдачаПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктуальнаяВыдачаПоПотребности КАК ВТ_АктуальнаяВыдачаПоПотребности
		|		ПО ВыдачаПоПотребности.НормаВыдачи = ВТ_АктуальнаяВыдачаПоПотребности.НормаВыдачи
		|			И ВыдачаПоПотребности.НоменклатураНормы = ВТ_АктуальнаяВыдачаПоПотребности.НоменклатураНормы
		|			И ВыдачаПоПотребности.ДатаПотребности = ВТ_АктуальнаяВыдачаПоПотребности.ДатаПотребности
		|			И ВыдачаПоПотребности.ДатаВыдачи = ВТ_АктуальнаяВыдачаПоПотребности.ДатаВыдачи
		|			И ВыдачаПоПотребности.ПроцентИзноса = ВТ_АктуальнаяВыдачаПоПотребности.ПроцентИзноса
		|ГДЕ
		|	ВыдачаПоПотребности.Регистратор = &ДокументОснование
		|	И ВыдачаПоПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроцентыИзноса.Ссылка КАК Ссылка,
		|	ПроцентыИзноса.Владелец КАК Владелец,
		|	ПроцентыИзноса.Код КАК Код
		|ПОМЕСТИТЬ ВТ_ПроцентыИзноса
		|ИЗ
		|	Справочник.ПроцентыИзноса КАК ПроцентыИзноса
		|ГДЕ
		|	ПроцентыИзноса.Владелец = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыдачаПоПотребности.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыдачаПоПотребности.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыдачаПоПотребности.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_ВыдачаПоПотребности.ДатаВыдачи КАК ДатаВыдачи,
		|	МИНИМУМ(ВТ_ПроцентыИзноса.Код) КАК Код
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	ВТ_ВыдачаПоПотребности КАК ВТ_ВыдачаПоПотребности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентыИзноса КАК ВТ_ПроцентыИзноса
		|		ПО ВТ_ВыдачаПоПотребности.Организация = ВТ_ПроцентыИзноса.Владелец
		|			И ВТ_ВыдачаПоПотребности.ТекущийПроцентИзноса <= ВТ_ПроцентыИзноса.Код
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВыдачаПоПотребности.НормаВыдачи,
		|	ВТ_ВыдачаПоПотребности.НоменклатураНормы,
		|	ВТ_ВыдачаПоПотребности.ДатаПотребности,
		|	ВТ_ВыдачаПоПотребности.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ПроцентыИзноса.Ссылка КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_ИзносДляВозврата
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентыИзноса КАК ВТ_ПроцентыИзноса
		|		ПО ВТ_Результат.Код = ВТ_ПроцентыИзноса.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписаниеСредствЗащитыСотрудникаТовары.НормаВыдачи КАК НормаВыдачи,
		|	СписаниеСредствЗащитыСотрудникаТовары.НоменклатураНормы КАК НоменклатураНормы,
		|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура КАК Номенклатура,
		|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СписаниеСредствЗащитыСотрудникаТовары.ДатаВыдачи КАК ДатаВыдачи,
		|	СписаниеСредствЗащитыСотрудникаТовары.Количество КАК Количество,
		|	СписаниеСредствЗащитыСотрудникаТовары.Цена КАК Цена,
		|	СписаниеСредствЗащитыСотрудникаТовары.Сумма КАК Сумма,
		|	ЕСТЬNULL(ВТ_ИзносДляВозврата.ПроцентИзноса, ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)) КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СписаниеСИзносом
		|ИЗ
		|	Документ.СписаниеСредствЗащитыСотрудника.Товары КАК СписаниеСредствЗащитыСотрудникаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзносДляВозврата КАК ВТ_ИзносДляВозврата
		|		ПО СписаниеСредствЗащитыСотрудникаТовары.НоменклатураНормы = ВТ_ИзносДляВозврата.НоменклатураНормы
		|			И СписаниеСредствЗащитыСотрудникаТовары.ДатаВыдачи = ВТ_ИзносДляВозврата.ДатаВыдачи
		|ГДЕ
		|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписаниеСИзносом.Номенклатура КАК Номенклатура,
		|	ВТ_СписаниеСИзносом.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ВТ_СписаниеСИзносом.Количество) КАК Количество,
		|	СРЕДНЕЕ(ВТ_СписаниеСИзносом.Цена) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_СписаниеСИзносом.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)
		|				ТОГДА ВТ_СписаниеСИзносом.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ВТ_СписаниеСИзносом.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_СписаниеСИзносом КАК ВТ_СписаниеСИзносом
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписаниеСИзносом.Номенклатура,
		|	ВТ_СписаниеСИзносом.ХарактеристикаНоменклатуры,
		|	ВТ_СписаниеСИзносом.ПроцентИзноса";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура,
		|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры,
		|	СУММА(СписаниеСредствЗащитыСотрудникаТовары.Количество) КАК Количество,
		|	СРЕДНЕЕ(СписаниеСредствЗащитыСотрудникаТовары.Цена) КАК Цена,
		|	СУММА(СписаниеСредствЗащитыСотрудникаТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.СписаниеСредствЗащитыСотрудника.Товары КАК СписаниеСредствЗащитыСотрудникаТовары
		|ГДЕ
		|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка = &ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура,
		|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование",	ТекущийОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.ДокументОснование.Организация);
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущийОбъект.ДокументОснование.Дата);
	Запрос.УстановитьПараметр("ДатаАнализа",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.ДокументОснование));
	Запрос.УстановитьПараметр("Сотрудник",			ТекущийОбъект.ДокументОснование.Сотрудник);
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры	

Процедура ЗаявкаНаВыдачу_ЗаполнитьТаблицуДокумента(ТекущийОбъект, УтивыватьПросроченнуюПотребность) Экспорт
	
	
	
	
КонецПроцедуры

Процедура ОбращениеНаСклад_ЗаполнитьТаблицуДокумента(ТекущийОбъект) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(ТекущийОбъект.Сотрудник);
	
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(ТекущийОбъект.Склад);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	ПотребностьВыдачиСИЗОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
	|				И НАЧАЛОПЕРИОДА(ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаВыдачи,
	|	ВТ_Потребность.КоличествоОстаток КАК Количество,
	|	ВТ_Потребность.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_СоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_Потребность.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Сотрудник.ФизическоеЛицо.Пол КАК ПолСотрудника,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаПотребности 					= Результат[3].Выгрузить();
	ТаблицаНоменклатурыНормСотрудников 	= Результат[4].Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущийОбъект.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.ПолСотрудника КАК ПолСотрудника,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ТаблицаПотребности.Количество КАК Количество,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
	|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
	|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
	|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
	|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаРазмеров.Рост КАК Рост,
	|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
	|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
	|	ТаблицаРазмеров.Комплект КАК Комплект,
	|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
	|ИЗ
	|	&ТаблицаРазмеров КАК ТаблицаРазмеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ПериодРасчета,
	|			Организация = &ОрганизацияДляОстатков
	|				И Склад В (&МассивСкладов)) КАК ОстаткиНоменклатурыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаПотребности.Количество КАК Количество,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ПотребностьБезКомплектующих
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаРазмеров.Сотрудник
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбращениеНаСкладТовары.Номенклатура КАК Номенклатура,
	|	ОбращениеНаСкладТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбращениеНаСкладТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_РезервПодЗаявки
	|ИЗ
	|	Документ.ОбращениеНаСклад.Товары КАК ОбращениеНаСкладТовары
	|ГДЕ
	|	ОбращениеНаСкладТовары.Ссылка.Дата < &Период
	|	И НЕ ОбращениеНаСкладТовары.Отказ
	|	И ОбращениеНаСкладТовары.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА &ОрганизацияДляОстатков = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОбращениеНаСкладТовары.Ссылка.Организация = &ОрганизацияДляОстатков
	|		КОНЕЦ
	|	И ОбращениеНаСкладТовары.Ссылка.СтатусОбращения = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращенийНаСклад.Открыто)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбращениеНаСкладТовары.Номенклатура,
	|	ОбращениеНаСкладТовары.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьБезКомплектующих.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьБезКомплектующих.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.Номенклатура КАК Номенклатура,
	|	ВТ_ПотребностьБезКомплектующих.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.Количество КАК Количество,
	|	ВТ_ПотребностьБезКомплектующих.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьБезКомплектующих.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ПотребностьБезКомплектующих.Приоритет КАК Приоритет,
	|	ВТ_ПотребностьБезКомплектующих.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_ПотребностьБезКомплектующих КАК ВТ_ПотребностьБезКомплектующих
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи,
	|	ПриоритетСоответствия,
	|	Приоритет
	|ИТОГИ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток - ЕСТЬNULL(ВТ_РезервПодЗаявки.Количество, 0)) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервПодЗаявки КАК ВТ_РезервПодЗаявки
	|		ПО ВТ_ОстаткиНоменклатуры.Номенклатура = ВТ_РезервПодЗаявки.Номенклатура
	|			И ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры = ВТ_РезервПодЗаявки.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиНоменклатуры.Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток - ЕСТЬNULL(ВТ_РезервПодЗаявки.Количество, 0)) > 0";
	
	Запрос.УстановитьПараметр("ТаблицаПотребности", 	ТаблицаПотребности);
	Запрос.УстановитьПараметр("ТаблицаРазмеров", 		ТаблицаРазмеров);
	Запрос.УстановитьПараметр("ПериодРасчета",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Период",					?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСкладов",			МассивСкладов);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",	?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),ТекущийОбъект.Организация));
	
	ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаОстатков = Результат[6].Выгрузить();
	
	ВыборкаПоСотруднику = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСотруднику.Следующий() Цикл
		
		ВыборкаПоНормеВыдачи = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
			
			ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			СтрокаДобавлена = Ложь;
			
			Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
				
				ВыборкаПоДате = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоДате.Следующий() Цикл
					
					СтрокаДобавлена = Ложь;
					
					ВыборкаПоНоменклатуре = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоНоменклатуре.Следующий() Цикл
						
						СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоНоменклатуре.ХарактеристикаНоменклатуры);
						
						НайденныеСтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
						
						Если НЕ (НайденныеСтрокиОстатков.Количество() = 0 ИЛИ НайденныеСтрокиОстатков[0].КоличествоОстаток < ВыборкаПоНоменклатуре.Количество) Тогда
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							НайденныеСтрокиОстатков[0].КоличествоОстаток = НайденныеСтрокиОстатков[0].КоличествоОстаток - ВыборкаПоНоменклатуре.Количество;
							СтрокаДобавлена = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					Если НЕ СтрокаДобавлена Тогда
						
						ВыборкаПоНоменклатуре.Сбросить();
						Пока ВыборкаПоНоменклатуре.Следующий() Цикл
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
							НоваяСтрока.Отказ 						= Истина;
							НоваяСтрока.ПричинаОтказа  				= Справочники.ПричиныНевыдачиСИЗ.НетНаСкладе;
							НоваяСтрока.Номенклатура 				= Справочники.Номенклатура.ПустаяСсылка();
							НоваяСтрока.ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
							Прервать;
						КонецЦикла;
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекущийОбъект.Товары.Загрузить(ТаблицаДокумента);
	ТекущийОбъект.Товары.Сортировать("НормаВыдачи Возр, НоменклатураНормы Возр");	
	
КонецПроцедуры

Процедура ВыдачаСИЗ_ЗаполнитьТаблицуДокумента(ТекущийОбъект, ВыбранныйСотрудник = Неопределено, ДСИЗ = Неопределено) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	//АСТБ_ALEXEY_72838_**************************************************************
	ТекущийОбъект.ШтрихкодыНоменклатуры.Очистить();
	ТекущийОбъект.КодыМаркировки.Очистить();
	//АСТБ_ALEXEY_72838_**************************************************************
	Если ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ТекущийОбъект.Сотрудник);
		
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(ТекущийОбъект.Склад);
		
	ИначеЕсли ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
		
		Если ВыбранныйСотрудник = Неопределено Тогда
			
			//определяем режим заполнения
			Если ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка Тогда
				
				МассивСотрудников 		= ПроцедурыРаботыСНормамиСервер.ПолучитьМассивСотрудниковПодразделений(Истина,Новый Массив,?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущаяДата()));
				ТаблицаСкладовВыдачи 	= ПроцедурыРаботыСНормамиСервер.ПолучитьСкладыВыдачиСотрудников(МассивСотрудников,ТекущийОбъект.ВидВыдачиСИЗ,ТекущийОбъект.Организация);
				ТаблицаСкладовВыдачи 	= ТаблицаСкладовВыдачи.Скопировать(Новый Структура("Склад",ТекущийОбъект.Склад));
				МассивСотрудников 		= ТаблицаСкладовВыдачи.ВыгрузитьКолонку("Сотрудник");
				
				МассивСкладов = Новый Массив;
				МассивСкладов.Добавить(ТекущийОбъект.Склад);
				МассивСкладов.Добавить(ТекущийОбъект.СкладОтправитель);
				
			Иначе
				
				Если ТекущийОбъект.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда //фактическая выдача по предварительной заявке
					
					Документы.ВыдачаСредствЗащитыСотруднику.ЗаполнитьТаблицуДокументаПоЗаявке(ТекущийОбъект);
					Возврат;
					
				Иначе //фактическая выдача без предварительной заявки
					
					МассивСотрудников 		= ПроцедурыРаботыСНормамиСервер.ПолучитьМассивСотрудниковПодразделений(Истина,Новый Массив,?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущаяДата()));
					ТаблицаСкладовВыдачи 	= ПроцедурыРаботыСНормамиСервер.ПолучитьСкладыВыдачиСотрудников(МассивСотрудников,ТекущийОбъект.ВидВыдачиСИЗ,ТекущийОбъект.Организация);
					ТаблицаСкладовВыдачи 	= ТаблицаСкладовВыдачи.Скопировать(Новый Структура("Склад",ТекущийОбъект.Склад));
					МассивСотрудников 		= ТаблицаСкладовВыдачи.ВыгрузитьКолонку("Сотрудник");
					
					МассивСкладов = Новый Массив;
					МассивСкладов.Добавить(ТекущийОбъект.Склад);
					МассивСкладов.Добавить(ТекущийОбъект.СкладОтправитель);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			МассивСотрудников = Новый Массив;
			Для Каждого ТекущийСотрудник Из ВыбранныйСотрудник Цикл
				МассивСотрудников.Добавить(ТекущийСотрудник);
			КонецЦикла;
			
			//при заполнении по сотруднику нужно считать остатки по складу-отправителю
			МассивСкладов = Новый Массив;
			МассивСкладов.Добавить(ТекущийОбъект.СкладОтправитель);
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого ТекСтрокаТовары Из ТекущийОбъект.ДокументОснование.Товары Цикл
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаТовары);
			НоваяСтрока.ДатаВыдачи 	= ТекущийОбъект.Дата;
			НоваяСтрока.Сотрудник 	= ТекущийОбъект.Сотрудник;
		КонецЦикла;
		
		ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
	|	ПотребностьВыдачиСИЗОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|				И НАЧАЛОПЕРИОДА(ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|				И ВЫБОР
	|					КОГДА &ДСИЗ = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ДСИЗ
	|								ТОГДА НоменклатураНормы.ВидСИЗ.Дерматологический
	|							ИНАЧЕ НЕ ЕСТЬNULL(НоменклатураНормы.ВидСИЗ.Дерматологический, ЛОЖЬ)
	|						КОНЕЦ
	|				КОНЕЦ) КАК ПотребностьВыдачиСИЗОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаВыдачи,
	|	ВТ_Потребность.КоличествоОстаток КАК Количество,
	|	ВТ_Потребность.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_СоставНормы.ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_Потребность.НормаВыдачи = ВТ_СоставНормы.Ссылка
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Сотрудник.ФизическоеЛицо.Пол КАК ПолСотрудника,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Результат.Количество,
	|	ВТ_Результат.КоличествоПотребность,
	|	ВТ_Результат.ПериодичностьВыдачи
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник.Наименование,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",		ТекущийОбъект.ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ДСИЗ",				ДСИЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаПотребности 					= Результат[3].Выгрузить();
	ТаблицаНоменклатурыНормСотрудников 	= Результат[4].Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка),ТекущийОбъект.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.ПолСотрудника КАК ПолСотрудника,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ТаблицаПотребности.Количество КАК Количество,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
	|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
	|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
	|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
	|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаРазмеров.Рост КАК Рост,
	|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
	|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
	|	ТаблицаРазмеров.Комплект КАК Комплект,
	|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
	|ИЗ
	|	&ТаблицаРазмеров КАК ТаблицаРазмеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ПериодРасчета,
	|			Организация = &ОрганизацияДляОстатков
	|				И Склад В (&МассивСкладов)) КАК ОстаткиНоменклатурыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаПотребности.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаПотребности.Количество КАК Количество,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПотребности.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_ПотребностьБезКомплектующих
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|			ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_Номенклатура.Номенклатура
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ТаблицаРазмеров.Сотрудник
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаРазмеров.Комплект КАК Комплект,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаРазмеров.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_ОстаткиНоменклатуры.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ ВТ_КомплектующиеДляСотрудников
	|ИЗ
	|	ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|		ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_ОстаткиНоменклатуры.Номенклатура
	|			И ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры = ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_ТаблицаРазмеров.Номенклатура = ВТ_Номенклатура.Номенклатура
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_ТаблицаРазмеров.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка КАК Комплект,
	|	МАКСИМУМ(НоменклатураКомплектующие.НомерСтроки) КАК КоличествоКомплектующих
	|ПОМЕСТИТЬ ВТ_КоличествоКомплектующих
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКомплектующие.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьБезКомплектующих.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьБезКомплектующих.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьБезКомплектующих.Номенклатура КАК Номенклатура,
	|	ВТ_ПотребностьБезКомплектующих.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ПотребностьБезКомплектующих.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ПотребностьБезКомплектующих.Количество КАК Количество,
	|	ВТ_ПотребностьБезКомплектующих.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ПотребностьБезКомплектующих.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ПотребностьБезКомплектующих.Приоритет КАК Приоритет,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ПотребностьБезКомплектующих.Количество КАК Сумма,
	|	ВТ_ПотребностьБезКомплектующих.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ИЗ
	|	ВТ_ПотребностьБезКомплектующих КАК ВТ_ПотребностьБезКомплектующих
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_ПотребностьБезКомплектующих.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_ПотребностьБезКомплектующих.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ПриоритетСоответствия,
	|	Приоритет
	|ИТОГИ ПО
	|	Сотрудник,
	|	НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КомплектующиеДляСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_КомплектующиеДляСотрудников.Комплект КАК Комплект,
	|	ВТ_КомплектующиеДляСотрудников.Номенклатура КАК Номенклатура,
	|	ВТ_КомплектующиеДляСотрудников.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_КомплектующиеДляСотрудников.Количество КАК КоличествоВКомплекте,
	|	СУММА(ВТ_КомплектующиеДляСотрудников.Остаток) КАК Остаток,
	|	ВТ_КоличествоКомплектующих.КоличествоКомплектующих КАК КоличествоКомплектующих,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена
	|ИЗ
	|	ВТ_КомплектующиеДляСотрудников КАК ВТ_КомплектующиеДляСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_КомплектующиеДляСотрудников.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_КомплектующиеДляСотрудников.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоКомплектующих КАК ВТ_КоличествоКомплектующих
	|		ПО ВТ_КомплектующиеДляСотрудников.Комплект = ВТ_КоличествоКомплектующих.Комплект
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КомплектующиеДляСотрудников.Сотрудник,
	|	ВТ_КомплектующиеДляСотрудников.Комплект,
	|	ВТ_КомплектующиеДляСотрудников.Номенклатура,
	|	ВТ_КомплектующиеДляСотрудников.ХарактеристикаНоменклатуры,
	|	ВТ_КоличествоКомплектующих.КоличествоКомплектующих,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0),
	|	ВТ_КомплектующиеДляСотрудников.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Комплект,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ОстаткиНоменклатуры.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиНоменклатуры.Номенклатура,
	|	ВТ_ОстаткиНоменклатуры.ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("ТаблицаПотребности", 	ТаблицаПотребности);
	Запрос.УстановитьПараметр("ТаблицаРазмеров", 		ТаблицаРазмеров);
	Запрос.УстановитьПараметр("ПериодРасчета",			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Период",					?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация",			ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("МассивСкладов",			МассивСкладов);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",	?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),ТекущийОбъект.Организация));
	
	ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаКомплектующих 	= Результат[9].Выгрузить();
	ТаблицаОстатков 		= Результат[10].Выгрузить();
	
	ВыборкаПоСотруднику = Результат[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСотруднику.Следующий() Цикл
		
		ВыборкаПоНормеВыдачи = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
			
			ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			СтрокаДобавлена = Ложь;
			
			Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
				
				СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаПоНоменклатуреНормы.Номенклатура, ВыборкаПоНоменклатуреНормы.ХарактеристикаНоменклатуры);
				
				НайденныеСтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
				
				Если НайденныеСтрокиОстатков.Количество() = 0 ИЛИ НайденныеСтрокиОстатков[0].КоличествоОстаток < ВыборкаПоНоменклатуреНормы.Количество Тогда
					СтруктураПоиска = Новый Структура("Сотрудник, Комплект", ВыборкаПоНоменклатуреНормы.Сотрудник, ВыборкаПоНоменклатуреНормы.Номенклатура);
					НайденныеСтроки = ТаблицаКомплектующих.НайтиСтроки(СтруктураПоиска);
					Если НайденныеСтроки.Количество() = 0 Тогда
						ДобавлятьКомплектующие = Ложь;
					Иначе
						Если НайденныеСтроки[0].КоличествоКомплектующих = НайденныеСтроки.Количество() Тогда
							ДобавлятьКомплектующие = Истина;
							Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
								Если НайденнаяСтрока.Остаток < НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуреНормы.Количество Тогда
									ДобавлятьКомплектующие = Ложь;
								КонецЕсли;
							КонецЦикла;
						Иначе
							ДобавлятьКомплектующие = Ложь;
						КонецЕсли;
					КонецЕсли;
					Если ДобавлятьКомплектующие Тогда
						Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							НоваяСтрока = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуреНормы);
							НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы = 1;
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
							НоваяСтрока.Сумма = НоваяСтрока.Цена * НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуреНормы.Количество;
							НайденнаяСтрока.Остаток = НайденнаяСтрока.Остаток - НайденнаяСтрока.КоличествоВКомплекте * ВыборкаПоНоменклатуреНормы.Количество;
						КонецЦикла;
						СтрокаДобавлена = Истина;
						Прервать;
					КонецЕсли;
				Иначе
					НоваяСтрока = ТаблицаДокумента.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуреНормы);
					НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы = 1;
					НайденныеСтрокиОстатков[0].КоличествоОстаток = НайденныеСтрокиОстатков[0].КоличествоОстаток - ВыборкаПоНоменклатуреНормы.Количество;
					СтрокаДобавлена = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ СтрокаДобавлена Тогда
				
				ВыборкаПоНоменклатуреНормы.Сбросить();
				Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
					НоваяСтрока = ТаблицаДокумента.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуреНормы);
					НоваяСтрока.КоличествоСовпаденийНоменклатурыНормы 	= 1;  
					Если ТекущийОбъект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
						НоваяСтрока.НеВыдано 							= Истина;
						НоваяСтрока.НеВыданоПоПричине                   = Справочники.ПричиныНевыдачиСИЗ.НетНаСкладе;
					КонецЕсли;
					НоваяСтрока.Номенклатура 							= Справочники.Номенклатура.ПустаяСсылка();
					НоваяСтрока.ХарактеристикаНоменклатуры 				= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					НоваяСтрока.Цена 									= 0;
					НоваяСтрока.Сумма 									= 0;
					Прервать;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДокумента = ПроцедурыРаботыСНормамиСервер.ПолучитьОптимальнуюТаблицуВыдачи(ТекущийОбъект,ТаблицаДокумента);
	ТаблицаДокумента = ПроцедурыРаботыСНормамиСервер.ПроверитьСовпадающуюНоменклатуруНормы(ТаблицаДокумента);
	
	ТаблицаДокумента.ЗаполнитьЗначения(Ложь,"ДобавленаКопированием");
	
	ТекущийОбъект.Товары.Загрузить(ТаблицаДокумента);
	ТекущийОбъект.Товары.Сортировать("Сотрудник Возр, НормаВыдачи Возр, НоменклатураНормы Возр");
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура СписаниеСредствЗащитыСотрудника_ЗаполнитьТаблицуДокумента(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.Увольнение Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗ.Количество КАК Сумма
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗ.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗ.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
		
	ИначеЕсли ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.ОкончаниеСрокаНоски Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
		|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_ПериодичностьВыдачи
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, 12 * ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|	КОНЕЦ КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодичностьВыдачи КАК ВТ_ПериодичностьВыдачи
		|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_ПериодичностьВыдачи.Ссылка
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ПериодичностьВыдачи.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаВыдачи КАК ДатаВыдачи,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Сумма
		|ИЗ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи КАК ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаСледующейВыдачи, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",			?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
		
	ИначеЕсли ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.ОтменаНорм Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ПотребностьВыдачиСИЗОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыданныеСИЗ.КоличествоОстаток КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗ.КоличествоОстаток КАК Сумма
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_ВыданныеСИЗ.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗ.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗ.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
		|ГДЕ
		|	ВТ_Потребность.НоменклатураНормы ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВыданныеСИЗ.НормаВыдачи.Наименование,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы.Наименование,
		|	ВТ_ВыданныеСИЗ.Номенклатура.Наименование,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры.КодSAP,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("Сотрудник",			ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",		ТекущийОбъект.ВидВыдачиСИЗ);
		
	//+++АСТБ_Горюшин_Алексей_20510
	ИначеЕсли ТекущийОбъект.ПричинаСписания = Перечисления.ПричиныСписания.ТехническоеСписание Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗ.Количество КАК Сумма
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗ.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗ.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
	//---АСТБ_Горюшин_Алексей_20510
	
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество,
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
		|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ПериодичностьВыдачиТипПериода,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК ПериодичностьВыдачиКоличествоПериодов
		|ПОМЕСТИТЬ ВТ_ПериодичностьВыдачи
		|ИЗ
		|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗ.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗ.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, 12 * ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыданныеСИЗ.ДатаВыдачи, МЕСЯЦ, ВТ_ПериодичностьВыдачи.ПериодичностьВыдачиКоличествоПериодов)
		|	КОНЕЦ КАК ДатаСледующейВыдачи,
		|	ВТ_ВыданныеСИЗ.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|ИЗ
		|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодичностьВыдачи КАК ВТ_ПериодичностьВыдачи
		|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_ПериодичностьВыдачи.Ссылка
		|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_ПериодичностьВыдачи.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ЗанятыеРабочиеМестаОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ПериодРасчета,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК ЗанятыеРабочиеМестаОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура КАК Номенклатура,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Количество,
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаВыдачи КАК ДатаВыдачи,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) * ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Количество КАК Сумма
		|ИЗ
		|	ВТ_ВыданныеСИЗСДатойСледующейВыдачи КАК ВТ_ВыданныеСИЗСДатойСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Номенклатура.Поставщик = ВТ_ЦеныНоменклатуры.Поставщик
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ПО ВТ_ВыданныеСИЗСДатойСледующейВыдачи.Сотрудник = ВТ_ЗанятыеРабочиеМеста.Сотрудник
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_ВыданныеСИЗСДатойСледующейВыдачи.ДатаСледующейВыдачи, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	И НЕ ВТ_ЗанятыеРабочиеМеста.КоличествоОстаток ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		Запрос.УстановитьПараметр("Период",			?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ВидВыдачиСИЗ",	ТекущийОбъект.ВидВыдачиСИЗ);
		
	КонецЕсли;
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗачетУпрощеннойВыдачи_ЗаполнитьТаблицуДокумента(ТекущийОбъект, ВидЗаполнения, ЗначениеПараметраЗаполнения) Экспорт
	
	ТекущийОбъект.Товары.Очистить();
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка);
	
	Если ВидЗаполнения = "Полностью" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	0 КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
		|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность,
		|	ВЫБОР
		|		КОГДА ВТ_Потребность.ПериодичностьВыдачи ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Потребность.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 365 * ВЫБОР
		|								КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|									ТОГДА 1
		|								ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|							КОНЕЦ)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 30 * ВЫБОР
		|							КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|								ТОГДА 1
		|							ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|						КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_Выдача_Потребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача_Потребность.Сотрудник КАК Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.ДатаСледующейВыдачи) КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаСледующейВыдачи
		|ИЗ
		|	ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выдача_Потребность.Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник КАК Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.НоменклатураНормыПотребности) КАК НоменклатураНормыПотребности,
		|	ВТ_Выдача_Потребность.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество КАК Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи КАК ВТ_МаксимальнаяДатаСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|		ПО ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник = ВТ_Выдача_Потребность.Сотрудник
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи = ВТ_Выдача_Потребность.НормаВыдачи
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.ДатаСледующейВыдачи = ВТ_Выдача_Потребность.ДатаСледующейВыдачи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи,
		|	ВТ_Выдача_Потребность.ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник.Наименование,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи.Наименование";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация); 		
		
	ИначеЕсли ВидЗаполнения = "ПоСотрудникам" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				И Сотрудник В (&МассивСотрудников)) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	0 КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И СрокиНоскиПоУпрощеннойВыдаче.Сотрудник В(&МассивСотрудников)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация И Сотрудник В (&МассивСотрудников)) КАК ПотребностьВыдачиСИЗОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
		|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность,
		|	ВЫБОР
		|		КОГДА ВТ_Потребность.ПериодичностьВыдачи ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Потребность.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 365 * ВЫБОР
		|								КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|									ТОГДА 1
		|								ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|							КОНЕЦ)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 30 * ВЫБОР
		|							КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|								ТОГДА 1
		|							ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|						КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_Выдача_Потребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача_Потребность.Сотрудник КАК Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.ДатаСледующейВыдачи) КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаСледующейВыдачи
		|ИЗ
		|	ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выдача_Потребность.Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник КАК Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.НоменклатураНормыПотребности) КАК НоменклатураНормыПотребности,
		|	ВТ_Выдача_Потребность.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество КАК Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи КАК ВТ_МаксимальнаяДатаСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|		ПО ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник = ВТ_Выдача_Потребность.Сотрудник
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи = ВТ_Выдача_Потребность.НормаВыдачи
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.ДатаСледующейВыдачи = ВТ_Выдача_Потребность.ДатаСледующейВыдачи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи,
		|	ВТ_Выдача_Потребность.ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник.Наименование,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи.Наименование";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивСотрудников",			ЗначениеПараметраЗаполнения);
		
	ИначеЕсли ВидЗаполнения = "ПоПодразделениям" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Подразделение В (&МассивПодразделений)) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|				&ДатаАнализа,
		|				Организация = &Организация
		|					И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ВыданныеСредстваЗащитыОстатки.Сотрудник
		|ГДЕ
		|	НЕ ВыданныеСредстваЗащитыОстатки.Сотрудник ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	0 КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И НЕ СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|			ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
		|				И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ПотребностьВыдачиСИЗОстатки.Сотрудник
		|ГДЕ
		|	НЕ ПотребностьВыдачиСИЗОстатки.Сотрудник ЕСТЬ NULL
		|	И НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность,
		|	ВЫБОР
		|		КОГДА ВТ_Потребность.ПериодичностьВыдачи ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Потребность.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 365 * ВЫБОР
		|								КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|									ТОГДА 1
		|								ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|							КОНЕЦ)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 30 * ВЫБОР
		|							КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|								ТОГДА 1
		|							ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|						КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_Выдача_Потребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача_Потребность.Сотрудник КАК Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.ДатаСледующейВыдачи) КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаСледующейВыдачи
		|ИЗ
		|	ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выдача_Потребность.Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник КАК Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.НоменклатураНормыПотребности) КАК НоменклатураНормыПотребности,
		|	ВТ_Выдача_Потребность.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество КАК Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи КАК ВТ_МаксимальнаяДатаСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|		ПО ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник = ВТ_Выдача_Потребность.Сотрудник
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи = ВТ_Выдача_Потребность.НормаВыдачи
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.ДатаСледующейВыдачи = ВТ_Выдача_Потребность.ДатаСледующейВыдачи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи,
		|	ВТ_Выдача_Потребность.ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник.Наименование,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи.Наименование";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивПодразделений",		ЗначениеПараметраЗаполнения);
		
	ИначеЕсли ВидЗаполнения = "ПоДолжностям" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Должность В (&МассивДолжностей)) КАК ЗанятыеРабочиеМестаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|				&ДатаАнализа,
		|				Организация = &Организация
		|					И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ВыданныеСредстваЗащитыОстатки.Сотрудник
		|ГДЕ
		|	НЕ ВыданныеСредстваЗащитыОстатки.Сотрудник ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	0 КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И НЕ СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(&ДатаАнализа, Организация = &Организация) КАК ПотребностьВыдачиСИЗОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|			ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
		|				И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
		|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ПотребностьВыдачиСИЗОстатки.Сотрудник
		|ГДЕ
		|	НЕ ПотребностьВыдачиСИЗОстатки.Сотрудник ЕСТЬ NULL
		|	И НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность,
		|	ВЫБОР
		|		КОГДА ВТ_Потребность.ПериодичностьВыдачи ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Потребность.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 365 * ВЫБОР
		|								КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|									ТОГДА 1
		|								ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|							КОНЕЦ)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 30 * ВЫБОР
		|							КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|								ТОГДА 1
		|							ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|						КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_Выдача_Потребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача_Потребность.Сотрудник КАК Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.ДатаСледующейВыдачи) КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаСледующейВыдачи
		|ИЗ
		|	ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выдача_Потребность.Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник КАК Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.НоменклатураНормыПотребности) КАК НоменклатураНормыПотребности,
		|	ВТ_Выдача_Потребность.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество КАК Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи КАК ВТ_МаксимальнаяДатаСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|		ПО ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник = ВТ_Выдача_Потребность.Сотрудник
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи = ВТ_Выдача_Потребность.НормаВыдачи
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.ДатаСледующейВыдачи = ВТ_Выдача_Потребность.ДатаСледующейВыдачи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи,
		|	ВТ_Выдача_Потребность.ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник.Наименование,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи.Наименование";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("МассивДолжностей",			ЗначениеПараметраЗаполнения);
		
	ИначеЕсли ВидЗаполнения = "ПоНоменклатуреНормы" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыдаче
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
		|				И НоменклатураНормы В (&МассивНоменклатурыНормы)) КАК ВыданныеСредстваЗащитыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
		|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиНоскиПоУпрощеннойВыдаче.Сотрудник КАК Сотрудник,
		|	СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	СрокиНоскиПоУпрощеннойВыдаче.Номенклатура КАК Номенклатура,
		|	СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	0 КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|ИЗ
		|	РегистрСведений.СрокиНоскиПоУпрощеннойВыдаче КАК СрокиНоскиПоУпрощеннойВыдаче
		|ГДЕ
		|	СрокиНоскиПоУпрощеннойВыдаче.Организация = &Организация
		|	И СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы В(&МассивНоменклатурыНормы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыдаче.Сотрудник КАК Сотрудник,
		|	ВТ_ОстаткиПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ОстаткиПоВыдаче.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ОстаткиПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_ОстаткиПоВыдаче.Количество КАК Количество,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_СрокиНоскиПоУпрощеннойВыдаче.ПроцентИзноса КАК ПроцентИзноса
		|ПОМЕСТИТЬ ВТ_УпрощеннаяВыдача
		|ИЗ
		|	ВТ_ОстаткиПоВыдаче КАК ВТ_ОстаткиПоВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче КАК ВТ_СрокиНоскиПоУпрощеннойВыдаче
		|		ПО ВТ_ОстаткиПоВыдаче.Сотрудник = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник
		|			И ВТ_ОстаткиПоВыдаче.НоменклатураНормы = ВТ_СрокиНоскиПоУпрощеннойВыдаче.НоменклатураНормы
		|			И ВТ_ОстаткиПоВыдаче.Номенклатура = ВТ_СрокиНоскиПоУпрощеннойВыдаче.Номенклатура
		|			И ВТ_ОстаткиПоВыдаче.ХарактеристикаНоменклатуры = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ХарактеристикаНоменклатуры
		|			И ВТ_ОстаткиПоВыдаче.ДатаВыдачи = ВТ_СрокиНоскиПоУпрощеннойВыдаче.ДатаВыдачи
		|ГДЕ
		|	НЕ ВТ_СрокиНоскиПоУпрощеннойВыдаче.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
		|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоПотребность,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И НоменклатураНормы В (&МассивНоменклатурыНормы)) КАК ПотребностьВыдачиСИЗОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
		|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
		|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
		|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
		|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
		|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
		|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УпрощеннаяВыдача.Сотрудник КАК Сотрудник,
		|	ВТ_УпрощеннаяВыдача.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_УпрощеннаяВыдача.Номенклатура КАК Номенклатура,
		|	ВТ_УпрощеннаяВыдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_УпрощеннаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_УпрощеннаяВыдача.Количество КАК Количество,
		|	ВТ_УпрощеннаяВыдача.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_УпрощеннаяВыдача.ПроцентИзноса КАК ПроцентИзноса,
		|	ЕСТЬNULL(ВТ_Потребность.НормаВыдачи, ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК НормаВыдачи,
		|	ЕСТЬNULL(ВТ_Потребность.НоменклатураНормы, ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормыПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.ДатаПотребности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПотребности,
		|	ЕСТЬNULL(ВТ_Потребность.КоличествоПотребность, 0) КАК КоличествоПотребность,
		|	ВЫБОР
		|		КОГДА ВТ_Потребность.ПериодичностьВыдачи ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Потребность.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
		|					ТОГДА ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 365 * ВЫБОР
		|								КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|									ТОГДА 1
		|								ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|							КОНЕЦ)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_УпрощеннаяВыдача.ДатаВыдачи, ДЕНЬ, ВТ_Потребность.ПериодичностьВыдачи.КоличествоПериодов * 30 * ВЫБОР
		|							КОГДА ВТ_УпрощеннаяВыдача.Количество > ВТ_Потребность.КоличествоПотребность
		|								ТОГДА 1
		|							ИНАЧЕ ВТ_УпрощеннаяВыдача.Количество / ВТ_Потребность.КоличествоПотребность
		|						КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_Выдача_Потребность
		|ИЗ
		|	ВТ_УпрощеннаяВыдача КАК ВТ_УпрощеннаяВыдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|		ПО ВТ_УпрощеннаяВыдача.Сотрудник = ВТ_Потребность.Сотрудник
		|			И ВТ_УпрощеннаяВыдача.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача_Потребность.Сотрудник КАК Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.ДатаСледующейВыдачи) КАК ДатаСледующейВыдачи
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаСледующейВыдачи
		|ИЗ
		|	ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выдача_Потребность.Сотрудник,
		|	ВТ_Выдача_Потребность.НормаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник КАК Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи КАК НормаВыдачи,
		|	МАКСИМУМ(ВТ_Выдача_Потребность.НоменклатураНормыПотребности) КАК НоменклатураНормыПотребности,
		|	ВТ_Выдача_Потребность.ДатаПотребности КАК ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность КАК КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество КАК Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса КАК ПроцентИзноса
		|ИЗ
		|	ВТ_МаксимальнаяДатаСледующейВыдачи КАК ВТ_МаксимальнаяДатаСледующейВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдача_Потребность КАК ВТ_Выдача_Потребность
		|		ПО ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник = ВТ_Выдача_Потребность.Сотрудник
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи = ВТ_Выдача_Потребность.НормаВыдачи
		|			И ВТ_МаксимальнаяДатаСледующейВыдачи.ДатаСледующейВыдачи = ВТ_Выдача_Потребность.ДатаСледующейВыдачи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи,
		|	ВТ_Выдача_Потребность.ДатаПотребности,
		|	ВТ_Выдача_Потребность.КоличествоПотребность,
		|	ВТ_Выдача_Потребность.НоменклатураНормы,
		|	ВТ_Выдача_Потребность.Номенклатура,
		|	ВТ_Выдача_Потребность.ХарактеристикаНоменклатуры,
		|	ВТ_Выдача_Потребность.ДатаВыдачи,
		|	ВТ_Выдача_Потребность.Количество,
		|	ВТ_Выдача_Потребность.ПериодичностьВыдачи,
		|	ВТ_Выдача_Потребность.ПроцентИзноса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.Сотрудник.Наименование,
		|	ВТ_МаксимальнаяДатаСледующейВыдачи.НормаВыдачи.Наименование";
		
		Запрос.УстановитьПараметр("ДатаАнализа",				ДатаАнализа);
		Запрос.УстановитьПараметр("Период",						ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",				ТекущийОбъект.Организация); 
		Запрос.УстановитьПараметр("МассивНоменклатурыНормы",	ЗначениеПараметраЗаполнения);
		
	КонецЕсли;	
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры	

Процедура ВыдачаСИЗ_СкорректироватьТекущуюСтроку(ТекущийОбъект,АдресРезультатаПодбораВХранилище,НомерВыбраннойСтроки) Экспорт
	
	//АСТБ_ALEXEY_96460**************************************************************
	
	ТаблицаДанныхПодбора = ПолучитьИзВременногоХранилища(АдресРезультатаПодбораВХранилище);
	
	ДанныеВыбраннойСтроки = ТекущийОбъект.Товары[НомерВыбраннойСтроки-1];
	
	СтарыйКомплект = ДанныеВыбраннойСтроки.Комплект;
	
	Если ЗначениеЗаполнено(СтарыйКомплект) Тогда
		
		ЗаполнитьЗначенияСвойств(ДанныеВыбраннойСтроки,ТаблицаДанныхПодбора[0]);
		
		Если НЕ СтарыйКомплект = ДанныеВыбраннойСтроки.Комплект Тогда //комплектующее от другого комплекта
			ДанныеВыбраннойСтроки.Комплект = СтарыйКомплект;
		КонецЕсли;	
		
		ДанныеВыбраннойСтроки.Сумма = ДанныеВыбраннойСтроки.Количество * ДанныеВыбраннойСтроки.Цена * ?(ДанныеВыбраннойСтроки.КоличествоВКомплекте = 0,1,ДанныеВыбраннойСтроки.КоличествоВКомплекте);	
		
	Иначе
		
		ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
		ТаблицаДокумента.Очистить();
		
		МассивСтрокДляКорректировки = ТекущийОбъект.Товары.НайтиСтроки(Новый Структура("Сотрудник, НоменклатураНормы",ДанныеВыбраннойСтроки.Сотрудник,ДанныеВыбраннойСтроки.НоменклатураНормы));
		
		Для Каждого СтрокаДокумента Из ТекущийОбъект.Товары Цикл
			
			ИндексСтрокиДляКорректировки = МассивСтрокДляКорректировки.Найти(СтрокаДокумента);
			
			Если ИндексСтрокиДляКорректировки = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(),СтрокаДокумента,,"НомерСтроки");
			Иначе
				Для Каждого СтрокаТаблицыДанныхДляПодбора Из ТаблицаДанныхПодбора Цикл
					НоваяСтрока = ТаблицаДокумента.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,МассивСтрокДляКорректировки[ИндексСтрокиДляКорректировки],,"НомерСтроки");
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыДанныхДляПодбора,,"Количество");
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена * ?(НоваяСтрока.КоличествоВКомплекте = 0,1,НоваяСтрока.КоличествоВКомплекте);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущийОбъект.Товары.Загрузить(ТаблицаДокумента);
		
	КонецЕсли;
	
	//АСТБ_ALEXEY_96460**************************************************************
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ПолучитьТаблицуДвиженийПоПотребности(ДокументСсылка,ТаблицаДвижений,ДвиженияПоДоступнымУсловиямРаботы = Неопределено,ТаблицаВыдачаПоПотребности = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
		
		МассивСотрудников = ДокументСсылка.Товары.ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				ДокументСсылка.ВидВыдачиСИЗ);
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ДокументСсылка",				ДокументСсылка);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуВыдачиСИЗ(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СписаниеСредствЗащитыСотрудника") Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ДокументСсылка.Сотрудник);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		//СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				ДокументСсылка.ВидВыдачиСИЗ);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.Товары.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуСписанияСИЗ(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		МассивСотрудников = ДокументСсылка.Работники.ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.Работники.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуПриемаНаРаботу(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		
		МассивСотрудников = ДокументСсылка.Работники.ВыгрузитьКолонку("Сотрудник");
		
		//АсТБ_Alexey_55146_********************************************************************
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровоеПеремещениеРаботники.Ссылка.Дата КАК Период,
		|	КадровоеПеремещениеРаботники.НомерСтроки КАК НомерСтроки,
		|	КадровоеПеремещениеРаботники.Ссылка.Организация КАК Организация,
		|	КадровоеПеремещениеРаботники.Сотрудник КАК Сотрудник,
		|	КадровоеПеремещениеРаботники.ПодразделениеСтарое КАК ПодразделениеСтарое,
		|	КадровоеПеремещениеРаботники.ДолжностьСтарая КАК ДолжностьСтарая,
		|	КадровоеПеремещениеРаботники.РабочееМестоСтарое КАК РабочееМестоСтарое,
		|	КадровоеПеремещениеРаботники.ЗанимаемыхСтавокСтарое КАК ЗанимаемыхСтавокСтарое,
		|	КадровоеПеремещениеРаботники.ПодразделениеНовое КАК ПодразделениеНовое,
		|	КадровоеПеремещениеРаботники.ДолжностьНовая КАК ДолжностьНовая,
		|	КадровоеПеремещениеРаботники.РабочееМестоНовое КАК РабочееМестоНовое,
		|	КадровоеПеремещениеРаботники.ЗанимаемыхСтавокНовое КАК ЗанимаемыхСтавокНовое,
		|	ВЫБОР
		|		КОГДА КадровоеПеремещениеРаботники.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА КадровоеПеремещениеРаботники.Ссылка.ДатаОкончания
		|		ИНАЧЕ КадровоеПеремещениеРаботники.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания
		|ИЗ
		|	Документ.КадровоеПеремещение.Работники КАК КадровоеПеремещениеРаботники
		|ГДЕ
		|	КадровоеПеремещениеРаботники.Ссылка = &Ссылка
		|	И НЕ (КадровоеПеремещениеРаботники.ПодразделениеСтарое = КадровоеПеремещениеРаботники.ПодразделениеНовое
		|	И КадровоеПеремещениеРаботники.ДолжностьСтарая = КадровоеПеремещениеРаботники.ДолжностьНовая
		|	И КадровоеПеремещениеРаботники.РабочееМестоСтарое = КадровоеПеремещениеРаботники.РабочееМестоНовое)";
		
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		//АсТБ_Alexey_55146_********************************************************************
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		//АсТБ_Alexey_55146_********************************************************************
		СтруктураОтбора.Вставить("ТаблицаДокумента",			Запрос.Выполнить().Выгрузить());
		//АсТБ_Alexey_55146_********************************************************************
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуКадровогоПеремещения(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Увольнение") Тогда
		
		МассивСотрудников = ДокументСсылка.Работники.ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.Работники.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуУвольнения(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтсутствиеНаРабочемМесте") Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ДокументСсылка.Сотрудник);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ДатаНачала",					ДокументСсылка.ДатаНачала);
		СтруктураОтбора.Вставить("ДатаОкончания",				ДокументСсылка.ДатаОкончания);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуОтсутствияНаРабочемМесте(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриказПоНормамВыдачиСИЗ") Тогда
		
		//формируем массив сотрудников
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Подразделение КАК Подразделение,
		|	ТаблицаДокумента.Должность КАК Должность
		|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодРасчета, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ПО (ВЫБОР
		|				КОГДА ВТ_ТаблицаДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаДокумента.Подразделение = ЗанятыеРабочиеМестаОстатки.Подразделение
		|			КОНЕЦ)
		|			И ВТ_ТаблицаДокумента.Должность = ЗанятыеРабочиеМестаОстатки.Должность
		|ГДЕ
		|	НЕ ЗанятыеРабочиеМестаОстатки.Сотрудник ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ПериодРасчета",							ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",							ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("ТаблицаДокумента",						ДокументСсылка.НормыВыдачиСИЗ.Выгрузить());
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",							ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",						Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",						ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",							ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",					ДокументСсылка.НормыВыдачиСИЗ.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",					МассивСотрудников);
		СтруктураОтбора.Вставить("ДвиженияПоДоступнымУсловиямРаботы",	ДвиженияПоДоступнымУсловиямРаботы);
		
		Если МассивСотрудников.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуПриказПоНормамВыдачиСИЗ(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УстановкаУсловийРаботыСотрудника") Тогда
		
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(ДокументСсылка.Сотрудник);
		
		ТаблицаДокумента = ДокументСсылка.УсловияРаботы.Выгрузить();
		ТаблицаДокумента.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ТаблицаДокумента.ЗаполнитьЗначения(ДокументСсылка.Сотрудник,"Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ТаблицаДокумента);
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуУстановкиУсловийРаботыСотрудника(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УстановкаПериодаЗимы") Тогда
		
		//формируем массив сотрудников
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Подразделения.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В ИЕРАРХИИ(&МассивПодразделений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник
		|ИЗ
		|	ВТ_Подразделения КАК ВТ_Подразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодРасчета, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ПО ВТ_Подразделения.Подразделение = ЗанятыеРабочиеМестаОстатки.Подразделение
		|ГДЕ
		|	НЕ ЗанятыеРабочиеМестаОстатки.Сотрудник ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",		ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("МассивПодразделений",ДокументСсылка.ПериодыЗимы.ВыгрузитьКолонку("Подразделение"));
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаДокумента",				ДокументСсылка.Дата);
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.ПериодыЗимы.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуУстановкиПериодаЗимы(СтруктураОтбора);
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПереносЗимнейПотребности") Тогда
		
		//формируем массив сотрудников
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Подразделения.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В ИЕРАРХИИ(&МассивПодразделений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник
		|ИЗ
		|	ВТ_Подразделения КАК ВТ_Подразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ПериодРасчета, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		|		ПО ВТ_Подразделения.Подразделение = ЗанятыеРабочиеМестаОстатки.Подразделение
		|ГДЕ
		|	НЕ ЗанятыеРабочиеМестаОстатки.Сотрудник ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРасчета",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		Запрос.УстановитьПараметр("Организация",		ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("МассивПодразделений",ДокументСсылка.ПериодыЗимы.ВыгрузитьКолонку("Подразделение"));
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация",					ДокументСсылка.Организация);
		СтруктураОтбора.Вставить("ВидВыдачиСИЗ",				Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ДатаАнализа",					ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
		СтруктураОтбора.Вставить("ТаблицаДокумента",			ДокументСсылка.ПериодыЗимы.Выгрузить());
		СтруктураОтбора.Вставить("МассивСотрудников",			МассивСотрудников);
		
		ИсходнаяПотребностьВыдачи 	= ПолучитьИсходнуюПотребность(СтруктураОтбора);
		//ИсходнаяПотребностьВыдачи 	= ИсходнаяПотребностьВыдачи.Скопировать(Новый Структура("ЭтоЗима",Истина));
		КонечнаяПотребностьВыдачи 	= ПолучитьКонечнуюПотребностьПоДокументуПереносаЗимнейПотребности(СтруктураОтбора);
		//КонечнаяПотребностьВыдачи 	= КонечнаяПотребностьВыдачи.Скопировать(Новый Структура("ЭтоЗима",Истина));
		ТаблицаДвижений 			= ПроцедурыРаботыСНормамиСервер.СобратьТаблицуПотребности(ИсходнаяПотребностьВыдачи,КонечнаяПотребностьВыдачи,ДокументСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьТаблицуДвиженийВыдачиПоПотребности(ДокументСсылка,ТаблицаДвижений,ДвиженияПоПотребности,ДвиженияПоВыданнымСИЗ,ТаблицаВыдачаПоПотребности) Экспорт
	
	
	
КонецПроцедуры

// функция возвращает таблицу исходной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Количество выданных | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,МассивСотрудников,ВидВыдачиСИЗ)
//
Функция ПолучитьИсходнуюПотребность(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	ВидВыдачиСИЗ						= СтруктураОтбора.ВидВыдачиСИЗ;
	НеИспользоватьФильтрПоВидуВыдачи	= (ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПустаяСсылка());
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	МАКСИМУМ(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))
	|				И (НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|					ИЛИ &НеИспользоватьФильтрПоВидуВыдачи)) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))
	|				И (НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|					ИЛИ &НеИспользоватьФильтрПоВидуВыдачи)) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ВыданныеСИЗ.КоличествоОстаток, 0) КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_НормыСВыдачей
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ВыданныеСИЗ.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕстьNULL(ВТ_НормыСВыдачей.Сотрудник,ВТ_ПотребностьВыдачи.Сотрудник) КАК Сотрудник,
	|	ЕстьNULL(ВТ_НормыСВыдачей.Подразделение,ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕстьNULL(ВТ_НормыСВыдачей.ЭтоЗима,Ложь) КАк ЭтоЗима,
	|	ЕстьNULL(ВТ_НормыСВыдачей.НормаВыдачи,ВТ_ПотребностьВыдачи.НормаВыдачи) КАК НормаВыдачи,
	|	ЕстьNULL(ВТ_НормыСВыдачей.НоменклатураНормы,ВТ_ПотребностьВыдачи.НоменклатураНормы) КАК НоменклатураНормы,
	|	ЕстьNULL(ВТ_НормыСВыдачей.КоличествоВыдано,0) КАК КоличествоВыдано,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_НормыСВыдачей КАК ВТ_НормыСВыдачей
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_НормыСВыдачей.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_НормыСВыдачей.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_НормыСВыдачей.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.КоличествоВыдано КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоВидуВыдачи",	НеИспользоватьФильтрПоВидуВыдачи);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",						ВидВыдачиСИЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[5].Выгрузить();
	ТаблицаПодразделений 	= Результат[6].Выгрузить();
	ТаблицаДатПотребности 	= Результат[7].Выгрузить();
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.ДатаНачалаЗимы,
	|	ТаблицаЗимы.ДатаОкончанияЗимы,
	|	ТаблицаЗимы.ДатаПериода,
	|	ТаблицаЗимы.Подразделение
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник,
	|	ТаблицаПотребности.Подразделение,
	|	ТаблицаПотребности.НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы,
	|	ТаблицаПотребности.ДатаПотребности,
	|	ТаблицаПотребности.ЭтоЗима,
	|	ТаблицаПотребности.КоличествоПотребность,
	|	ТаблицаПотребности.КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаПотребности.ДатаПотребности КАК ДатаПотребности,
	|	МИНИМУМ(ВТ_ТаблицаПотребности.ЭтоЗима) КАК ЭтоЗима,
	|	МАКСИМУМ(ВТ_ТаблицаПотребности.КоличествоПотребность) КАК КоличествоПотребность,
	|	МАКСИМУМ(ВТ_ТаблицаПотребности.КоличествоВыдано) КАК КоличествоВыдано,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ТаблицаПотребности.ДатаПотребности = ВТ_ТаблицаЗимы.ДатаПериода
	|			И ВТ_ТаблицаПотребности.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаПотребности.Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы,
	|	ВТ_ТаблицаПотребности.ДатаПотребности,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",		ТаблицаЗимы);
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Количество выданных | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,МассивСотрудников,ДокументСсылка)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуВыдачиСИЗ(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ДокументСсылка 						= СтруктураОтбора.ДокументСсылка;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ КАК НормыВыдачиСИЗ
	|		ПО ВТ_ПодобранныеНормы.НормаВыдачи = НормыВыдачиСИЗ.Ссылка
	|ГДЕ
	|	НормыВыдачиСИЗ.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Количество КАК Количество,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано КАК НеВыдано,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоСовпаденийНоменклатурыНормы КАК КоличествоСовпаденийНоменклатурыНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте КАК КоличествоВКомплекте
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ТаблицаДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ГруппировкаПоНоменклатуреНормы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_ТаблицаДокумента.Количество) КАК КоличествоСумма,
	|	МАКСИМУМ(ВТ_ТаблицаДокумента.Количество) КАК КоличествоМаксимум
	|ПОМЕСТИТЬ ВТ_ГруппировкаПоНорме
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокумента.НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник КАК Сотрудник,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Подразделение КАК Подразделение,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ЕСТЬNULL(ВТ_ТаблицаДокумента.Количество, ВТ_Потребность.КоличествоОстаток)) КАК КоличествоВыдано,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ТаблицаДокумента.КоличествоПотребность, ВТ_Потребность.КоличествоОстаток)) КАК КоличествоПотребность,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.КоличествоСовпаденийНоменклатурыНормы ЕСТЬ NULL
	|			ТОГДА ВТ_Потребность.ДатаПотребности
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ТаблицаДокумента.НеВыдано
	|					ТОГДА ВТ_ТаблицаДокумента.ДатаВыдачи
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ТаблицаДокумента.КоличествоВКомплекте = 0
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ТаблицаДокумента.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|										ТОГДА ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * 12 * ВЫБОР
	|													КОГДА ВТ_ГруппировкаПоНорме.КоличествоСумма = 0
	|														ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|													ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоСумма
	|												КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * ВЫБОР
	|												КОГДА ВТ_ГруппировкаПоНорме.КоличествоСумма = 0
	|													ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|												ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоСумма
	|											КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_ТаблицаДокумента.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|									ТОГДА ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * 12 * ВЫБОР
	|												КОГДА ВТ_ГруппировкаПоНорме.КоличествоМаксимум = 0
	|													ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|												ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоМаксимум
	|											КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * ВЫБОР
	|											КОГДА ВТ_ГруппировкаПоНорме.КоличествоМаксимум = 0
	|												ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|											ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоМаксимум
	|										КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи КАК ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_ТаблицаДокумента.Сотрудник
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи = ВТ_ТаблицаДокумента.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппировкаПоНорме КАК ВТ_ГруппировкаПоНорме
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы = ВТ_ГруппировкаПоНорме.НоменклатураНормы
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи = ВТ_ГруппировкаПоНорме.НормаВыдачи
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_ГруппировкаПоНорме.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_Потребность.Сотрудник
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи = ВТ_Потребность.НормаВыдачи
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы = ВТ_Потребность.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппировкаПоНоменклатуреНормы КАК ВТ_ГруппировкаПоНоменклатуреНормы
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_ГруппировкаПоНоменклатуреНормы.Сотрудник
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы = ВТ_ГруппировкаПоНоменклатуреНормы.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Подразделение,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.ЭтоЗима,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.КоличествоСовпаденийНоменклатурыНормы ЕСТЬ NULL
	|			ТОГДА ВТ_Потребность.ДатаПотребности
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ТаблицаДокумента.НеВыдано
	|					ТОГДА ВТ_ТаблицаДокумента.ДатаВыдачи
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_ТаблицаДокумента.КоличествоВКомплекте = 0
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ТаблицаДокумента.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|										ТОГДА ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * 12 * ВЫБОР
	|													КОГДА ВТ_ГруппировкаПоНорме.КоличествоСумма = 0
	|														ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|													ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоСумма
	|												КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * ВЫБОР
	|												КОГДА ВТ_ГруппировкаПоНорме.КоличествоСумма = 0
	|													ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|												ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоСумма
	|											КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ_ТаблицаДокумента.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|									ТОГДА ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * 12 * ВЫБОР
	|												КОГДА ВТ_ГруппировкаПоНорме.КоличествоМаксимум = 0
	|													ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|												ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоМаксимум
	|											КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоПериодов * ВЫБОР
	|											КОГДА ВТ_ГруппировкаПоНорме.КоличествоМаксимум = 0
	|												ТОГДА ВТ_ГруппировкаПоНоменклатуреНормы.Количество
	|											ИНАЧЕ ВТ_ГруппировкаПоНорме.КоличествоМаксимум
	|										КОНЕЦ / ВТ_ТаблицаДокумента.ПериодичностьВыдачи.КоличествоВПериоде)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	МАКСИМУМ(ВТ_Результат.ДатаПотребности) КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_ГруппировкаРезультатаПоНормеВыдачи
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.КоличествоВыдано КАК КоличествоВыдано,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ГруппировкаРезультатаПоНормеВыдачи.ДатаПотребности КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппировкаРезультатаПоНормеВыдачи КАК ВТ_ГруппировкаРезультатаПоНормеВыдачи
	|		ПО ВТ_Результат.Сотрудник = ВТ_ГруппировкаРезультатаПоНормеВыдачи.Сотрудник
	|			И ВТ_Результат.НормаВыдачи = ВТ_ГруппировкаРезультатаПоНормеВыдачи.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_КоличествоВПериоде
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.Сотрудник КАК Сотрудник,
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.Подразделение КАК Подразделение,
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.КоличествоВыдано КАК КоличествоВыдано,
	|	ВТ_КоличествоВПериоде.КоличествоВПериоде КАК КоличествоПотребность,
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ КАК ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоВПериоде КАК ВТ_КоличествоВПериоде
	|		ПО ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.НормаВыдачи = ВТ_КоличествоВПериоде.НормаВыдачи
	|			И ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.НоменклатураНормы = ВТ_КоличествоВПериоде.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.ДатаПотребности ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ КАК ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ КАК ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ
	|ГДЕ
	|	НЕ ВТ_РезультатСУчетомНеиспользованныхЭлементовГруппыИЛИ.ДатаПотребности ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Ссылка",								ДокументСсылка);   
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",						ДокументСсылка.ВидВыдачиСИЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[10].Выгрузить();
	ТаблицаПодразделений 	= Результат[11].Выгрузить();
	ТаблицаДатПотребности 	= Результат[12].Выгрузить();
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Количество выданных | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,МассивСотрудников,ТаблицаДокумента,ДатаДокумента,ВидВыдачиСИЗ)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуСписанияСИЗ(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.НормаВыдачи,
	|	ТаблицаДокумента.НоменклатураНормы,
	|	ТаблицаДокумента.ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ КАК НормыВыдачиСИЗ
	|		ПО ВТ_ПодобранныеНормы.НормаВыдачи = НормыВыдачиСИЗ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка
	|ПОМЕСТИТЬ ВТ_СоставНормВыдачи
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы В(&МассивНоменклатураНормы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПотребностьВыдачи.Сотрудник,
	|	ВТ_ПотребностьВыдачи.НормаВыдачи,
	|	ВТ_ПотребностьВыдачи.НоменклатураНормы,
	|	&Период КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьДляИзменения
	|ИЗ
	|	ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО ВТ_ПотребностьВыдачи.НоменклатураНормы = ВТ_ТаблицаДокумента.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента1
	|		ПО ВТ_ПотребностьВыдачи.НормаВыдачи = ВТ_ТаблицаДокумента1.НормаВыдачи
	|ГДЕ
	|	ВТ_ПотребностьВыдачи.НормаВыдачи В
	|			(ВЫБРАТЬ
	|				ВТ_СоставНормВыдачи.Ссылка КАК НормаВыдачи
	|			ИЗ
	|				ВТ_СоставНормВыдачи КАК ВТ_СоставНормВыдачи)
	|	И НАЧАЛОПЕРИОДА(ВТ_ПотребностьВыдачи.ДатаПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ПЕриод, МЕСЯЦ)
	|	И (НЕ ВТ_ТаблицаДокумента.ДатаВыдачи ЕСТЬ NULL
	|			ИЛИ НЕ ВТ_ТаблицаДокумента1.ДатаВыдачи ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Подразделение,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.ЭтоЗима,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьДляИзменения.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВТ_ПотребностьВыдачи.ДатаПотребности
	|		ИНАЧЕ ВТ_ПотребностьДляИзменения.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_ПотребностьДляИзменения.КоличествоОстаток ЕСТЬ NULL
	|				ТОГДА ВТ_ПотребностьВыдачи.КоличествоОстаток
	|			ИНАЧЕ ВТ_ПотребностьДляИзменения.КоличествоОстаток
	|		КОНЕЦ) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи КАК ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьДляИзменения КАК ВТ_ПотребностьДляИзменения
	|		ПО ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник = ВТ_ПотребностьДляИзменения.Сотрудник
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи = ВТ_ПотребностьДляИзменения.НормаВыдачи
	|			И ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы = ВТ_ПотребностьДляИзменения.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Сотрудник,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.Подразделение,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.ЭтоЗима,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НормаВыдачи,
	|	ВТ_ПодобранныеНормыСОтборомПоВидуВыдачи.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьДляИзменения.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВТ_ПотребностьВыдачи.ДатаПотребности
	|		ИНАЧЕ ВТ_ПотребностьДляИзменения.ДатаПотребности
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	СУММА(ВТ_Результат.КоличествоПотребность) КАК КоличествоПотребность,
	|	СУММА(0) КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("МассивНоменклатураНормы",			ТаблицаДокумента.ВыгрузитьКолонку("НоменклатураНормы"));
	Запрос.УстановитьПараметр("ТаблицаДокумента",					ТаблицаДокумента);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[7].Выгрузить();
	ТаблицаПодразделений 	= Результат[8].Выгрузить();
	ТаблицаДатПотребности 	= Результат[9].Выгрузить();
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаНачала,ДатаОкончания,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуОтсутствияНаРабочемМесте(СтруктураОтбора) Экспорт
	
	Организация 							= СтруктураОтбора.Организация;
	ДатаАнализа 							= СтруктураОтбора.ДатаАнализа;
	ДатаНачала 								= СтруктураОтбора.ДатаНачала;
	ДатаОкончания 							= СтруктураОтбора.ДатаОкончания;
	МассивСотрудников 						= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам 		= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтсутствиеНаРабочемМестеСрезПоследних.Сотрудник КАК Сотрудник,
	|	ДОБАВИТЬКДАТЕ(ОтсутствиеНаРабочемМестеСрезПоследних.ДатаОкончания, ДЕНЬ, 1) КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_ОтсутствиеНаРабочемМесте
	|ИЗ
	|	РегистрСведений.ОтсутствиеНаРабочемМесте.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ОтсутствиеНаРабочемМестеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|	КОНЕЦ КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтсутствиеНаРабочемМесте КАК ВТ_ОтсутствиеНаРабочемМесте
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОтсутствиеНаРабочемМесте.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ОтсутствиеНаРабочемМесте.ДатаПотребности ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|					ИНАЧЕ ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 1)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано,
	|	ВТ_Результат.ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ДатаНачала",							ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",						ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[4].Выгрузить();
	ТаблицаПодразделений 	= Результат[5].Выгрузить();
	ТаблицаДатПотребности 	= Результат[6].Выгрузить();
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуПриемаНаРаботу(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.Должность КАК Должность,
	|	ТаблицаДокумента.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановленныеНормыВыдачиСИЗСрезПоследних.Должность КАК Должность,
	|	УстановленныеНормыВыдачиСИЗСрезПоследних.УсловиеНормы КАК УсловиеНормы
	|ПОМЕСТИТЬ ВТ_УстановленныеНормы
	|ИЗ
	|	РегистрСведений.УстановленныеНормыВыдачиСИЗ.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (Подразделение В (&МассивПодразделений)
	|					ИЛИ Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|				И Должность В (&МассивДолжностей)
	|				И (РабочееМесто В (&МассивРабочихМест)
	|					ИЛИ РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка))) КАК УстановленныеНормыВыдачиСИЗСрезПоследних
	|ГДЕ
	|	УстановленныеНормыВыдачиСИЗСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаДокумента.Должность КАК Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто КАК РабочееМесто,
	|	ВТ_УстановленныеНормы.УсловиеНормы КАК Условие,
	|	ВЫБОР
	|		КОГДА ВТ_УстановленныеНормы.УсловиеНормы.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ЗимойДополнительно)
	|				ИЛИ ВТ_УстановленныеНормы.УсловиеНормы.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ПриУсловииЗимойДополнительно)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗима
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УстановленныеНормы КАК ВТ_УстановленныеНормы
	|		ПО ВТ_ТаблицаДокумента.Должность = ВТ_УстановленныеНормы.Должность
	|ГДЕ
	|	НЕ ВТ_УстановленныеНормы.УсловиеНормы ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаДокумента);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("МассивПодразделений",ТаблицаДокумента.ВыгрузитьКолонку("Подразделение"));
	Запрос.УстановитьПараметр("МассивДолжностей",	ТаблицаДокумента.ВыгрузитьКолонку("Должность"));
	Запрос.УстановитьПараметр("МассивРабочихМест",	ТаблицаДокумента.ВыгрузитьКолонку("РабочееМесто"));
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаЗапроса,ТаблицаЗанятыхРМ);
	
	ТаблицаЗанятыхРМ.Свернуть("Сотрудник, Подразделение, Должность, РабочееМесто, Условие, ЭтоЗима");
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы,
	|	ПодобранныеНормы.КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА &Период
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуУвольнения(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Должность,
	|	ТаблицаДокумента.РабочееМесто,
	|	ТаблицаДокумента.ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто,
	|	ТаблицаЗанятыхРабочихМест.Условие,
	|	ТаблицаЗанятыхРабочихМест.КоличествоСтавок,
	|	ТаблицаЗанятыхРабочихМест.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятыеРабочиеМеста.Сотрудник,
	|	ЗанятыеРабочиеМеста.Подразделение,
	|	ЗанятыеРабочиеМеста.Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто,
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавок, 0) КАК КоличествоСтавок,
	|	ЗанятыеРабочиеМеста.Условие,
	|	ЗанятыеРабочиеМеста.ЭтоЗима
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность КАК Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		СУММА(ВТ_ЗанятыеРабочиеМеста.КоличествоСтавок) КАК КоличествоСтавок,
	|		ВТ_ЗанятыеРабочиеМеста.Условие КАК Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима КАК ЭтоЗима
	|	ИЗ
	|		ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто,
	|		ВТ_ЗанятыеРабочиеМеста.Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима) КАК ЗанятыеРабочиеМеста
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|			ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|			ВТ_ТаблицаДокумента.Должность КАК Должность,
	|			ВТ_ТаблицаДокумента.РабочееМесто КАК РабочееМесто,
	|			СУММА(ВТ_ТаблицаДокумента.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок
	|		ИЗ
	|			ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ТаблицаДокумента.Сотрудник,
	|			ВТ_ТаблицаДокумента.Подразделение,
	|			ВТ_ТаблицаДокумента.Должность,
	|			ВТ_ТаблицаДокумента.РабочееМесто) КАК ТаблицаДокумента
	|		ПО ЗанятыеРабочиеМеста.Сотрудник = ТаблицаДокумента.Сотрудник
	|			И ЗанятыеРабочиеМеста.Подразделение = ТаблицаДокумента.Подразделение
	|			И ЗанятыеРабочиеМеста.Должность = ТаблицаДокумента.Должность
	|			И ЗанятыеРабочиеМеста.РабочееМесто = ТаблицаДокумента.РабочееМесто
	|ГДЕ
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавок, 0) > 0";
	
	Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(Запрос.Выполнить().Выгрузить(),ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуКадровогоПеремещения(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.ПодразделениеСтарое,
	|	ТаблицаДокумента.ДолжностьСтарая,
	|	ТаблицаДокумента.РабочееМестоСтарое,
	|	ТаблицаДокумента.ЗанимаемыхСтавокСтарое,
	|	ТаблицаДокумента.ПодразделениеНовое,
	|	ТаблицаДокумента.ДолжностьНовая,
	|	ТаблицаДокумента.РабочееМестоНовое
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто,
	|	ТаблицаЗанятыхРабочихМест.Условие,
	|	ТаблицаЗанятыхРабочихМест.КоличествоСтавок,
	|	ТаблицаЗанятыхРабочихМест.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыеРабочиеМеста.Сотрудник,
	|	ЗанятыеРабочиеМеста.Подразделение,
	|	ЗанятыеРабочиеМеста.Должность,
	|	ЗанятыеРабочиеМеста.РабочееМесто,
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавокСтарое, 0) КАК КоличествоСтавок,
	|	ЗанятыеРабочиеМеста.Условие,
	|	ЗанятыеРабочиеМеста.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ТаблицаУвольнения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник КАК Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность КАК Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		СУММА(ВТ_ЗанятыеРабочиеМеста.КоличествоСтавок) КАК КоличествоСтавок,
	|		ВТ_ЗанятыеРабочиеМеста.Условие КАК Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима КАК ЭтоЗима
	|	ИЗ
	|		ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ЗанятыеРабочиеМеста.Сотрудник,
	|		ВТ_ЗанятыеРабочиеМеста.Подразделение,
	|		ВТ_ЗанятыеРабочиеМеста.Должность,
	|		ВТ_ЗанятыеРабочиеМеста.РабочееМесто,
	|		ВТ_ЗанятыеРабочиеМеста.Условие,
	|		ВТ_ЗанятыеРабочиеМеста.ЭтоЗима) КАК ЗанятыеРабочиеМеста
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|			ВТ_ТаблицаДокумента.ПодразделениеСтарое КАК ПодразделениеСтарое,
	|			ВТ_ТаблицаДокумента.ДолжностьСтарая КАК ДолжностьСтарая,
	|			ВТ_ТаблицаДокумента.РабочееМестоСтарое КАК РабочееМестоСтарое,
	|			СУММА(ВТ_ТаблицаДокумента.ЗанимаемыхСтавокСтарое) КАК ЗанимаемыхСтавокСтарое
	|		ИЗ
	|			ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ТаблицаДокумента.Сотрудник,
	|			ВТ_ТаблицаДокумента.ПодразделениеСтарое,
	|			ВТ_ТаблицаДокумента.ДолжностьСтарая,
	|			ВТ_ТаблицаДокумента.РабочееМестоСтарое) КАК ТаблицаДокумента
	|		ПО ЗанятыеРабочиеМеста.Сотрудник = ТаблицаДокумента.Сотрудник
	|			И ЗанятыеРабочиеМеста.Подразделение = ТаблицаДокумента.ПодразделениеСтарое
	|			И ЗанятыеРабочиеМеста.Должность = ТаблицаДокумента.ДолжностьСтарая
	|			И ЗанятыеРабочиеМеста.РабочееМесто = ТаблицаДокумента.РабочееМестоСтарое
	|ГДЕ
	|	ЗанятыеРабочиеМеста.КоличествоСтавок - ЕСТЬNULL(ТаблицаДокумента.ЗанимаемыхСтавокСтарое, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.ПодразделениеНовое КАК Подразделение,
	|	ВТ_ТаблицаДокумента.ДолжностьНовая КАК Должность,
	|	ВТ_ТаблицаДокумента.РабочееМестоНовое КАК РабочееМесто
	|ПОМЕСТИТЬ ВТ_ТаблицаПриема
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаУвольнения.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаУвольнения.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаУвольнения.Должность КАК Должность,
	|	ВТ_ТаблицаУвольнения.РабочееМесто КАК РабочееМесто,
	|	ВТ_ТаблицаУвольнения.Условие,
	|	ВТ_ТаблицаУвольнения.ЭтоЗима
	|ИЗ
	|	ВТ_ТаблицаУвольнения КАК ВТ_ТаблицаУвольнения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПриема.Сотрудник,
	|	ВТ_ТаблицаПриема.Подразделение,
	|	ВТ_ТаблицаПриема.Должность,
	|	ВТ_ТаблицаПриема.РабочееМесто,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ТаблицаПриема КАК ВТ_ТаблицаПриема
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто";
	
	Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗапроса.ВыгрузитьКолонку("Подразделение"),ТаблицаЗапроса.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗапроса,ТаблицаУстановленныхНорм,Организация,ДатаАнализа); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ПотребностьВыдачи.ДатаПотребности, &Период) КАК ДатаПотребности,
	|	ЕСТЬNULL(ВТ_ПотребностьВыдачи.КоличествоОстаток, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде) КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ПодобранныеНормы.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуУстановкиУсловийРаботыСотрудника(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Должность,
	|	ТаблицаДокумента.РабочееМесто,
	|	ТаблицаДокумента.Условие,
	|	ТаблицаДокумента.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхРабочихМест.Сотрудник,
	|	ТаблицаЗанятыхРабочихМест.Подразделение,
	|	ТаблицаЗанятыхРабочихМест.Должность,
	|	ТаблицаЗанятыхРабочихМест.РабочееМесто,
	|	ТаблицаЗанятыхРабочихМест.Условие,
	|	ТаблицаЗанятыхРабочихМест.ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	&ТаблицаЗанятыхРабочихМест КАК ТаблицаЗанятыхРабочихМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто,
	|	ВТ_ТаблицаДокумента.Условие,
	|	ВТ_ТаблицаДокумента.Использовать,
	|	ВЫБОР
	|		КОГДА УсловияНорм.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ЗимойДополнительно)
	|				ИЛИ УсловияНорм.ТипУсловия = ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ПриУсловииЗимойДополнительно)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЗима
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСЗимой
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияНорм КАК УсловияНорм
	|		ПО ВТ_ТаблицаДокумента.Условие = УсловияНорм.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Сотрудник, ВТ_ЗанятыеРабочиеМеста.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Подразделение, ВТ_ЗанятыеРабочиеМеста.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Должность, ВТ_ЗанятыеРабочиеМеста.Должность) КАК Должность,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.РабочееМесто, ВТ_ЗанятыеРабочиеМеста.РабочееМесто) КАК РабочееМесто,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.Условие, ВТ_ЗанятыеРабочиеМеста.Условие) КАК Условие,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаСЗимой.ЭтоЗима, ВТ_ЗанятыеРабочиеМеста.ЭтоЗима) КАК ЭтоЗима,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокументаСЗимой.Сотрудник ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВТ_ТаблицаДокументаСЗимой.Использовать
	|	КОНЕЦ КАК Использовать
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ТаблицаДокументаСЗимой КАК ВТ_ТаблицаДокументаСЗимой
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|		ПО ВТ_ТаблицаДокументаСЗимой.Сотрудник = ВТ_ЗанятыеРабочиеМеста.Сотрудник
	|			И ВТ_ТаблицаДокументаСЗимой.Подразделение = ВТ_ЗанятыеРабочиеМеста.Подразделение
	|			И ВТ_ТаблицаДокументаСЗимой.Должность = ВТ_ЗанятыеРабочиеМеста.Должность
	|			И ВТ_ТаблицаДокументаСЗимой.РабочееМесто = ВТ_ЗанятыеРабочиеМеста.РабочееМесто
	|			И ВТ_ТаблицаДокументаСЗимой.Условие = ВТ_ЗанятыеРабочиеМеста.Условие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.Должность КАК Должность,
	|	ВТ_Результат.РабочееМесто КАК РабочееМесто,
	|	ВТ_Результат.Условие КАК Условие,
	|	ВТ_Результат.ЭтоЗима
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	РабочееМесто,
	|	Условие";
	
	Запрос.УстановитьПараметр("ТаблицаЗанятыхРабочихМест",	ТаблицаЗанятыхРМ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(Запрос.Выполнить().Выгрузить(),ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы,
	|	ПодобранныеНормы.КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА &Период
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуУстановкиПериодаЗимы(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента						= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	МАКСИМУМ(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ВыданныеСИЗ.КоличествоОстаток КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_НормыСВыдачей
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ВыданныеСИЗ.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	ВТ_НормыСВыдачей.Сотрудник,
	//|	ВТ_НормыСВыдачей.Подразделение,
	//|	ВТ_НормыСВыдачей.ЭтоЗима,
	//|	ВТ_НормыСВыдачей.НормаВыдачи,
	//|	ВТ_НормыСВыдачей.НоменклатураНормы,
	//|	ВТ_НормыСВыдачей.КоличествоВыдано,
	|	ЕстьNULL(ВТ_НормыСВыдачей.Сотрудник,ВТ_ПотребностьВыдачи.Сотрудник) КАК Сотрудник,
	|	ЕстьNULL(ВТ_НормыСВыдачей.Подразделение,ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕстьNULL(ВТ_НормыСВыдачей.ЭтоЗима,Ложь) КАк ЭтоЗима,
	|	ЕстьNULL(ВТ_НормыСВыдачей.НормаВыдачи,ВТ_ПотребностьВыдачи.НормаВыдачи) КАК НормаВыдачи,
	|	ЕстьNULL(ВТ_НормыСВыдачей.НоменклатураНормы,ВТ_ПотребностьВыдачи.НоменклатураНормы) КАК НоменклатураНормы,
	|	ЕстьNULL(ВТ_НормыСВыдачей.КоличествоВыдано,0) КАК КоличествоВыдано,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_НормыСВыдачей КАК ВТ_НормыСВыдачей
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_НормыСВыдачей.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_НормыСВыдачей.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_НормыСВыдачей.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	ВТ_Результат.КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[5].Выгрузить();
	ТаблицаПодразделений 	= Результат[6].Выгрузить();
	ТаблицаДатПотребности 	= Результат[7].Выгрузить();
	
	МассивПодразделений = ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение");
	МассивДат 			= ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности");
	
	//формирование таблицы зимы с учетом данных документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПериодыЗимыСрезПоследних.Подразделение,
	|	ПериодыЗимыСрезПоследних.НачалоЗимы,
	|	ПериодыЗимыСрезПоследних.КонецЗимы
	|ПОМЕСТИТЬ ВТ_ПериодыЗимы
	|ИЗ
	|	РегистрСведений.ПериодыЗимы.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ПериодыЗимыСрезПоследних
	|ГДЕ
	|	ПериодыЗимыСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.НачалоЗимы,
	|	ТаблицаДокумента.КонецЗимы,
	|	ТаблицаДокумента.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ВТ_ПериодыЗимы.Подразделение
	|		ИНАЧЕ ВТ_ТаблицаДокумента.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ВТ_ПериодыЗимы.НачалоЗимы
	|		ИНАЧЕ ВТ_ТаблицаДокумента.НачалоЗимы
	|	КОНЕЦ КАК НачалоЗимы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ВТ_ПериодыЗимы.КонецЗимы
	|		ИНАЧЕ ВТ_ТаблицаДокумента.КонецЗимы
	|	КОНЕЦ КАК КонецЗимы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.Подразделение ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВТ_ТаблицаДокумента.Использовать
	|	КОНЕЦ КАК Использовать
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблицаЗимы
	|ИЗ
	|	ВТ_ПериодыЗимы КАК ВТ_ПериодыЗимы
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО ВТ_ПериодыЗимы.Подразделение = ВТ_ТаблицаДокумента.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение,
	|	ВТ_ИтоговаяТаблицаЗимы.НачалоЗимы КАК НачалоЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.КонецЗимы КАК КонецЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.Использовать
	|ИЗ
	|	ВТ_ИтоговаяТаблицаЗимы КАК ВТ_ИтоговаяТаблицаЗимы
	|ГДЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение В(&МассивПодразделений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение,
	|	ВТ_ИтоговаяТаблицаЗимы.НачалоЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.КонецЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.Использовать
	|ИЗ
	|	ВТ_ИтоговаяТаблицаЗимы КАК ВТ_ИтоговаяТаблицаЗимы
	|ГДЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблицаЗимы.Подразделение,
	|	ВТ_ИтоговаяТаблицаЗимы.НачалоЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.КонецЗимы,
	|	ВТ_ИтоговаяТаблицаЗимы.Использовать
	|ИЗ
	|	ВТ_ИтоговаяТаблицаЗимы КАК ВТ_ИтоговаяТаблицаЗимы
	|ГДЕ
	|	НЕ ВТ_ИтоговаяТаблицаЗимы.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_ИтоговаяТаблицаЗимы.Подразделение В (&МассивПодразделений)";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаДокумента);
	Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	
	Результат 						= Запрос.ВыполнитьПакет();
	ТаблицаПоПодразделениям 		= Результат[3].Выгрузить();
	ТаблицаПоПустымПодразделениям 	= Результат[4].Выгрузить();
	ТаблицаПоДругимПодразделениям 	= Результат[5].Выгрузить();
	
	Для Каждого ЭлементМассиваПодразделений Из МассивПодразделений Цикл
		
		НайденнаяСтрока = ТаблицаПоПодразделениям.Найти(ЭлементМассиваПодразделений,"Подразделение");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			ДанныеНайденыВИерархии = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимыРекурсивно(ЭлементМассиваПодразделений,ЭлементМассиваПодразделений.Родитель,ТаблицаПоПодразделениям,ТаблицаПоДругимПодразделениям);
			
			Если НЕ ДанныеНайденыВИерархии Тогда
				
				Если ТаблицаПоПустымПодразделениям.Количество() > 0 Тогда
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТаблицаПоПустымПодразделениям[0]);
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					
				Иначе
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					НоваяСтрока.НачалоЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					НоваяСтрока.КонецЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					НоваяСтрока.Использовать	= Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаЗимы = Новый ТаблицаЗначений;
	ТаблицаЗимы.Колонки.Добавить("ДатаПериода",			Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЗимы.Колонки.Добавить("Подразделение",		Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаЗимы.Колонки.Добавить("ДатаНачалаЗимы",		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЗимы.Колонки.Добавить("ДатаОкончанияЗимы",	Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЗимы.Колонки.Добавить("Использовать",		Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТаблицыПоПодразделениям Из ТаблицаПоПодразделениям Цикл
		
		Для Каждого ЭлементМассиваДат Из МассивДат Цикл
			
			НоваяСтрока = ТаблицаЗимы.Добавить();
			НоваяСтрока.ДатаПериода 		= ЭлементМассиваДат;
			НоваяСтрока.Подразделение 		= СтрокаТаблицыПоПодразделениям.Подразделение;
			//!!!возможно, неверное определение периода зимы:
			//НоваяСтрока.ДатаНачалаЗимы 		= ПроцедурыРаботыСНормамиСервер.ПолучитьДатуНачалаМесяца(СтрокаТаблицыПоПодразделениям.НачалоЗимы,ЭлементМассиваДат);
			//НоваяСтрока.ДатаОкончанияЗимы 	= ПроцедурыРаботыСНормамиСервер.ПолучитьДатуКонцаМесяца(СтрокаТаблицыПоПодразделениям.КонецЗимы,ЭлементМассиваДат);
			//!!!возможно, должно быть так:
			СтруктураПериодаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимы(ЭлементМассиваДат,СтрокаТаблицыПоПодразделениям.НачалоЗимы,СтрокаТаблицыПоПодразделениям.КонецЗимы);
			Если СтрокаТаблицыПоПодразделениям.Использовать Тогда
				НоваяСтрока.ДатаНачалаЗимы 		= СтруктураПериодаЗимы.НачалоЗимы;
				НоваяСтрока.ДатаОкончанияЗимы 	= СтруктураПериодаЗимы.КонецЗимы;
			Иначе
				НоваяСтрока.ДатаНачалаЗимы 		= Дата('00010101');
				НоваяСтрока.ДатаОкончанияЗимы 	= Дата('00010101');
			КонецЕсли;
			НоваяСтрока.Использовать 		= СтрокаТаблицыПоПодразделениям.Использовать;
			//!!!
			
		КонецЦикла;
		
	КонецЦикла;
	
	УточнитьПотребностьПоУстановкеПериодаЗимы(ТаблицаЗапроса,ТаблицаЗимы,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуПриказПоНормамВыдачиСИЗ(СтруктураОтбора) Экспорт
	
	Организация 							= СтруктураОтбора.Организация;
	ДатаАнализа 							= СтруктураОтбора.ДатаАнализа;
	ДатаДокумента							= СтруктураОтбора.ДатаДокумента;
	ТаблицаДокумента 						= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 						= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам 		= МассивСотрудников.Количество() = 0;
	ДвиженияПоДоступнымУсловиямРаботы		= СтруктураОтбора.ДвиженияПоДоступнымУсловиямРаботы;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа,ТаблицаДокумента,ДвиженияПоДоступнымУсловиямРаботы);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаУстановленныхНорм.Подразделение,
	|	ТаблицаУстановленныхНорм.Должность,
	|	ТаблицаУстановленныхНорм.РабочееМесто,
	|	ТаблицаУстановленныхНорм.УсловиеНормы,
	|	ТаблицаУстановленныхНорм.НормаВыдачи,
	|	ТаблицаУстановленныхНорм.НоменклатураНормы,
	|	ТаблицаУстановленныхНорм.ТипПериода,
	|	ТаблицаУстановленныхНорм.КоличествоПериодов,
	|	ТаблицаУстановленныхНорм.КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_УстановленныеНормы
	|ИЗ
	|	&ТаблицаУстановленныхНорм КАК ТаблицаУстановленныхНорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Должность,
	|	ТаблицаДокумента.РабочееМесто,
	|	ТаблицаДокумента.УсловиеНормы,
	|	ТаблицаДокумента.НормаВыдачи,
	|	ТаблицаДокумента.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто,
	|	ВТ_ТаблицаДокумента.УсловиеНормы,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.Использовать,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаССоставом
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НормыВыдачиСИЗСоставНормы.Ссылка.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаНорм.Период)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НормыВыдачиСИЗСоставНормы.УчитыватьВПотребности
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.Подразделение, ВТ_УстановленныеНормы.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.Должность, ВТ_УстановленныеНормы.Должность) КАК Должность,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.РабочееМесто, ВТ_УстановленныеНормы.РабочееМесто) КАК РабочееМесто,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.УсловиеНормы, ВТ_УстановленныеНормы.УсловиеНормы) КАК Условие,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.НормаВыдачи, ВТ_УстановленныеНормы.НормаВыдачи) КАК НормаВыдачи,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.НоменклатураНормы, ВТ_УстановленныеНормы.НоменклатураНормы) КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.ТипПериода, ВТ_УстановленныеНормы.ТипПериода) КАК ТипПериода,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.КоличествоПериодов, ВТ_УстановленныеНормы.КоличествоПериодов) КАК КоличествоПериодов,
	|	ЕСТЬNULL(ВТ_ТаблицаДокументаССоставом.КоличествоВПериоде, ВТ_УстановленныеНормы.КоличествоВПериоде) КАК КоличествоВПериоде,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокументаССоставом.НормаВыдачи ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВТ_ТаблицаДокументаССоставом.Использовать
	|	КОНЕЦ КАК Использовать
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ТаблицаДокументаССоставом КАК ВТ_ТаблицаДокументаССоставом
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_УстановленныеНормы КАК ВТ_УстановленныеНормы
	|		ПО ВТ_ТаблицаДокументаССоставом.Подразделение = ВТ_УстановленныеНормы.Подразделение
	|			И ВТ_ТаблицаДокументаССоставом.Должность = ВТ_УстановленныеНормы.Должность
	|			И ВТ_ТаблицаДокументаССоставом.РабочееМесто = ВТ_УстановленныеНормы.РабочееМесто
	|			И ВТ_ТаблицаДокументаССоставом.УсловиеНормы = ВТ_УстановленныеНормы.УсловиеНормы
	|			И ВТ_ТаблицаДокументаССоставом.НормаВыдачи = ВТ_УстановленныеНормы.НормаВыдачи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение,
	|	Должность,
	|	РабочееМесто,
	|	Условие,
	|	НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.Должность КАК Должность,
	|	ВТ_Результат.РабочееМесто КАК РабочееМесто,
	|	ВТ_Результат.Условие КАК УсловиеНормы,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ТипПериода,
	|	ВТ_Результат.КоличествоПериодов,
	|	ВТ_Результат.КоличествоВПериоде,
	|	ВТ_Результат.Использовать
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Должность,
	|	РабочееМесто,
	|	УсловиеНормы,
	|	НормаВыдачи";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	Запрос.УстановитьПараметр("ТаблицаУстановленныхНорм",	ТаблицаУстановленныхНорм);
	
	ТаблицаСНормами = ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,Запрос.Выполнить().Выгрузить(),Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы,
	|	ПодобранныеНормы.КоличествоВПериоде,
	|	ПодобранныеНормы.Использовать
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.Сотрудник, ВТ_ПотребностьВыдачи.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.ЭтоЗима, ЛОЖЬ) КАК ЭтоЗима,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.НормаВыдачи, ВТ_ПотребностьВыдачи.НормаВыдачи) КАК НормаВыдачи,
	|	ЕСТЬNULL(ВТ_ПодобранныеНормы.НоменклатураНормы, ВТ_ПотребностьВыдачи.НоменклатураНормы) КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА &Период
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПодобранныеНормы.КоличествоВПериоде
	|		ИНАЧЕ ВТ_ПотребностьВыдачи.КоличествоОстаток
	|	КОНЕЦ КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_ПодобранныеНормы.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	ВТ_ПодобранныеНормы.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	0 КАК КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Период",								ДатаДокумента);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[3].Выгрузить();
	ТаблицаПодразделений 	= Результат[4].Выгрузить();
	
	СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента);
	
	ТаблицаДатПотребности = ТаблицаЗапроса.Скопировать(,"ДатаПотребности");
	ТаблицаДатПотребности.Свернуть("ДатаПотребности");
	
	ТаблицаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗимы(ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение"),Организация,ДатаАнализа,ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности"));
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоЗиме(ТаблицаЗапроса,ТаблицаЗимы);
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// функция возвращает таблицу конечной потребности вида
// | Сотрудник | Норма выдачи | Номенклатура нормы | Дата потребности | Дата начала зимы | Дата окончания зимы | Количество по потребности | Это зима |
// 
// параметры:
// СтруктураОтбора - Структура(Организация,ДатаАнализа,ДатаДокумента,ТаблицаДокумента,МассивСотрудников)
//
Функция ПолучитьКонечнуюПотребностьПоДокументуПереносаЗимнейПотребности(СтруктураОтбора) Экспорт
	
	Организация 						= СтруктураОтбора.Организация;
	ДатаАнализа 						= СтруктураОтбора.ДатаАнализа;
	ТаблицаДокумента 					= СтруктураОтбора.ТаблицаДокумента;
	МассивСотрудников 					= СтруктураОтбора.МассивСотрудников;
	НеИспользоватьФильтрПоСотрудникам	= МассивСотрудников.Количество() = 0;
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодобранныеНормы.Сотрудник,
	|	ПодобранныеНормы.Подразделение,
	|	ПодобранныеНормы.ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	МАКСИМУМ(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ПотребностьВыдачи
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И (&НеИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&МассивСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодобранныеНормы.Сотрудник,
	|	ВТ_ПодобранныеНормы.Подразделение,
	|	ВТ_ПодобранныеНормы.ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ВыданныеСИЗ.КоличествоОстаток КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_НормыСВыдачей
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_ПодобранныеНормы.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_ПодобранныеНормы.НормаВыдачи = ВТ_ВыданныеСИЗ.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	ВТ_НормыСВыдачей.Сотрудник,
	//|	ВТ_НормыСВыдачей.Подразделение,
	//|	ВТ_НормыСВыдачей.ЭтоЗима,
	//|	ВТ_НормыСВыдачей.НормаВыдачи,
	//|	ВТ_НормыСВыдачей.НоменклатураНормы,
	//|	ВТ_НормыСВыдачей.КоличествоВыдано,
	|	ЕстьNULL(ВТ_НормыСВыдачей.Сотрудник,ВТ_ПотребностьВыдачи.Сотрудник) КАК Сотрудник,
	|	ЕстьNULL(ВТ_НормыСВыдачей.Подразделение,ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕстьNULL(ВТ_НормыСВыдачей.ЭтоЗима,Ложь) КАк ЭтоЗима,
	|	ЕстьNULL(ВТ_НормыСВыдачей.НормаВыдачи,ВТ_ПотребностьВыдачи.НормаВыдачи) КАК НормаВыдачи,
	|	ЕстьNULL(ВТ_НормыСВыдачей.НоменклатураНормы,ВТ_ПотребностьВыдачи.НоменклатураНормы) КАК НоменклатураНормы,
	|	ЕстьNULL(ВТ_НормыСВыдачей.КоличествоВыдано,0) КАК КоличествоВыдано,
	|	ВТ_ПотребностьВыдачи.ДатаПотребности,
	|	ВТ_ПотребностьВыдачи.КоличествоОстаток КАК КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_НормыСВыдачей КАК ВТ_НормыСВыдачей
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПотребностьВыдачи КАК ВТ_ПотребностьВыдачи
	|		ПО ВТ_НормыСВыдачей.Сотрудник = ВТ_ПотребностьВыдачи.Сотрудник
	|			И ВТ_НормыСВыдачей.НормаВыдачи = ВТ_ПотребностьВыдачи.НормаВыдачи
	|			И ВТ_НормыСВыдачей.НоменклатураНормы = ВТ_ПотребностьВыдачи.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ПотребностьВыдачи.ДатаПотребности ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.Подразделение,
	|	ВТ_Результат.ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы,
	|	ВТ_Результат.ДатаПотребности,
	|	ВТ_Результат.КоличествоПотребность,
	|	ВТ_Результат.КоличествоВыдано
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.Подразделение
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Результат.ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.ДатаПотребности ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ПериодРасчета",						ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",					МассивСотрудников);
	Запрос.УстановитьПараметр("НеИспользоватьФильтрПоСотрудникам",	НеИспользоватьФильтрПоСотрудникам);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапроса 			= Результат[5].Выгрузить();
	ТаблицаПодразделений 	= Результат[6].Выгрузить();
	ТаблицаДатПотребности 	= Результат[7].Выгрузить();
	
	МассивПодразделений = ТаблицаПодразделений.ВыгрузитьКолонку("Подразделение");
	МассивДат 			= ТаблицаДатПотребности.ВыгрузитьКолонку("ДатаПотребности");
	
	//формирование таблицы зимы с учетом данных документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.НачалоЗимы,
	|	ТаблицаДокумента.КонецЗимы,
	|	ТаблицаДокумента.НачальнаяДатаБудущейЗимы,
	|	ТаблицаДокумента.КонечнаяДатаБудущейЗимы
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.НачалоЗимы КАК НачалоЗимы,
	|	ВТ_ТаблицаДокумента.КонецЗимы КАК КонецЗимы,
	|	ВТ_ТаблицаДокумента.НачальнаяДатаБудущейЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаДокумента.КонечнаяДатаБудущейЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|ГДЕ
	|	ВТ_ТаблицаДокумента.Подразделение В(&МассивПодразделений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.НачалоЗимы,
	|	ВТ_ТаблицаДокумента.КонецЗимы,
	|	ВТ_ТаблицаДокумента.НачальнаяДатаБудущейЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаДокумента.КонечнаяДатаБудущейЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|ГДЕ
	|	ВТ_ТаблицаДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.НачалоЗимы,
	|	ВТ_ТаблицаДокумента.КонецЗимы,
	|	ВТ_ТаблицаДокумента.НачальнаяДатаБудущейЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаДокумента.КонечнаяДатаБудущейЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|ГДЕ
	|	НЕ ВТ_ТаблицаДокумента.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаДокумента.Подразделение В (&МассивПодразделений)";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаДокумента);
	Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	
	Результат 						= Запрос.ВыполнитьПакет();
	ТаблицаПоПодразделениям 		= Результат[1].Выгрузить();
	ТаблицаПоПустымПодразделениям 	= Результат[2].Выгрузить();
	ТаблицаПоДругимПодразделениям 	= Результат[3].Выгрузить();
	
	Для Каждого ЭлементМассиваПодразделений Из МассивПодразделений Цикл
		
		НайденнаяСтрока = ТаблицаПоПодразделениям.Найти(ЭлементМассиваПодразделений,"Подразделение");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			ДанныеНайденыВИерархии = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимыРекурсивно(ЭлементМассиваПодразделений,ЭлементМассиваПодразделений.Родитель,ТаблицаПоПодразделениям,ТаблицаПоДругимПодразделениям);
			
			Если НЕ ДанныеНайденыВИерархии Тогда
				
				Если ТаблицаПоПустымПодразделениям.Количество() > 0 Тогда
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТаблицаПоПустымПодразделениям[0]);
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					
				Иначе
					
					НоваяСтрока 				= ТаблицаПоПодразделениям.Добавить();
					НоваяСтрока.Подразделение 	= ЭлементМассиваПодразделений;
					НоваяСтрока.НачалоЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					НоваяСтрока.КонецЗимы 		= Перечисления.МесяцыГода.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.ДатаНачалаЗимы,
	|	ТаблицаЗимы.ДатаОкончанияЗимы,
	|	ТаблицаЗимы.Подразделение
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник,
	|	ТаблицаПотребности.Подразделение,
	|	ТаблицаПотребности.НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы,
	|	ТаблицаПотребности.ДатаПотребности,
	|	ТаблицаПотребности.ЭтоЗима,
	|	ТаблицаПотребности.КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|				И НЕ ВТ_ТаблицаЗимы.ДатаНачалаЗимы = ДАТАВРЕМЯ(1, 1, 1)
	|				И ВТ_ТаблицаПотребности.ДатаПотребности < ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|			ТОГДА ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|		ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ТаблицаПотребности.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",		ТаблицаПоПодразделениям);
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УточнитьПотребностьПоУстановкеПериодаЗимы(ТаблицаЗапроса,ТаблицаЗимы,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.ДатаНачалаЗимы,
	|	ТаблицаЗимы.ДатаОкончанияЗимы,
	|	ТаблицаЗимы.ДатаПериода,
	|	ТаблицаЗимы.Подразделение,
	|	ТаблицаЗимы.Использовать
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник,
	|	ТаблицаПотребности.Подразделение,
	|	ТаблицаПотребности.НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы,
	|	ТаблицаПотребности.ДатаПотребности,
	|	ТаблицаПотребности.ЭтоЗима,
	|	ТаблицаПотребности.КоличествоПотребность
	|ПОМЕСТИТЬ ВТ_ТаблицаПотребности
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ДатаАнализа,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыданныеСИЗ.Сотрудник,
	|	ВТ_ВыданныеСИЗ.НормаВыдачи,
	|	ВТ_ВыданныеСИЗ.НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ВыданныеСИЗ.ДатаВыдачи) КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаВыдачи
	|ИЗ
	|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыданныеСИЗ.Сотрудник,
	|	ВТ_ВыданныеСИЗ.НормаВыдачи,
	|	ВТ_ВыданныеСИЗ.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыданныеСИЗ.Сотрудник,
	|	ВТ_ВыданныеСИЗ.НормаВыдачи,
	|	ВТ_ВыданныеСИЗ.НоменклатураНормы,
	|	ВТ_ВыданныеСИЗ.ДатаВыдачи,
	|	ВТ_ВыданныеСИЗ.КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыдачаПоМаксимальнойДате
	|ИЗ
	|	ВТ_МаксимальнаяДатаВыдачи КАК ВТ_МаксимальнаяДатаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ПО ВТ_МаксимальнаяДатаВыдачи.Сотрудник = ВТ_ВыданныеСИЗ.Сотрудник
	|			И ВТ_МаксимальнаяДатаВыдачи.НормаВыдачи = ВТ_ВыданныеСИЗ.НормаВыдачи
	|			И ВТ_МаксимальнаяДатаВыдачи.НоменклатураНормы = ВТ_ВыданныеСИЗ.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоМаксимальнойДате.Сотрудник,
	|	ВТ_ВыдачаПоМаксимальнойДате.НормаВыдачи,
	|	ВТ_ВыдачаПоМаксимальнойДате.НоменклатураНормы,
	|	ВТ_ВыдачаПоМаксимальнойДате.ДатаВыдачи,
	|	ВТ_ВыдачаПоМаксимальнойДате.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_СоставНормы.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ВыдачаПоМаксимальнойДате.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.КоличествоПериодов * 12 * ВТ_ВыдачаПоМаксимальнойДате.КоличествоОстаток / ВТ_СоставНормы.КоличествоВПериоде)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ВыдачаПоМаксимальнойДате.ДатаВыдачи, МЕСЯЦ, ВТ_СоставНормы.КоличествоПериодов * ВТ_ВыдачаПоМаксимальнойДате.КоличествоОстаток / ВТ_СоставНормы.КоличествоВПериоде)
	|	КОНЕЦ КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ВыдачаСПериодичностью
	|ИЗ
	|	ВТ_ВыдачаПоМаксимальнойДате КАК ВТ_ВыдачаПоМаксимальнойДате
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_ВыдачаПоМаксимальнойДате.НормаВыдачи = ВТ_СоставНормы.НормаВыдачи
	|			И ВТ_ВыдачаПоМаксимальнойДате.НоменклатураНормы = ВТ_СоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаЗимы.Использовать
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|						ТОГДА ВЫБОР
	|								КОГДА НАЧАЛОПЕРИОДА(ВТ_ТаблицаПотребности.ДатаПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ВТ_ТаблицаЗимы.ДатаНачалаЗимы, МЕСЯЦ)
	|									ТОГДА ВТ_ТаблицаЗимы.ДатаНачалаЗимы
	|								ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ТаблицаПотребности.ЭтоЗима
	|					ТОГДА ВЫБОР
	|							КОГДА НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ВТ_ВыдачаСПериодичностью.ДатаСледующейВыдачи, МЕСЯЦ)
	|								ТОГДА ВТ_ВыдачаСПериодичностью.ДатаСледующейВыдачи
	|							ИНАЧЕ &ДатаДокумента
	|						КОНЕЦ
	|				ИНАЧЕ ВТ_ТаблицаПотребности.ДатаПотребности
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаПотребности,
	|	ВТ_ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаЗимы.ДатаНачалаЗимы КАК ДатаНачалаЗимы,
	|	ВТ_ТаблицаЗимы.ДатаОкончанияЗимы КАК ДатаОкончанияЗимы
	|ИЗ
	|	ВТ_ТаблицаПотребности КАК ВТ_ТаблицаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ТаблицаПотребности.ДатаПотребности = ВТ_ТаблицаЗимы.ДатаПериода
	|			И ВТ_ТаблицаПотребности.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаСПериодичностью КАК ВТ_ВыдачаСПериодичностью
	|		ПО ВТ_ТаблицаПотребности.Сотрудник = ВТ_ВыдачаСПериодичностью.Сотрудник
	|			И ВТ_ТаблицаПотребности.НормаВыдачи = ВТ_ВыдачаСПериодичностью.НормаВыдачи
	|			И ВТ_ТаблицаПотребности.НоменклатураНормы = ВТ_ВыдачаСПериодичностью.НоменклатураНормы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",		ТаблицаЗимы);
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	Запрос.УстановитьПараметр("ДатаАнализа",		ДатаАнализа);
	Запрос.УстановитьПараметр("ДатаДокумента",		ДатаДокумента);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// процедура выполняет корректировку даты потребности для новой потребности, если сотруднику уже выданы СИЗ по новой потребности
//
Процедура СкорректироватьТаблицуКонечнойПотребности(ТаблицаЗапроса,Организация,ДатаАнализа,МассивСотрудников,ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПотребности.Сотрудник КАК Сотрудник,
	|	ТаблицаПотребности.Подразделение КАК Подразделение,
	|	ТаблицаПотребности.ЭтоЗима КАК ЭтоЗима,
	|	ТаблицаПотребности.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаПотребности.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаПотребности.КоличествоПотребность КАК КоличествоПотребность,
	|	ТаблицаПотребности.КоличествоВыдано КАК КоличествоВыдано,
	|	ТаблицаПотребности.ДатаПотребности КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_КонечнаяПотребность
	|ИЗ
	|	&ТаблицаПотребности КАК ТаблицаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ВыданныеСИЗ
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)
	|				И НЕ НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ИсходнаяПотребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник В (&МассивСотрудников)) КАК ПотребностьВыдачиСИЗОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоВПериоде КАК КоличествоВПериоде,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|ГДЕ
	|	НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыданныеСИЗ.Сотрудник КАК Сотрудник,
	|	ВТ_ВыданныеСИЗ.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_ВыданныеСИЗ.КоличествоОстаток) КАК КоличествоОстаток,
	|	МИНИМУМ(РАЗНОСТЬДАТ(ВТ_ВыданныеСИЗ.ДатаВыдачи, &ДатаДокумента, ДЕНЬ) / (ВЫБОР
	|			КОГДА ВТ_Периодичность.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|				ТОГДА 365
	|			ИНАЧЕ 30
	|		КОНЕЦ * ВТ_Периодичность.КоличествоПериодов)) КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_ВыдачаСИзносом
	|ИЗ
	|	ВТ_ВыданныеСИЗ КАК ВТ_ВыданныеСИЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_ВыданныеСИЗ.НормаВыдачи = ВТ_Периодичность.НормаВыдачи
	|			И ВТ_ВыданныеСИЗ.НоменклатураНормы = ВТ_Периодичность.НоменклатураНормы
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВТ_ВыданныеСИЗ.ДатаВыдачи, &ДатаДокумента, ДЕНЬ) / (ВЫБОР
	|			КОГДА ВТ_Периодичность.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|				ТОГДА 365
	|			ИНАЧЕ 30
	|		КОНЕЦ * ВТ_Периодичность.КоличествоПериодов) < 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыданныеСИЗ.Сотрудник,
	|	ВТ_ВыданныеСИЗ.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периодичность.НормаВыдачи КАК НормаВыдачи,
	|	СУММА(1) КАК КоличествоВСоставе
	|ПОМЕСТИТЬ ВТ_ГруппировкаПериодичностиПоНормеВыдачи
	|ИЗ
	|	ВТ_Периодичность КАК ВТ_Периодичность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Периодичность.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппировкаПериодичностиПоНормеВыдачи.НормаВыдачи КАК НормаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ГруппировкаПериодичностиПоНормеВыдачи.КоличествоВСоставе = 1
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ГруппаИЛИ
	|ПОМЕСТИТЬ ВТ_ОпределениеГруппыИЛИ
	|ИЗ
	|	ВТ_ГруппировкаПериодичностиПоНормеВыдачи КАК ВТ_ГруппировкаПериодичностиПоНормеВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонечнаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_КонечнаяПотребность.Подразделение КАК Подразделение,
	|	ВТ_КонечнаяПотребность.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_КонечнаяПотребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_КонечнаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_КонечнаяПотребность.КоличествоПотребность КАК КоличествоПотребность,
	|	ЕСТЬNULL(ВТ_ВыдачаСИзносом.КоличествоОстаток, 0) КАК КоличествоВыдано,
	|	ВТ_КонечнаяПотребность.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ОпределениеГруппыИЛИ.ГруппаИЛИ КАК ГруппаИЛИ,
	|	ВТ_Периодичность.Приоритет КАК Приоритет,
	|	ЕСТЬNULL(ВТ_ВыдачаСИзносом.ПроцентИзноса, 1) КАК ПроцентИзноса
	|ПОМЕСТИТЬ ВТ_КонечнаяПотребностьДляАнализа
	|ИЗ
	|	ВТ_КонечнаяПотребность КАК ВТ_КонечнаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОпределениеГруппыИЛИ КАК ВТ_ОпределениеГруппыИЛИ
	|		ПО ВТ_КонечнаяПотребность.НормаВыдачи = ВТ_ОпределениеГруппыИЛИ.НормаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_КонечнаяПотребность.НормаВыдачи = ВТ_Периодичность.НормаВыдачи
	|			И ВТ_КонечнаяПотребность.НоменклатураНормы = ВТ_Периодичность.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаСИзносом КАК ВТ_ВыдачаСИзносом
	|		ПО ВТ_КонечнаяПотребность.Сотрудник = ВТ_ВыдачаСИзносом.Сотрудник
	|			И ВТ_КонечнаяПотребность.НоменклатураНормы = ВТ_ВыдачаСИзносом.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонечнаяПотребностьДляАнализа.Сотрудник КАК Сотрудник,
	|	ВТ_КонечнаяПотребностьДляАнализа.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_КонечнаяПотребностьДляАнализа.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритетПоНоменклатуреНормы
	|ИЗ
	|	ВТ_КонечнаяПотребностьДляАнализа КАК ВТ_КонечнаяПотребностьДляАнализа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КонечнаяПотребностьДляАнализа.Сотрудник,
	|	ВТ_КонечнаяПотребностьДляАнализа.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонечнаяПотребностьДляАнализа.Сотрудник КАК Сотрудник,
	|	ВТ_КонечнаяПотребностьДляАнализа.Подразделение КАК Подразделение,
	|	ВТ_КонечнаяПотребностьДляАнализа.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_КонечнаяПотребностьДляАнализа.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_КонечнаяПотребностьДляАнализа.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_КонечнаяПотребностьДляАнализа.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_КонечнаяПотребностьДляАнализа.КоличествоВыдано КАК КоличествоВыдано,
	|	ВЫБОР
	|		КОГДА ВТ_ИсходнаяПотребность.КоличествоОстаток ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_КонечнаяПотребностьДляАнализа.КоличествоВыдано = 0
	|						ТОГДА ВТ_КонечнаяПотребностьДляАнализа.ДатаПотребности
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_КонечнаяПотребностьДляАнализа.ДатаПотребности, ДЕНЬ, ВЫБОР
	|								КОГДА ПериодичностьВыдачиСИЗ.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|									ТОГДА ПериодичностьВыдачиСИЗ.КоличествоПериодов * 365
	|								ИНАЧЕ ПериодичностьВыдачиСИЗ.КоличествоПериодов * 30
	|							КОНЕЦ * ВТ_КонечнаяПотребностьДляАнализа.КоличествоВыдано * (1 - ВТ_КонечнаяПотребностьДляАнализа.ПроцентИзноса) / ПериодичностьВыдачиСИЗ.КоличествоВПериоде)
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_КонечнаяПотребностьДляАнализа.ДатаПотребности
	|	КОНЕЦ КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_КонечнаяПотребностьДляАнализа КАК ВТ_КонечнаяПотребностьДляАнализа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсходнаяПотребность КАК ВТ_ИсходнаяПотребность
	|		ПО ВТ_КонечнаяПотребностьДляАнализа.Сотрудник = ВТ_ИсходнаяПотребность.Сотрудник
	|			И ВТ_КонечнаяПотребностьДляАнализа.НормаВыдачи = ВТ_ИсходнаяПотребность.НормаВыдачи
	|			И ВТ_КонечнаяПотребностьДляАнализа.НоменклатураНормы = ВТ_ИсходнаяПотребность.НоменклатураНормы
	|			И ВТ_КонечнаяПотребностьДляАнализа.ДатаПотребности = ВТ_ИсходнаяПотребность.ДатаПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритетПоНоменклатуреНормы КАК ВТ_МаксимальныйПриоритетПоНоменклатуреНормы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ
	|			ПО ВТ_МаксимальныйПриоритетПоНоменклатуреНормы.МаксимальныйПриоритет = ПериодичностьВыдачиСИЗ.Приоритет
	|		ПО ВТ_КонечнаяПотребностьДляАнализа.Сотрудник = ВТ_МаксимальныйПриоритетПоНоменклатуреНормы.Сотрудник
	|			И ВТ_КонечнаяПотребностьДляАнализа.НоменклатураНормы = ВТ_МаксимальныйПриоритетПоНоменклатуреНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ВТ_Результат.ДатаПотребности) КАК ДатаПотребности,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи
	|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Сотрудник КАК Сотрудник,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.ЭтоЗима КАК ЭтоЗима,
	|	ВТ_Результат.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Результат.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Результат.КоличествоВыдано КАК КоличествоВыдано,
	|	НАЧАЛОПЕРИОДА(ВТ_МаксимальнаяДатаПотребности.ДатаПотребности, ДЕНЬ) КАК ДатаПотребности
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальнаяДатаПотребности КАК ВТ_МаксимальнаяДатаПотребности
	|		ПО ВТ_Результат.Сотрудник = ВТ_МаксимальнаяДатаПотребности.Сотрудник
	|			И ВТ_Результат.НормаВыдачи = ВТ_МаксимальнаяДатаПотребности.НормаВыдачи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Сотрудник,
	|	ВТ_Результат.НормаВыдачи,
	|	ВТ_Результат.НоменклатураНормы";
	
	Запрос.УстановитьПараметр("ТаблицаПотребности",	ТаблицаЗапроса);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодРасчета",		ДатаАнализа);
	Запрос.УстановитьПараметр("ДатаДокумента",		ДатаДокумента);
	Запрос.УстановитьПараметр("МассивСотрудников",	МассивСотрудников);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ПроцедурыРаботыСНормамиСервер.УточнитьПотребностьПоОтсутствиюНаРабочемМесте(ТаблицаЗапроса, Организация, ДатаАнализа);
	
КонецПроцедуры

Процедура ВыдачаСредствЗащитыСотруднику_ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка,ТаблицаДвижений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Комплект
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация КАК Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК Период,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата КАК ДатаВыдачи,
	//Танцюра А.Н. -- №123218 Комплекты с одинаковыми комплектующими -- 27.09.2021 <<<
	//+++АсТБ_Alexey_103065_*******************************************************************
	//|	СУММА(ВЫБОР
	//|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	//|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	//|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество / ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	//|		КОНЕЦ) КАК КоличествоСумма,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	//|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	//|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество / ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	//|		КОНЕЦ) КАК КоличествоМаксимум,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Количество) КАК КоличествоСумма,
	|	МАКСИМУМ(ВыдачаСредствЗащитыСотрудникуТовары.Количество) КАК КоличествоМаксимум,
	//***НСК Трегубов А.А.*** -- исправление ошибки в 115 релизе --  07.10.2021 <<<
	//|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//***НСК Трегубов А.А.*** -- исправление ошибки в 115 релизе --  07.10.2021 >>>
	//---АсТБ_Alexey_103065_*******************************************************************
	//Танцюра А.Н. -- №123218 Комплекты с одинаковыми комплектующими -- 27.09.2021 >>>
	|ПОМЕСТИТЬ ВТ_ДвиженияПоВыдаче
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка = &Ссылка
	|	И ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано = ЛОЖЬ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура
	|		ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Комплект
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НоменклатураНормы,
	|	ВыдачаСредствЗащитыСотрудникуТовары.НормаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ДатаВыдачи,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата,
	//+++АсТБ_Alexey_103065_*******************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта
	//---АсТБ_Alexey_103065_*******************************************************************
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_ДвиженияПоВыдаче.Номенклатура КАК Номенклатура,
	|	ВТ_ДвиженияПоВыдаче.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ДвиженияПоВыдаче.Организация КАК Организация,
	|	ВТ_ДвиженияПоВыдаче.Период КАК Период,
	|	ВТ_ДвиженияПоВыдаче.Сотрудник КАК Сотрудник,
	|	ВТ_ДвиженияПоВыдаче.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ДвиженияПоВыдаче.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ДвиженияПоВыдаче.ДатаВыдачи КАК ДатаВыдачи,
	//+++АсТБ_Alexey_103065_*******************************************************************
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДвиженияПоВыдаче.Номенклатура.Комплект
	|				ТОГДА ВТ_ДвиженияПоВыдаче.КоличествоМаксимум
	|			ИНАЧЕ ВТ_ДвиженияПоВыдаче.КоличествоСумма
	|		КОНЕЦ) КАК Количество
	//---АсТБ_Alexey_103065_*******************************************************************
	|ИЗ
	|	ВТ_ДвиженияПоВыдаче КАК ВТ_ДвиженияПоВыдаче
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА ВТ_ДвиженияПоВыдаче.Номенклатура.Комплект
	|					ТОГДА ВТ_ДвиженияПоВыдаче.КоличествоМаксимум
	|				ИНАЧЕ ВТ_ДвиженияПоВыдаче.КоличествоСумма
	|			КОНЕЦ = 0
	|
	//+++АсТБ_Alexey_103065_*******************************************************************
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДвиженияПоВыдаче.Номенклатура,
	|	ВТ_ДвиженияПоВыдаче.ХарактеристикаНоменклатуры,
	|	ВТ_ДвиженияПоВыдаче.Организация,
	|	ВТ_ДвиженияПоВыдаче.Период,
	|	ВТ_ДвиженияПоВыдаче.Сотрудник,
	|	ВТ_ДвиженияПоВыдаче.НоменклатураНормы,
	|	ВТ_ДвиженияПоВыдаче.НормаВыдачи,
	|	ВТ_ДвиженияПоВыдаче.ДатаВыдачи";
	//---АсТБ_Alexey_103065_*******************************************************************
	
	Запрос.УстановитьПараметр("Ссылка",	ДокументСсылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

Процедура ОбменСредствЗащитыСотрудника_ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка,ТаблицаДвижений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОбменСредствЗащитыСотрудникаТовары.НомерСтроки,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Организация,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Сотрудник,
	|	ОбменСредствЗащитыСотрудникаТовары.НормаВыдачи,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураНормыДляВозврата КАК НоменклатураНормы,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураДляВозврата КАК Номенклатура,
	|	ОбменСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатурыДляВозврата КАК ХарактеристикаНоменклатуры,
	|	ОбменСредствЗащитыСотрудникаТовары.Количество,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК Период,
	|	ОбменСредствЗащитыСотрудникаТовары.ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_РасходПовыданнымСИЗ
	|ИЗ
	|	Документ.ОбменСредствЗащитыСотрудника.Товары КАК ОбменСредствЗащитыСотрудникаТовары
	|ГДЕ
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОбменСредствЗащитыСотрудникаТовары.НомерСтроки,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Организация,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Сотрудник,
	|	ОбменСредствЗащитыСотрудникаТовары.НормаВыдачи,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураНормыДляВыдачи КАК НоменклатураНормы,
	|	ОбменСредствЗащитыСотрудникаТовары.НоменклатураДляВыдачи КАК Номенклатура,
	|	ОбменСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатурыДляВыдачи КАК ХарактеристикаНоменклатуры,
	|	ОбменСредствЗащитыСотрудникаТовары.Количество,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК Период,
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ПриходПоВыданнымСИЗ
	|ИЗ
	|	Документ.ОбменСредствЗащитыСотрудника.Товары КАК ОбменСредствЗащитыСотрудникаТовары
	|ГДЕ
	|	ОбменСредствЗащитыСотрудникаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходПовыданнымСИЗ.НомерСтроки,
	|	ВТ_РасходПовыданнымСИЗ.Период,
	|	ВТ_РасходПовыданнымСИЗ.ВидДвижения КАК ВидДвижения,
	|	ВТ_РасходПовыданнымСИЗ.Организация КАК Организация,
	|	ВТ_РасходПовыданнымСИЗ.Сотрудник КАК Сотрудник,
	|	ВТ_РасходПовыданнымСИЗ.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_РасходПовыданнымСИЗ.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_РасходПовыданнымСИЗ.Номенклатура КАК Номенклатура,
	|	ВТ_РасходПовыданнымСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_РасходПовыданнымСИЗ.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_РасходПовыданнымСИЗ.Количество
	|ИЗ
	|	ВТ_РасходПовыданнымСИЗ КАК ВТ_РасходПовыданнымСИЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПриходПоВыданнымСИЗ.НомерСтроки,
	|	ВТ_ПриходПоВыданнымСИЗ.Период,
	|	ВТ_ПриходПоВыданнымСИЗ.ВидДвижения,
	|	ВТ_ПриходПоВыданнымСИЗ.Организация,
	|	ВТ_ПриходПоВыданнымСИЗ.Сотрудник,
	|	ВТ_ПриходПоВыданнымСИЗ.НормаВыдачи,
	|	ВТ_ПриходПоВыданнымСИЗ.НоменклатураНормы,
	|	ВТ_ПриходПоВыданнымСИЗ.Номенклатура,
	|	ВТ_ПриходПоВыданнымСИЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ПриходПоВыданнымСИЗ.ДатаВыдачи,
	|	ВТ_ПриходПоВыданнымСИЗ.Количество
	|ИЗ
	|	ВТ_ПриходПоВыданнымСИЗ КАК ВТ_ПриходПоВыданнымСИЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	НормаВыдачи,
	|	ВидДвижения УБЫВ";
	
	
	Запрос.УстановитьПараметр("Ссылка",	ДокументСсылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

Процедура СписаниеСредствЗащитыСотрудника_ПолучитьТаблицуДвиженийПоВыданнымСИЗ(ДокументСсылка,ТаблицаДвижений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка.Дата КАК Период,
	|	СписаниеСредствЗащитыСотрудникаТовары.НомерСтроки,
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка.Организация,
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка.Сотрудник,
	|	СписаниеСредствЗащитыСотрудникаТовары.НормаВыдачи КАК НормаВыдачи,
	|	СписаниеСредствЗащитыСотрудникаТовары.НоменклатураНормы,
	|	СписаниеСредствЗащитыСотрудникаТовары.Номенклатура,
	|	СписаниеСредствЗащитыСотрудникаТовары.ХарактеристикаНоменклатуры,
	|	СписаниеСредствЗащитыСотрудникаТовары.Количество,
	|	СписаниеСредствЗащитыСотрудникаТовары.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	Документ.СписаниеСредствЗащитыСотрудника.Товары КАК СписаниеСредствЗащитыСотрудникаТовары
	|ГДЕ
	|	СписаниеСредствЗащитыСотрудникаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

Процедура ПолучитьСтруктуруТаблицДвиженийПоЗачетуУпрощеннойВыдачи(ДокументСсылка,СтруктураТаблицДвижений) Экспорт
	
	ТаблицаВыданныеСредстваЗащиты 	= СтруктураТаблицДвижений.ТаблицаВыданныеСредстваЗащиты;
	ТаблицаПотребностьВыдачиСИЗ 	= СтруктураТаблицДвижений.ТаблицаПотребностьВыдачиСИЗ;
	ТаблицаВыдачаПоПотребности 		= СтруктураТаблицДвижений.ТаблицаВыдачаПоПотребности;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗачетУпрощеннойВыдачиТовары.Сотрудник КАК Сотрудник,
	|	ЗачетУпрощеннойВыдачиТовары.НормаВыдачи КАК НормаВыдачи,
	|	ЗачетУпрощеннойВыдачиТовары.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ЗачетУпрощеннойВыдачиТовары.ДатаПотребности КАК ДатаПотребности,
	|	ЗачетУпрощеннойВыдачиТовары.КоличествоПотребность КАК КоличествоПотребность,
	|	ЗачетУпрощеннойВыдачиТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ЗачетУпрощеннойВыдачиТовары.Номенклатура КАК Номенклатура,
	|	ЗачетУпрощеннойВыдачиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗачетУпрощеннойВыдачиТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ЗачетУпрощеннойВыдачиТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.ЗачетУпрощеннойВыдачи.Товары КАК ЗачетУпрощеннойВыдачиТовары
	|ГДЕ
	|	ЗачетУпрощеннойВыдачиТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Выдача
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выдача.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	МАКСИМУМ(ВТ_Выдача.ДатаВыдачи) КАК ДатаВыдачи,
	|	СУММА(ВТ_Выдача.Количество) КАК КоличествоВыдано
	|ПОМЕСТИТЬ ВТ_СгруппированнаяВыдача
	|ИЗ
	|	ВТ_Выдача КАК ВТ_Выдача
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|			ВТ_ТаблицаДокумента.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|			ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|			ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|			ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи
	|		ИЗ
	|			ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента) КАК ВложенныйЗапрос
	|		ПО ВТ_Выдача.Сотрудник = ВложенныйЗапрос.Сотрудник
	|			И ВТ_Выдача.НоменклатураНормы = ВложенныйЗапрос.НоменклатураНормы
	|			И ВТ_Выдача.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|			И ВТ_Выдача.ДатаВыдачи = ВложенныйЗапрос.ДатаВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выдача.Сотрудник,
	|	ВложенныйЗапрос.НоменклатураНормыПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ВТ_ТаблицаДокумента.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ТаблицаДокумента.КоличествоПотребность КАК КоличествоПотребность,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.Приоритет КАК ПриоритетПериодичности
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВТ_ТаблицаДокумента.НоменклатураНормыПотребности = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_ТаблицаДокумента.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаДокумента.НоменклатураНормыПотребности = ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)
	|	И НЕ ВТ_ТаблицаДокумента.ДатаПотребности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И НЕ ВТ_ТаблицаДокумента.КоличествоПотребность = 0
	|	И НормыВыдачиСИЗСоставНормы.Ссылка.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	МАКСИМУМ(ВТ_Потребность.ПриоритетПериодичности) КАК ПриоритетПериодичности
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормыПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксимальныйПриоритет.Сотрудник КАК Сотрудник,
	|	ВТ_МаксимальныйПриоритет.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Потребность.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_Потребность.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_СгруппированнаяВыдача.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_СгруппированнаяВыдача.КоличествоВыдано КАК КоличествоВыдано
	|ИЗ
	|	ВТ_МаксимальныйПриоритет КАК ВТ_МаксимальныйПриоритет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
	|		ПО ВТ_МаксимальныйПриоритет.Сотрудник = ВТ_Потребность.Сотрудник
	|			И ВТ_МаксимальныйПриоритет.НоменклатураНормыПотребности = ВТ_Потребность.НоменклатураНормыПотребности
	|			И ВТ_МаксимальныйПриоритет.ПриоритетПериодичности = ВТ_Потребность.ПриоритетПериодичности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СгруппированнаяВыдача КАК ВТ_СгруппированнаяВыдача
	|		ПО ВТ_МаксимальныйПриоритет.Сотрудник = ВТ_СгруппированнаяВыдача.Сотрудник
	|			И ВТ_МаксимальныйПриоритет.НоменклатураНормыПотребности = ВТ_СгруппированнаяВыдача.НоменклатураНормыПотребности
	|ГДЕ
	|	НЕ ВТ_Потребность.Сотрудник ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксимальныйПриоритет.Сотрудник КАК Сотрудник,
	|	ВТ_МаксимальныйПриоритет.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Потребность.КоличествоПотребность КАК КоличествоПотребность
	|ИЗ
	|	ВТ_МаксимальныйПриоритет КАК ВТ_МаксимальныйПриоритет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
	|		ПО ВТ_МаксимальныйПриоритет.Сотрудник = ВТ_Потребность.Сотрудник
	|			И ВТ_МаксимальныйПриоритет.НоменклатураНормыПотребности = ВТ_Потребность.НоменклатураНормыПотребности
	|ГДЕ
	|	НЕ ВТ_МаксимальныйПриоритет.ПриоритетПериодичности = ВТ_Потребность.ПриоритетПериодичности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выдача.Сотрудник КАК Сотрудник,
	|	ВТ_Выдача.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Выдача.Номенклатура КАК Номенклатура,
	|	ВТ_Выдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Выдача.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_Выдача.Количество КАК Количество,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормыПотребности КАК НоменклатураНормыПотребности,
	|	ВТ_ТаблицаДокумента.ДатаПотребности КАК ДатаПотребности
	|ИЗ
	|	ВТ_Выдача КАК ВТ_Выдача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО ВТ_Выдача.Сотрудник = ВТ_ТаблицаДокумента.Сотрудник
	|			И ВТ_Выдача.НоменклатураНормы = ВТ_ТаблицаДокумента.НоменклатураНормы
	|			И ВТ_Выдача.Номенклатура = ВТ_ТаблицаДокумента.Номенклатура
	|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_ТаблицаДокумента.ХарактеристикаНоменклатуры
	|			И ВТ_Выдача.ДатаВыдачи = ВТ_ТаблицаДокумента.ДатаВыдачи";
	
	Запрос.УстановитьПараметр("Ссылка",		ДокументСсылка);
	Запрос.УстановитьПараметр("Организация",ДокументСсылка.Организация);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаПотребностиДляЗачета  	= Результат[5].Выгрузить();
	ТаблицаПотребностиПрицепом  	= Результат[6].Выгрузить();
	ТаблицаВыдачи 					= Результат[7].Выгрузить();
	
	Для Каждого СтрокаТаблицыПотребностиДляЗачета Из ТаблицаПотребностиДляЗачета Цикл
		
		Если СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность > СтрокаТаблицыПотребностиДляЗачета.КоличествоВыдано Тогда
			
			//формируем движения по выданным СИЗ
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Сотрудник",					СтрокаТаблицыПотребностиДляЗачета.Сотрудник);
			СтруктураПоиска.Вставить("НормаВыдачи",					СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи);
			СтруктураПоиска.Вставить("НоменклатураНормыПотребности",СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности);
			СтруктураПоиска.Вставить("ДатаПотребности",				СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности);
			
			НайденныеСтроки = ТаблицаВыдачи.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				//списание выдачи
				НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= Справочники.НормыВыдачиСИЗ.ПустаяСсылка();
				НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрока.НоменклатураНормы;
				НоваяСтрока.Номенклатура 				= НайденнаяСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры 	= НайденнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.ДатаВыдачи 					= НайденнаяСтрока.ДатаВыдачи;
				НоваяСтрока.Количество                  = НайденнаяСтрока.Количество;
				   
				//оприходование выдачи
				НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности;
				НоваяСтрока.Номенклатура 				= НайденнаяСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры 	= НайденнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыПотребностиДляЗачета.ДатаВыдачи;
				НоваяСтрока.Количество                  = НайденнаяСтрока.Количество;
				
			КонецЦикла;
			
			НоваяДатаПотребности = ?(СтрокаТаблицыПотребностиДляЗачета.ПериодичностьВыдачи.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,
										ДобавитьМесяц(СтрокаТаблицыПотребностиДляЗачета.ДатаВыдачи,СтрокаТаблицыПотребностиДляЗачета.ПериодичностьВыдачи.КоличествоПериодов * 12 * СтрокаТаблицыПотребностиДляЗачета.КоличествоВыдано / СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность),
										ДобавитьМесяц(СтрокаТаблицыПотребностиДляЗачета.ДатаВыдачи,СтрокаТаблицыПотребностиДляЗачета.ПериодичностьВыдачи.КоличествоПериодов * СтрокаТаблицыПотребностиДляЗачета.КоличествоВыдано / СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность));
			
			//формируем движения по потребности с максимальной периодичностью
			//списание потребности
			НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период 						= ДокументСсылка.Дата;
			НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
			НоваяСтрока.Организация 				= ДокументСсылка.Организация;
			НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
			НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
			НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности;
			НоваяСтрока.ДатаПотребности				= СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности;
			НоваяСтрока.Количество                  = СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность;
			
			//оприходование потребности
			НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период 						= ДокументСсылка.Дата;
			НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
			НоваяСтрока.Организация 				= ДокументСсылка.Организация;
			НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
			НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
			НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности;
			НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
			НоваяСтрока.Количество                  = СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность;
			
			//формируем движения по потребности по остальному составу группы ИЛИ
			Для Каждого СтрокаСостава Из СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи.СоставНормы Цикл
				
				Если СтрокаСостава.НоменклатураНормы = СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности Тогда
					Продолжить;
				КонецЕсли;
				
				//списание потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
				НоваяСтрока.ДатаПотребности				= СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности;
				НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
				
				//оприходование потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
				НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
				НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
				
			КонецЦикла;	
			
			//формируем движения по потребности с такой же номенклатурой нормы
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Сотрудник",					СтрокаТаблицыПотребностиДляЗачета.Сотрудник);
			СтруктураПоиска.Вставить("НоменклатураНормыПотребности",СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности);
			
			НайденныеСтроки = ТаблицаПотребностиПрицепом.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				//списание потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрока.НоменклатураНормыПотребности;
				НоваяСтрока.ДатаПотребности				= НайденнаяСтрока.ДатаПотребности;
				НоваяСтрока.Количество                  = НайденнаяСтрока.КоличествоПотребность;
				
				//оприходование потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрока.НоменклатураНормыПотребности;
				НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
				НоваяСтрока.Количество                  = НайденнаяСтрока.КоличествоПотребность;
				
				//формируем движения по потребности по остальному составу группы ИЛИ
				Для Каждого СтрокаСостава Из НайденнаяСтрока.НормаВыдачи.СоставНормы Цикл
					
					Если СтрокаСостава.НоменклатураНормы = НайденнаяСтрока.НоменклатураНормыПотребности Тогда
						Продолжить;
					КонецЕсли;
					
					//списание потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
					НоваяСтрока.ДатаПотребности				= СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности;
					НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
					
					//оприходование потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
					НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
					НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
					
				КонецЦикла;
			
			КонецЦикла;
			
		Иначе //СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность <= СтрокаТаблицыПотребностиДляЗачета.КоличествоВыдано
			
			//формируем движения по выданным СИЗ
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Сотрудник",					СтрокаТаблицыПотребностиДляЗачета.Сотрудник);
			СтруктураПоиска.Вставить("НормаВыдачи",					СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи);
			СтруктураПоиска.Вставить("НоменклатураНормыПотребности",СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности);
			СтруктураПоиска.Вставить("ДатаПотребности",				СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности);
			
			НайденныеСтроки = ТаблицаВыдачи.НайтиСтроки(СтруктураПоиска);
			
			ОстатокПоПотребности = СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность;
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если ОстатокПоПотребности = 0 Тогда
					Прервать;
				КонецЕсли;	
				
				Если ОстатокПоПотребности >= НайденнаяСтрока.Количество Тогда
					КоличествоПоВыдаче = НайденнаяСтрока.Количество;
				Иначе
					КоличествоПоВыдаче = ОстатокПоПотребности;
				КонецЕсли;	
				
				//списание выдачи
				НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= Справочники.НормыВыдачиСИЗ.ПустаяСсылка();
				НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрока.НоменклатураНормы;
				НоваяСтрока.Номенклатура 				= НайденнаяСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры 	= НайденнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.ДатаВыдачи 					= НайденнаяСтрока.ДатаВыдачи;
				НоваяСтрока.Количество                  = КоличествоПоВыдаче;
				
				//оприходование выдачи
				НоваяСтрока = ТаблицаВыданныеСредстваЗащиты.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности;
				НоваяСтрока.Номенклатура 				= НайденнаяСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры 	= НайденнаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.ДатаВыдачи 					= СтрокаТаблицыПотребностиДляЗачета.ДатаВыдачи;
				НоваяСтрока.Количество                  = КоличествоПоВыдаче;
				
				ОстатокПоПотребности = ОстатокПоПотребности - КоличествоПоВыдаче;
				
			КонецЦикла;
			
			НоваяДатаПотребности = ?(СтрокаТаблицыПотребностиДляЗачета.ПериодичностьВыдачи.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,
										ДобавитьМесяц(СтрокаТаблицыПотребностиДляЗачета.ДатаВыдачи,СтрокаТаблицыПотребностиДляЗачета.ПериодичностьВыдачи.КоличествоПериодов * 12),
										ДобавитьМесяц(СтрокаТаблицыПотребностиДляЗачета.ДатаВыдачи,СтрокаТаблицыПотребностиДляЗачета.ПериодичностьВыдачи.КоличествоПериодов));
										
			//формируем движения по потребности с максимальной периодичностью
			//списание потребности
			НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период 						= ДокументСсылка.Дата;
			НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
			НоваяСтрока.Организация 				= ДокументСсылка.Организация;
			НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
			НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
			НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности;
			НоваяСтрока.ДатаПотребности				= СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности;
			НоваяСтрока.Количество                  = СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность;
			
			//оприходование потребности
			НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период 						= ДокументСсылка.Дата;
			НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
			НоваяСтрока.Организация 				= ДокументСсылка.Организация;
			НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
			НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
			НоваяСтрока.НоменклатураНормы 			= СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности;
			НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
			НоваяСтрока.Количество                  = СтрокаТаблицыПотребностиДляЗачета.КоличествоПотребность;
			
			//формируем движения по потребности по остальному составу группы ИЛИ
			Для Каждого СтрокаСостава Из СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи.СоставНормы Цикл
				
				Если СтрокаСостава.НоменклатураНормы = СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности Тогда
					Продолжить;
				КонецЕсли;
				
				//списание потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
				НоваяСтрока.ДатаПотребности				= СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности;
				НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
				
				//оприходование потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= СтрокаТаблицыПотребностиДляЗачета.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
				НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
				НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
				
			КонецЦикла;
			
			//формируем движения по потребности с такой же номенклатурой нормы
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Сотрудник",					СтрокаТаблицыПотребностиДляЗачета.Сотрудник);
			СтруктураПоиска.Вставить("НоменклатураНормыПотребности",СтрокаТаблицыПотребностиДляЗачета.НоменклатураНормыПотребности);
			
			НайденныеСтроки = ТаблицаПотребностиПрицепом.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				//списание потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрока.НоменклатураНормыПотребности;
				НоваяСтрока.ДатаПотребности				= НайденнаяСтрока.ДатаПотребности;
				НоваяСтрока.Количество                  = НайденнаяСтрока.КоличествоПотребность;
				
				//оприходование потребности
				НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
				НоваяСтрока.Активность					= Истина;
				НоваяСтрока.Период 						= ДокументСсылка.Дата;
				НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
				НоваяСтрока.Организация 				= ДокументСсылка.Организация;
				НоваяСтрока.Сотрудник   				= НайденнаяСтрока.Сотрудник;
				НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
				НоваяСтрока.НоменклатураНормы 			= НайденнаяСтрока.НоменклатураНормыПотребности;
				НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
				НоваяСтрока.Количество                  = НайденнаяСтрока.КоличествоПотребность;
				
				//формируем движения по потребности по остальному составу группы ИЛИ
				Для Каждого СтрокаСостава Из НайденнаяСтрока.НормаВыдачи.СоставНормы Цикл
					
					Если СтрокаСостава.НоменклатураНормы = НайденнаяСтрока.НоменклатураНормыПотребности Тогда
						Продолжить;
					КонецЕсли;
					
					//списание потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
					НоваяСтрока.ДатаПотребности				= СтрокаТаблицыПотребностиДляЗачета.ДатаПотребности;
					НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
					
					//оприходование потребности
					НоваяСтрока = ТаблицаПотребностьВыдачиСИЗ.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период 						= ДокументСсылка.Дата;
					НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					НоваяСтрока.Организация 				= ДокументСсылка.Организация;
					НоваяСтрока.Сотрудник   				= СтрокаТаблицыПотребностиДляЗачета.Сотрудник;
					НоваяСтрока.НормаВыдачи 				= НайденнаяСтрока.НормаВыдачи;
					НоваяСтрока.НоменклатураНормы 			= СтрокаСостава.НоменклатураНормы;
					НоваяСтрока.ДатаПотребности				= НоваяДатаПотребности;
					НоваяСтрока.Количество                  = СтрокаСостава.ПериодичностьВыдачи.КоличествоВПериоде;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	СтруктураТаблицДвижений = Новый Структура("ТаблицаВыданныеСредстваЗащиты, ТаблицаПотребностьВыдачиСИЗ, ТаблицаВыдачаПоПотребности", ТаблицаВыданныеСредстваЗащиты, ТаблицаПотребностьВыдачиСИЗ, ТаблицаВыдачаПоПотребности);
	
КонецПроцедуры