
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();// Получаем настройки отчета
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	
	ПараметрОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если не ПараметрОрганизация = Неопределено Тогда
		Организация = ПараметрОрганизация.Значение;
		ПараметрОрганизация.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрВыводитьДиаграммы = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьДиаграммы"));
	Если НЕ ПараметрОрганизация = Неопределено Тогда
		ВыводитьДиаграммы = ПараметрВыводитьДиаграммы.Значение;
		ПараметрВыводитьДиаграммы.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
		
	ПараметрВыводитьТаблицы = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьТаблицы"));
	Если НЕ ПараметрОрганизация = Неопределено Тогда
		ВыводитьТаблицы = ПараметрВыводитьТаблицы.Значение;
		ПараметрВыводитьТаблицы.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если Настройки.ДополнительныеСвойства.ВариантНаименование = "Обеспеченность по сотрудникам" Тогда
		
		Запрос.Текст = ПолучитьТекстЗапросаПоСотрудникам();
		
		ПараметрСотрудник = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокСотрудников"));
		Если не ПараметрСотрудник = Неопределено Тогда
			Если ТипЗнч(ПараметрСотрудник.Значение) = Тип("СписокЗначений") Тогда
				Запрос.УстановитьПараметр("СписокСотрудников",ПараметрСотрудник.Значение);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоСотрудникам",ПараметрСотрудник.Использование);
			Иначе
				СписокСотрудников = Новый СписокЗначений;
				СписокСотрудников.Добавить(ПараметрСотрудник.Значение);
				Запрос.УстановитьПараметр("СписокСотрудников",СписокСотрудников);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоСотрудникам",ПараметрСотрудник.Использование);
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр("СписокСотрудников",ПараметрСотрудник.Значение);
			Запрос.УстановитьПараметр("ИспользоватьФильтрПоСотрудникам",ЛОЖЬ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		
		ТаблицаПоСотрудникам = Запрос.Выполнить().Выгрузить();
		
		НаборыВнешнихДанных = Новый Структура;
		НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаПоСотрудникам);
		
	ИначеЕсли Настройки.ДополнительныеСвойства.ВариантНаименование = "Обеспеченность по номенклатуре норм" Тогда
		
		Запрос.Текст = ПолучитьТекстЗапросаПоНоменклатуреНормы();
		
		ПараметрНоменклатураНормы = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокНоменклатурыНорм"));
		Если не ПараметрНоменклатураНормы = Неопределено Тогда
			Если ТипЗнч(ПараметрНоменклатураНормы.Значение) = Тип("СписокЗначений") Тогда
				Запрос.УстановитьПараметр("СписокНоменклатурыНорм",ПараметрНоменклатураНормы.Значение);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоНоменклатуреНорм",ПараметрНоменклатураНормы.Использование);
			Иначе
				СписокНоменклатурыНорм = Новый СписокЗначений;
				СписокНоменклатурыНорм.Добавить(ПараметрНоменклатураНормы.Значение);
				Запрос.УстановитьПараметр("СписокНоменклатурыНорм",СписокНоменклатурыНорм);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоНоменклатуреНорм",ПараметрНоменклатураНормы.Использование);
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр("СписокНоменклатурыНорм",ПараметрНоменклатураНормы.Значение);
			Запрос.УстановитьПараметр("ИспользоватьФильтрПоНоменклатуреНорм",ЛОЖЬ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		ТаблицаПоНоменклатуреНормы = Запрос.Выполнить().Выгрузить();
		
		НаборыВнешнихДанных = Новый Структура;
		НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаПоНоменклатуреНормы);
		
	ИначеЕсли Настройки.ДополнительныеСвойства.ВариантНаименование = "Обеспеченность по подразделениям" Тогда
		
		Запрос.Текст = ПолучитьТекстЗапросаПоПодразделениям();
		
		ПараметрПодразделение = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокПодразделений"));
		Если не ПараметрПодразделение = Неопределено Тогда
			Если ТипЗнч(ПараметрПодразделение.Значение) = Тип("СписокЗначений") Тогда
				Запрос.УстановитьПараметр("СписокПодразделений",ПараметрПодразделение.Значение);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоПодразделениям",ПараметрПодразделение.Использование);
			Иначе
				СписокПодразделений = Новый СписокЗначений;
				СписокПодразделений.Добавить(ПараметрПодразделение.Значение);
				Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоПодразделениям",ПараметрПодразделение.Использование);
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр("СписокПодразделений",ПараметрПодразделение.Значение);
			Запрос.УстановитьПараметр("ИспользоватьФильтрПоПодразделениям",ЛОЖЬ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		ТаблицаПоПодразделениям = Запрос.Выполнить().Выгрузить();
		
		НаборыВнешнихДанных = Новый Структура;
		НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаПоПодразделениям);
		
	ИначеЕсли Настройки.ДополнительныеСвойства.ВариантНаименование = "Обеспеченность по МВЗ" Тогда
		
		Запрос.Текст = ПолучитьТекстЗапросаПоМВЗ();
		
		ПараметрМВЗ = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокМВЗ"));
		Если не ПараметрМВЗ = Неопределено Тогда
			Если ТипЗнч(ПараметрМВЗ.Значение) = Тип("СписокЗначений") Тогда
				Запрос.УстановитьПараметр("СписокМВЗ",ПараметрМВЗ.Значение);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоМВЗ",ПараметрМВЗ.Использование);
			Иначе
				СписокМВЗ = Новый СписокЗначений;
				СписокМВЗ.Добавить(ПараметрМВЗ.Значение);
				Запрос.УстановитьПараметр("СписокМВЗ",СписокМВЗ);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоМВЗ",ПараметрМВЗ.Использование);
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр("СписокМВЗ",ПараметрМВЗ.Значение);
			Запрос.УстановитьПараметр("ИспользоватьФильтрПоМВЗ",ЛОЖЬ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		ТаблицаПоМВЗ = Запрос.Выполнить().Выгрузить();
		
		НаборыВнешнихДанных = Новый Структура;
		НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаПоМВЗ);
		
	ИначеЕсли Настройки.ДополнительныеСвойства.ВариантНаименование = "Обеспеченность по ответственным лицам" Тогда
		
		Запрос.Текст = ПолучитьТекстЗапросаПоОтветственнымЛицам();
		
		ПараметрОтветственныеЛица = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокОтветственныхЛиц"));
		Если не ПараметрОтветственныеЛица = Неопределено Тогда
			Если ТипЗнч(ПараметрОтветственныеЛица.Значение) = Тип("СписокЗначений") Тогда
				Запрос.УстановитьПараметр("СписокОтветственныхЛиц",ПараметрОтветственныеЛица.Значение);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоОтветственнымЛицам",ПараметрОтветственныеЛица.Использование);
			Иначе
				СписокОтветственныхЛиц = Новый СписокЗначений;
				СписокОтветственныхЛиц.Добавить(ПараметрОтветственныеЛица.Значение);
				Запрос.УстановитьПараметр("СписокОтветственныхЛиц",СписокОтветственныхЛиц);
				Запрос.УстановитьПараметр("ИспользоватьФильтрПоОтветственнымЛицам",ПараметрОтветственныеЛица.Использование);
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр("СписокОтветственныхЛиц",ПараметрОтветственныеЛица.Значение);
			Запрос.УстановитьПараметр("ИспользоватьФильтрПоОтветственнымЛицам",ЛОЖЬ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		ТаблицаПоОтветственнымЛицам = Запрос.Выполнить().Выгрузить();
		
		НаборыВнешнихДанных = Новый Структура;
		НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаПоОтветственнымЛицам);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураНастроек = Настройки.Структура;
	СтруктураНастроек[0].Использование = ВыводитьДиаграммы;
	СтруктураНастроек[1].Использование = ВыводитьДиаграммы;
	СтруктураНастроек[2].Использование = ВыводитьДиаграммы;
	СтруктураНастроек[3].Использование = ВыводитьДиаграммы;
	СтруктураНастроек[4].Использование = ВыводитьТаблицы;
	СтруктураНастроек[5].Использование = ВыводитьТаблицы;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	//Инициализировать(<Макет>, <ВнешниеНаборыДанных>, <ДанныеРасшифровки>, <ВозможностьИспользованияВнешнихФункций>) 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,НаборыВнешнихДанных , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаПоСотрудникам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Маппинг
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, НоменклатураНормыОрганизации.Владелец = &Организация) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	1 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	2 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	3 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	4 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	5 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	6 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	7 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	8 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			,
	|			Организация = &Организация
	|				И (НЕ &ИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&СписокСотрудников))) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|			ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|			ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
	|		ИЗ
	|			РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|					,
	|					Организация = &Организация
	|						И НЕ Организация.ИспользоватьГруппыИЛИ
	|						И (НЕ &ИспользоватьФильтрПоСотрудникам
	|							ИЛИ Сотрудник В (&СписокСотрудников))) КАК ПотребностьВыдачиСИЗОстатки) КАК ВложенныйЗапрос
	|		ПО ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация = ВложенныйЗапрос.Организация
	|			И ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|	КОНЕЦ КАК ПриоритетУсловия,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПолныйМаппинг
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность КАК ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолныйМаппинг.Организация КАК Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник КАК Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы КАК НоменклатураНормы,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.ПриоритетУсловия) КАК ПриоритетУсловия,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныеПриоритеты
	|ИЗ
	|	ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолныйМаппинг.Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МинимальныеПриоритеты.Организация КАК Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник КАК Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ПолныйМаппинг.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингСотрудников
	|ИЗ
	|	ВТ_МинимальныеПриоритеты КАК ВТ_МинимальныеПриоритеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|		ПО ВТ_МинимальныеПриоритеты.Организация = ВТ_ПолныйМаппинг.Организация
	|			И ВТ_МинимальныеПриоритеты.Сотрудник = ВТ_ПолныйМаппинг.Сотрудник
	|			И ВТ_МинимальныеПриоритеты.ПриоритетУсловия = ВТ_ПолныйМаппинг.ПриоритетУсловия
	|			И ВТ_МинимальныеПриоритеты.Приоритет = ВТ_ПолныйМаппинг.Приоритет
	|			И ВТ_МинимальныеПриоритеты.НоменклатураНормы = ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МинимальныеПриоритеты.Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	НоменклатураНормы,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Организация КАК Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаппингСотрудников.Организация КАК Организация,
	|	ВТ_МаппингСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_МаппингСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныПоНормамСотрудников
	|ИЗ
	|	ВТ_МаппингСотрудников КАК ВТ_МаппингСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_МаппингСотрудников.Организация = ВТ_Цены.Организация
	|			И ВТ_МаппингСотрудников.Номенклатура = ВТ_Цены.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Выдано
	|ПОМЕСТИТЬ ВТ_Выдано_ххх2
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			,
	|			Организация = &Организация
	|				И Организация.ЧастичнаяВыдача = 2
	|				И (НЕ &ИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&СписокСотрудников))) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) КАК МесяцПотребности,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0) КАК Выдано_ххх2
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Организация.ИспользоватьГруппыИЛИ
	|				И (НЕ &ИспользоватьФильтрПоСотрудникам
	|					ИЛИ Сотрудник В (&СписокСотрудников))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдано_ххх2 КАК ВТ_Выдано_ххх2
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_Выдано_ххх2.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_Выдано_ххх2.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_Выдано_ххх2.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_Выдано_ххх2.ДатаВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ),
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НормаВыдачи) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НоменклатураНормы) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	СУММА(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_Нормы_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Нормы_хх0х КАК ВТ_Нормы_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_Нормы_хх0х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_Нормы_хх0х.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх0х КАК ВТ_МаксимальныйПриоритет_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх0х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх0х.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_МаксимальныйПриоритет_хх0х.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх0х.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_Нормы_хх0х.КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	МАКСИМУМ(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_Нормы_хх1х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Нормы_хх1х КАК ВТ_Нормы_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_Нормы_хх1х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_Нормы_хх1х.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх1х КАК ВТ_МаксимальныйПриоритет_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх1х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх1х.Сотрудник
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх1х.НоменклатураНормы
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_Нормы_хх1х.КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодичностьВыдачиСИЗ.Приоритет КАК Приоритет,
	|	ПериодичностьВыдачиСИЗ.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх0х.Организация КАК Организация,
	|	ВТ_Потребность_хх0х.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_хх0х.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВремени,
	|	ВТ_Потребность_хх0х.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_Потребность_хх0х.Выдано_ххх2 КАК Выдано_ххх2,
	|	ВТ_Потребность_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Потребность_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_Потребность_хх0х КАК ВТ_Потребность_хх0х
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх1х.Организация,
	|	ВТ_Потребность_хх1х.Сотрудник,
	|	ВТ_Потребность_хх1х.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВТ_Потребность_хх1х.КоличествоОстаток,
	|	ВТ_Потребность_хх1х.Выдано_ххх2,
	|	ВТ_Потребность_хх1х.КоличествоНорм,
	|	ВТ_Потребность_хх1х.МаксимальныйПриоритет
	|ИЗ
	|	ВТ_Потребность_хх1х КАК ВТ_Потребность_хх1х
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Организация КАК Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ПериодВремени КАК ПериодВремени,
	|	СУММА(ВТ_СобраннаяПотребность.КоличествоОстаток) КАК Потребность,
	|	СУММА(ВТ_СобраннаяПотребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_СобраннаяПотребность.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПотребностьДляРасчета
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_СобраннаяПотребность.МаксимальныйПриоритет = ВТ_Периодичность.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобраннаяПотребность.Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде,
	|	ВТ_СобраннаяПотребность.ПериодВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация КАК Организация,
	|	ВТ_ПотребностьДляРасчета.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде КАК КоличествоВПериоде,
	|	ВТ_ПотребностьДляРасчета.Потребность КАК Потребность_Ранее,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2 КАК Выдано_ххх2_Ранее,
	|	0 КАК Потребность_Сейчас,
	|	0 КАК Выдано_ххх2_Сейчас,
	|	0 КАК Потребность_Потом,
	|	0 КАК Выдано_ххх2_Потом
	|ПОМЕСТИТЬ ВТ_ПотребностьПоПериодамВремени
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2,
	|	0,
	|	0
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьПоПериодамВремени.Организация КАК Организация,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Ранее) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиРанее,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Сейчас) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиПотом,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее КАК СтоимостьПотребностиРанее,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас КАК СтоимостьПотребностиСейчас,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом КАК СтоимостьПотребностиПотом
	|ПОМЕСТИТЬ ВТ_ПотребностьСПроцентами
	|ИЗ
	|	ВТ_ПотребностьПоПериодамВремени КАК ВТ_ПотребностьПоПериодамВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоНормамСотрудников КАК ВТ_ЦеныПоНормамСотрудников
	|		ПО ВТ_ПотребностьПоПериодамВремени.Организация = ВТ_ЦеныПоНормамСотрудников.Организация
	|			И ВТ_ПотребностьПоПериодамВремени.Сотрудник = ВТ_ЦеныПоНормамСотрудников.Сотрудник
	|			И ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы = ВТ_ЦеныПоНормамСотрудников.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьПоПериодамВремени.Организация,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСПроцентами.Организация КАК Организация,
	|	ВТ_ПотребностьСПроцентами.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиРанее) КАК ПроцентПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиСейчас) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиПотом) КАК ПроцентПотребностиПотом,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиРанее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиСейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиПотом) КАК СтоимостьПотребностиПотом,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ОтветственноеЛицо,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормы
	|ИЗ
	|	ВТ_ПотребностьСПроцентами КАК ВТ_ПотребностьСПроцентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСПроцентами.Организация,
	|	ВТ_ПотребностьСПроцентами.Сотрудник";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоНоменклатуреНормы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Маппинг
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(
	|			,
	|			НоменклатураНормыОрганизации.Владелец = &Организация
	|				И (НЕ &ИспользоватьФильтрПоНоменклатуреНорм
	|					ИЛИ НоменклатураНормыОрганизации В (&СписокНоменклатурыНорм))) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	1 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	2 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	3 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	4 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	5 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	6 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	7 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	8 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(, Организация = &Организация) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|			ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|			ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
	|		ИЗ
	|			РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|					,
	|					Организация = &Организация
	|						И НЕ Организация.ИспользоватьГруппыИЛИ
	|						И (НЕ &ИспользоватьФильтрПоНоменклатуреНорм
	|							ИЛИ НоменклатураНормы В (&СписокНоменклатурыНорм))) КАК ПотребностьВыдачиСИЗОстатки) КАК ВложенныйЗапрос
	|		ПО ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация = ВложенныйЗапрос.Организация
	|			И ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|	КОНЕЦ КАК ПриоритетУсловия,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПолныйМаппинг
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность КАК ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолныйМаппинг.Организация КАК Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник КАК Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы КАК НоменклатураНормы,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.ПриоритетУсловия) КАК ПриоритетУсловия,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныеПриоритеты
	|ИЗ
	|	ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолныйМаппинг.Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МинимальныеПриоритеты.Организация КАК Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник КАК Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ПолныйМаппинг.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингСотрудников
	|ИЗ
	|	ВТ_МинимальныеПриоритеты КАК ВТ_МинимальныеПриоритеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|		ПО ВТ_МинимальныеПриоритеты.Организация = ВТ_ПолныйМаппинг.Организация
	|			И ВТ_МинимальныеПриоритеты.Сотрудник = ВТ_ПолныйМаппинг.Сотрудник
	|			И ВТ_МинимальныеПриоритеты.ПриоритетУсловия = ВТ_ПолныйМаппинг.ПриоритетУсловия
	|			И ВТ_МинимальныеПриоритеты.Приоритет = ВТ_ПолныйМаппинг.Приоритет
	|			И ВТ_МинимальныеПриоритеты.НоменклатураНормы = ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МинимальныеПриоритеты.Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	НоменклатураНормы,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Организация КАК Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаппингСотрудников.Организация КАК Организация,
	|	ВТ_МаппингСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_МаппингСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныПоНормамСотрудников
	|ИЗ
	|	ВТ_МаппингСотрудников КАК ВТ_МаппингСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_МаппингСотрудников.Организация = ВТ_Цены.Организация
	|			И ВТ_МаппингСотрудников.Номенклатура = ВТ_Цены.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Выдано
	|ПОМЕСТИТЬ ВТ_Выдано_ххх2
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			,
	|			Организация = &Организация
	|				И Организация.ЧастичнаяВыдача = 2
	|				И (НЕ &ИспользоватьФильтрПоНоменклатуреНорм
	|					ИЛИ НоменклатураНормы В (&СписокНоменклатурыНорм))) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) КАК МесяцПотребности,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0) КАК Выдано_ххх2
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Организация.ИспользоватьГруппыИЛИ
	|				И (НЕ &ИспользоватьФильтрПоНоменклатуреНорм
	|					ИЛИ НоменклатураНормы В (&СписокНоменклатурыНорм))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдано_ххх2 КАК ВТ_Выдано_ххх2
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_Выдано_ххх2.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_Выдано_ххх2.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_Выдано_ххх2.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_Выдано_ххх2.ДатаВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ),
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НормаВыдачи) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НоменклатураНормы) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Сотрудник) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоСотрудниковПоНоменклатуреНормы
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВТ_Потребность.Сотрудник КАК Сотрудник,
	|		ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы
	|	ИЗ
	|		ВТ_Потребность КАК ВТ_Потребность) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1) КАК ПериодВремени
	|ПОМЕСТИТЬ ВТ_ПериодыВремени
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	СУММА(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоСотрудниковПоНоменклатуреНормы.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх0х КАК ВТ_МаксимальныйПриоритет_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх0х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх0х.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_МаксимальныйПриоритет_хх0х.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх0х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСотрудниковПоНоменклатуреНормы КАК ВТ_КоличествоСотрудниковПоНоменклатуреНормы
	|		ПО ВТ_Потребность.НоменклатураНормы = ВТ_КоличествоСотрудниковПоНоменклатуреНормы.НоменклатураНормы
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет,
	|	ВТ_КоличествоСотрудниковПоНоменклатуреНормы.КоличествоНорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	МАКСИМУМ(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоСотрудниковПоНоменклатуреНормы.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх1х КАК ВТ_МаксимальныйПриоритет_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх1х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх1х.Сотрудник
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх1х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСотрудниковПоНоменклатуреНормы КАК ВТ_КоличествоСотрудниковПоНоменклатуреНормы
	|		ПО ВТ_Потребность.НоменклатураНормы = ВТ_КоличествоСотрудниковПоНоменклатуреНормы.НоменклатураНормы
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет,
	|	ВТ_КоличествоСотрудниковПоНоменклатуреНормы.КоличествоНорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодичностьВыдачиСИЗ.Приоритет КАК Приоритет,
	|	ПериодичностьВыдачиСИЗ.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх0х.Организация КАК Организация,
	|	ВТ_Потребность_хх0х.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_хх0х.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВремени,
	|	ВТ_Потребность_хх0х.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_Потребность_хх0х.Выдано_ххх2 КАК Выдано_ххх2,
	|	ВТ_Потребность_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Потребность_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_Потребность_хх0х КАК ВТ_Потребность_хх0х
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх1х.Организация,
	|	ВТ_Потребность_хх1х.Сотрудник,
	|	ВТ_Потребность_хх1х.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВТ_Потребность_хх1х.КоличествоОстаток,
	|	ВТ_Потребность_хх1х.Выдано_ххх2,
	|	ВТ_Потребность_хх1х.КоличествоНорм,
	|	ВТ_Потребность_хх1х.МаксимальныйПриоритет
	|ИЗ
	|	ВТ_Потребность_хх1х КАК ВТ_Потребность_хх1х
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Организация КАК Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ПериодВремени КАК ПериодВремени,
	|	СУММА(ВТ_СобраннаяПотребность.КоличествоОстаток) КАК Потребность,
	|	СУММА(ВТ_СобраннаяПотребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_СобраннаяПотребность.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПотребностьДляРасчета
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_СобраннаяПотребность.МаксимальныйПриоритет = ВТ_Периодичность.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобраннаяПотребность.Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде,
	|	ВТ_СобраннаяПотребность.ПериодВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация КАК Организация,
	|	ВТ_ПотребностьДляРасчета.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде КАК КоличествоВПериоде,
	|	ВТ_ПотребностьДляРасчета.Потребность КАК Потребность_Ранее,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2 КАК Выдано_ххх2_Ранее,
	|	0 КАК Потребность_Сейчас,
	|	0 КАК Выдано_ххх2_Сейчас,
	|	0 КАК Потребность_Потом,
	|	0 КАК Выдано_ххх2_Потом
	|ПОМЕСТИТЬ ВТ_ПотребностьПоПериодамВремени
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2,
	|	0,
	|	0
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьПоПериодамВремени.Организация КАК Организация,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Ранее) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиРанее,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Сейчас) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиПотом,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее КАК СтоимостьПотребностиРанее,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас КАК СтоимостьПотребностиСейчас,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом КАК СтоимостьПотребностиПотом
	|ПОМЕСТИТЬ ВТ_ПотребностьСПроцентами
	|ИЗ
	|	ВТ_ПотребностьПоПериодамВремени КАК ВТ_ПотребностьПоПериодамВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоНормамСотрудников КАК ВТ_ЦеныПоНормамСотрудников
	|		ПО ВТ_ПотребностьПоПериодамВремени.Организация = ВТ_ЦеныПоНормамСотрудников.Организация
	|			И ВТ_ПотребностьПоПериодамВремени.Сотрудник = ВТ_ЦеныПоНормамСотрудников.Сотрудник
	|			И ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы = ВТ_ЦеныПоНормамСотрудников.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьПоПериодамВремени.Организация,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас,
	|	ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСПроцентами.Организация КАК Организация,
	|	ВТ_ПотребностьСПроцентами.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиРанее) КАК ПроцентПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиСейчас) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиПотом) КАК ПроцентПотребностиПотом,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиРанее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиСейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиПотом) КАК СтоимостьПотребностиПотом,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ОтветственноеЛицо,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
	|ИЗ
	|	ВТ_ПотребностьСПроцентами КАК ВТ_ПотребностьСПроцентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСПроцентами.Организация,
	|	ВТ_ПотребностьСПроцентами.НоменклатураНормы";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоПодразделениям()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Маппинг
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, НоменклатураНормыОрганизации.Владелец = &Организация) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	1 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	2 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	3 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	4 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	5 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	6 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	7 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	8 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			,
	|			Организация = &Организация
	|				И (НЕ &ИспользоватьФильтрПоПодразделениям
	|					ИЛИ Подразделение В (&СписокПодразделений))) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|			ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|			ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
	|		ИЗ
	|			РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|					,
	|					Организация = &Организация
	|						И НЕ Организация.ИспользоватьГруппыИЛИ) КАК ПотребностьВыдачиСИЗОстатки) КАК ВложенныйЗапрос
	|		ПО ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация = ВложенныйЗапрос.Организация
	|			И ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	МАКСИМУМ(МВЗПодразделенийСрезПоследних.МВЗ) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений.СрезПоследних(, Подразделение.Владелец = &Организация) КАК МВЗПодразделенийСрезПоследних
	|ГДЕ
	|	МВЗПодразделенийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	МВЗПодразделенийСрезПоследних.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|	МАКСИМУМ(МВЗДолжностейСрезПоследних.МВЗ) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗДолжностей
	|ИЗ
	|	РегистрСведений.МВЗДолжностей.СрезПоследних(, Организация = &Организация) КАК МВЗДолжностейСрезПоследних
	|ГДЕ
	|	МВЗДолжностейСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	МВЗДолжностейСрезПоследних.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МВЗСотрудников.Организация КАК Организация,
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|ГДЕ
	|	МВЗСотрудников.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|	КОНЕЦ КАК ПриоритетУсловия,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПолныйМаппинг
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность КАК ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолныйМаппинг.Организация КАК Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник КАК Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы КАК НоменклатураНормы,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.ПриоритетУсловия) КАК ПриоритетУсловия,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныеПриоритеты
	|ИЗ
	|	ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолныйМаппинг.Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МинимальныеПриоритеты.Организация КАК Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник КАК Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ПолныйМаппинг.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингСотрудников
	|ИЗ
	|	ВТ_МинимальныеПриоритеты КАК ВТ_МинимальныеПриоритеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|		ПО ВТ_МинимальныеПриоритеты.Организация = ВТ_ПолныйМаппинг.Организация
	|			И ВТ_МинимальныеПриоритеты.Сотрудник = ВТ_ПолныйМаппинг.Сотрудник
	|			И ВТ_МинимальныеПриоритеты.ПриоритетУсловия = ВТ_ПолныйМаппинг.ПриоритетУсловия
	|			И ВТ_МинимальныеПриоритеты.Приоритет = ВТ_ПолныйМаппинг.Приоритет
	|			И ВТ_МинимальныеПриоритеты.НоменклатураНормы = ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МинимальныеПриоритеты.Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	НоменклатураНормы,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Организация КАК Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаппингСотрудников.Организация КАК Организация,
	|	ВТ_МаппингСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_МаппингСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныПоНормамСотрудников
	|ИЗ
	|	ВТ_МаппингСотрудников КАК ВТ_МаппингСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_МаппингСотрудников.Организация = ВТ_Цены.Организация
	|			И ВТ_МаппингСотрудников.Номенклатура = ВТ_Цены.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|	КОНЕЦ КАК МВЗ,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник.ОтветственноеЛицо КАК СотрудникОтветственноеЛицо
	|ПОМЕСТИТЬ ВТ_ПоказателиАналитики
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВТ_ОсновноеМестоРаботы.Организация = ВТ_МВЗСотрудников.Организация
	|			И ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_МВЗДолжностей.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Выдано
	|ПОМЕСТИТЬ ВТ_Выдано_ххх2
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			,
	|			Организация = &Организация
	|				И Организация.ЧастичнаяВыдача = 2) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|	ВТ_ПоказателиАналитики.Подразделение КАК Подразделение,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) КАК МесяцПотребности,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0) КАК Выдано_ххх2
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Организация.ИспользоватьГруппыИЛИ) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдано_ххх2 КАК ВТ_Выдано_ххх2
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_Выдано_ххх2.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_Выдано_ххх2.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_Выдано_ххх2.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_Выдано_ххх2.ДатаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиАналитики КАК ВТ_ПоказателиАналитики
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_ПоказателиАналитики.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ПоказателиАналитики.Сотрудник
	|ГДЕ
	|	НЕ ВТ_ПоказателиАналитики.Подразделение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ),
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0),
	|	ВТ_ПоказателиАналитики.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Подразделение КАК Подразделение,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НормаВыдачи) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Подразделение КАК Подразделение,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НоменклатураНормы) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Нормы_хх0х.Организация КАК Организация,
	|	ВТ_Нормы_хх0х.Подразделение КАК Подразделение,
	|	СУММА(ВТ_Нормы_хх0х.КоличествоНорм) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоНормПоПодразделениям_хх0х
	|ИЗ
	|	ВТ_Нормы_хх0х КАК ВТ_Нормы_хх0х
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Нормы_хх0х.Организация,
	|	ВТ_Нормы_хх0х.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Нормы_хх1х.Организация КАК Организация,
	|	ВТ_Нормы_хх1х.Подразделение КАК Подразделение,
	|	СУММА(ВТ_Нормы_хх1х.КоличествоНорм) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоНормПоПодразделению_хх1х
	|ИЗ
	|	ВТ_Нормы_хх1х КАК ВТ_Нормы_хх1х
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Нормы_хх1х.Организация,
	|	ВТ_Нормы_хх1х.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Подразделение КАК Подразделение,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	СУММА(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоНормПоПодразделениям_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх0х КАК ВТ_МаксимальныйПриоритет_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх0х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх0х.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_МаксимальныйПриоритет_хх0х.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх0х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоНормПоПодразделениям_хх0х КАК ВТ_КоличествоНормПоПодразделениям_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_КоличествоНормПоПодразделениям_хх0х.Организация
	|			И ВТ_Потребность.Подразделение = ВТ_КоличествоНормПоПодразделениям_хх0х.Подразделение
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет,
	|	ВТ_КоличествоНормПоПодразделениям_хх0х.КоличествоНорм,
	|	ВТ_Потребность.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Подразделение КАК Подразделение,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	МАКСИМУМ(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоНормПоПодразделению_хх1х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх1х КАК ВТ_МаксимальныйПриоритет_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх1х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх1х.Сотрудник
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх1х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоНормПоПодразделению_хх1х КАК ВТ_КоличествоНормПоПодразделению_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_КоличествоНормПоПодразделению_хх1х.Организация
	|			И ВТ_Потребность.Подразделение = ВТ_КоличествоНормПоПодразделению_хх1х.Подразделение
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет,
	|	ВТ_КоличествоНормПоПодразделению_хх1х.КоличествоНорм,
	|	ВТ_Потребность.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодичностьВыдачиСИЗ.Приоритет КАК Приоритет,
	|	ПериодичностьВыдачиСИЗ.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх0х.Организация КАК Организация,
	|	ВТ_Потребность_хх0х.Подразделение КАК Подразделение,
	|	ВТ_Потребность_хх0х.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_хх0х.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВремени,
	|	ВТ_Потребность_хх0х.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_Потребность_хх0х.Выдано_ххх2 КАК Выдано_ххх2,
	|	ВТ_Потребность_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Потребность_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_Потребность_хх0х КАК ВТ_Потребность_хх0х
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх1х.Организация,
	|	ВТ_Потребность_хх1х.Подразделение,
	|	ВТ_Потребность_хх1х.Сотрудник,
	|	ВТ_Потребность_хх1х.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВТ_Потребность_хх1х.КоличествоОстаток,
	|	ВТ_Потребность_хх1х.Выдано_ххх2,
	|	ВТ_Потребность_хх1х.КоличествоНорм,
	|	ВТ_Потребность_хх1х.МаксимальныйПриоритет
	|ИЗ
	|	ВТ_Потребность_хх1х КАК ВТ_Потребность_хх1х
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Организация КАК Организация,
	|	ВТ_СобраннаяПотребность.Подразделение КАК Подразделение,
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ПериодВремени КАК ПериодВремени,
	|	СУММА(ВТ_СобраннаяПотребность.КоличествоОстаток) КАК Потребность,
	|	СУММА(ВТ_СобраннаяПотребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_СобраннаяПотребность.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПотребностьДляРасчета
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_СобраннаяПотребность.МаксимальныйПриоритет = ВТ_Периодичность.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобраннаяПотребность.Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде,
	|	ВТ_СобраннаяПотребность.ПериодВремени,
	|	ВТ_СобраннаяПотребность.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация КАК Организация,
	|	ВТ_ПотребностьДляРасчета.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьДляРасчета.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде КАК КоличествоВПериоде,
	|	ВТ_ПотребностьДляРасчета.Потребность КАК Потребность_Ранее,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2 КАК Выдано_ххх2_Ранее,
	|	0 КАК Потребность_Сейчас,
	|	0 КАК Выдано_ххх2_Сейчас,
	|	0 КАК Потребность_Потом,
	|	0 КАК Выдано_ххх2_Потом
	|ПОМЕСТИТЬ ВТ_ПотребностьПоПериодамВремени
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.Подразделение,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2,
	|	0,
	|	0
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.Подразделение,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьПоПериодамВремени.Организация КАК Организация,
	|	ВТ_ПотребностьПоПериодамВремени.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Ранее) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиРанее,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Сейчас) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиПотом,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом) КАК СтоимостьПотребностиПотом
	|ПОМЕСТИТЬ ВТ_ПотребностьСПроцентами
	|ИЗ
	|	ВТ_ПотребностьПоПериодамВремени КАК ВТ_ПотребностьПоПериодамВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоНормамСотрудников КАК ВТ_ЦеныПоНормамСотрудников
	|		ПО ВТ_ПотребностьПоПериодамВремени.Организация = ВТ_ЦеныПоНормамСотрудников.Организация
	|			И ВТ_ПотребностьПоПериодамВремени.Сотрудник = ВТ_ЦеныПоНормамСотрудников.Сотрудник
	|			И ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы = ВТ_ЦеныПоНормамСотрудников.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьПоПериодамВремени.Организация,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы,
	|	ВТ_ПотребностьПоПериодамВремени.Подразделение,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСПроцентами.Организация КАК Организация,
	|	ВТ_ПотребностьСПроцентами.Подразделение КАК Подразделение,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиРанее) КАК ПроцентПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиСейчас) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиПотом) КАК ПроцентПотребностиПотом,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиРанее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиСейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиПотом) КАК СтоимостьПотребностиПотом,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ОтветственноеЛицо,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормы,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
	|ИЗ
	|	ВТ_ПотребностьСПроцентами КАК ВТ_ПотребностьСПроцентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСПроцентами.Организация,
	|	ВТ_ПотребностьСПроцентами.Подразделение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоМВЗ()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Маппинг
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, НоменклатураНормыОрганизации.Владелец = &Организация) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	1 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	2 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	3 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	4 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	5 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	6 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	7 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	8 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(, Организация = &Организация) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|			ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|			ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
	|		ИЗ
	|			РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|					,
	|					Организация = &Организация
	|						И НЕ Организация.ИспользоватьГруппыИЛИ) КАК ПотребностьВыдачиСИЗОстатки) КАК ВложенныйЗапрос
	|		ПО ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация = ВложенныйЗапрос.Организация
	|			И ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	МАКСИМУМ(МВЗПодразделенийСрезПоследних.МВЗ) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений.СрезПоследних(, Подразделение.Владелец = &Организация) КАК МВЗПодразделенийСрезПоследних
	|ГДЕ
	|	МВЗПодразделенийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	МВЗПодразделенийСрезПоследних.Подразделение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение,
	|	МВЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|	МАКСИМУМ(МВЗДолжностейСрезПоследних.МВЗ) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗДолжностей
	|ИЗ
	|	РегистрСведений.МВЗДолжностей.СрезПоследних(, Организация = &Организация) КАК МВЗДолжностейСрезПоследних
	|ГДЕ
	|	МВЗДолжностейСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	МВЗДолжностейСрезПоследних.Должность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Должность,
	|	МВЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МВЗСотрудников.Организация КАК Организация,
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|ГДЕ
	|	МВЗСотрудников.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	МВЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|	КОНЕЦ КАК ПриоритетУсловия,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПолныйМаппинг
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность КАК ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолныйМаппинг.Организация КАК Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник КАК Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы КАК НоменклатураНормы,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.ПриоритетУсловия) КАК ПриоритетУсловия,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныеПриоритеты
	|ИЗ
	|	ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолныйМаппинг.Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МинимальныеПриоритеты.Организация КАК Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник КАК Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ПолныйМаппинг.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингСотрудников
	|ИЗ
	|	ВТ_МинимальныеПриоритеты КАК ВТ_МинимальныеПриоритеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|		ПО ВТ_МинимальныеПриоритеты.Организация = ВТ_ПолныйМаппинг.Организация
	|			И ВТ_МинимальныеПриоритеты.Сотрудник = ВТ_ПолныйМаппинг.Сотрудник
	|			И ВТ_МинимальныеПриоритеты.ПриоритетУсловия = ВТ_ПолныйМаппинг.ПриоритетУсловия
	|			И ВТ_МинимальныеПриоритеты.Приоритет = ВТ_ПолныйМаппинг.Приоритет
	|			И ВТ_МинимальныеПриоритеты.НоменклатураНормы = ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МинимальныеПриоритеты.Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Организация КАК Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаппингСотрудников.Организация КАК Организация,
	|	ВТ_МаппингСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_МаппингСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныПоНормамСотрудников
	|ИЗ
	|	ВТ_МаппингСотрудников КАК ВТ_МаппингСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_МаппингСотрудников.Организация = ВТ_Цены.Организация
	|			И ВТ_МаппингСотрудников.Номенклатура = ВТ_Цены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|	КОНЕЦ КАК МВЗ,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник.ОтветственноеЛицо КАК СотрудникОтветственноеЛицо
	|ПОМЕСТИТЬ ВТ_ПоказателиАналитики
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВТ_ОсновноеМестоРаботы.Организация = ВТ_МВЗСотрудников.Организация
	|			И ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_МВЗДолжностей.Должность
	|ГДЕ
	|	(НЕ &ИспользоватьФильтрПоМВЗ
	|			ИЛИ ВЫБОР
	|				КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|							ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|						КОНЕЦ
	|				ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|			КОНЕЦ В (&СписокМВЗ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	МВЗ,
	|	СотрудникОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Выдано
	|ПОМЕСТИТЬ ВТ_Выдано_ххх2
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			,
	|			Организация = &Организация
	|				И Организация.ЧастичнаяВыдача = 2) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|	ВТ_ПоказателиАналитики.МВЗ КАК МВЗ,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) КАК МесяцПотребности,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0) КАК Выдано_ххх2
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Организация.ИспользоватьГруппыИЛИ) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдано_ххх2 КАК ВТ_Выдано_ххх2
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_Выдано_ххх2.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_Выдано_ххх2.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_Выдано_ххх2.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_Выдано_ххх2.ДатаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиАналитики КАК ВТ_ПоказателиАналитики
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_ПоказателиАналитики.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ПоказателиАналитики.Сотрудник
	|ГДЕ
	|	НЕ ВТ_ПоказателиАналитики.МВЗ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ),
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0),
	|	ВТ_ПоказателиАналитики.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.МВЗ КАК МВЗ,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НормаВыдачи) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.МВЗ КАК МВЗ,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НоменклатураНормы) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Нормы_хх0х.Организация КАК Организация,
	|	ВТ_Нормы_хх0х.МВЗ КАК МВЗ,
	|	СУММА(ВТ_Нормы_хх0х.КоличествоНорм) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоНормПоМВЗ_хх0х
	|ИЗ
	|	ВТ_Нормы_хх0х КАК ВТ_Нормы_хх0х
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Нормы_хх0х.Организация,
	|	ВТ_Нормы_хх0х.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Нормы_хх1х.Организация КАК Организация,
	|	ВТ_Нормы_хх1х.МВЗ КАК МВЗ,
	|	СУММА(ВТ_Нормы_хх1х.КоличествоНорм) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоНормПоМВЗ_хх1х
	|ИЗ
	|	ВТ_Нормы_хх1х КАК ВТ_Нормы_хх1х
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Нормы_хх1х.Организация,
	|	ВТ_Нормы_хх1х.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НормаВыдачи,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.МВЗ КАК МВЗ,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	СУММА(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоНормПоМВЗ_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх0х КАК ВТ_МаксимальныйПриоритет_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх0х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх0х.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_МаксимальныйПриоритет_хх0х.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх0х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоНормПоМВЗ_хх0х КАК ВТ_КоличествоНормПоМВЗ_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_КоличествоНормПоМВЗ_хх0х.Организация
	|			И ВТ_Потребность.МВЗ = ВТ_КоличествоНормПоМВЗ_хх0х.МВЗ
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет,
	|	ВТ_КоличествоНормПоМВЗ_хх0х.КоличествоНорм,
	|	ВТ_Потребность.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.МВЗ КАК МВЗ,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	МАКСИМУМ(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоНормПоМВЗ_хх1х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх1х КАК ВТ_МаксимальныйПриоритет_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх1х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх1х.Сотрудник
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх1х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоНормПоМВЗ_хх1х КАК ВТ_КоличествоНормПоМВЗ_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_КоличествоНормПоМВЗ_хх1х.Организация
	|			И ВТ_Потребность.МВЗ = ВТ_КоличествоНормПоМВЗ_хх1х.МВЗ
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет,
	|	ВТ_КоличествоНормПоМВЗ_хх1х.КоличествоНорм,
	|	ВТ_Потребность.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодичностьВыдачиСИЗ.Приоритет КАК Приоритет,
	|	ПериодичностьВыдачиСИЗ.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх0х.Организация КАК Организация,
	|	ВТ_Потребность_хх0х.МВЗ КАК МВЗ,
	|	ВТ_Потребность_хх0х.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_хх0х.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВремени,
	|	ВТ_Потребность_хх0х.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_Потребность_хх0х.Выдано_ххх2 КАК Выдано_ххх2,
	|	ВТ_Потребность_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Потребность_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_Потребность_хх0х КАК ВТ_Потребность_хх0х
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх1х.Организация,
	|	ВТ_Потребность_хх1х.МВЗ,
	|	ВТ_Потребность_хх1х.Сотрудник,
	|	ВТ_Потребность_хх1х.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВТ_Потребность_хх1х.КоличествоОстаток,
	|	ВТ_Потребность_хх1х.Выдано_ххх2,
	|	ВТ_Потребность_хх1х.КоличествоНорм,
	|	ВТ_Потребность_хх1х.МаксимальныйПриоритет
	|ИЗ
	|	ВТ_Потребность_хх1х КАК ВТ_Потребность_хх1х
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Организация КАК Организация,
	|	ВТ_СобраннаяПотребность.МВЗ КАК МВЗ,
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ПериодВремени КАК ПериодВремени,
	|	СУММА(ВТ_СобраннаяПотребность.КоличествоОстаток) КАК Потребность,
	|	СУММА(ВТ_СобраннаяПотребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_СобраннаяПотребность.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПотребностьДляРасчета
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_СобраннаяПотребность.МаксимальныйПриоритет = ВТ_Периодичность.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобраннаяПотребность.Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде,
	|	ВТ_СобраннаяПотребность.ПериодВремени,
	|	ВТ_СобраннаяПотребность.МВЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация КАК Организация,
	|	ВТ_ПотребностьДляРасчета.МВЗ КАК МВЗ,
	|	ВТ_ПотребностьДляРасчета.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде КАК КоличествоВПериоде,
	|	ВТ_ПотребностьДляРасчета.Потребность КАК Потребность_Ранее,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2 КАК Выдано_ххх2_Ранее,
	|	0 КАК Потребность_Сейчас,
	|	0 КАК Выдано_ххх2_Сейчас,
	|	0 КАК Потребность_Потом,
	|	0 КАК Выдано_ххх2_Потом
	|ПОМЕСТИТЬ ВТ_ПотребностьПоПериодамВремени
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.МВЗ,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2,
	|	0,
	|	0
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.МВЗ,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьПоПериодамВремени.Организация КАК Организация,
	|	ВТ_ПотребностьПоПериодамВремени.МВЗ КАК МВЗ,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Ранее) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиРанее,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Сейчас) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиПотом,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом) КАК СтоимостьПотребностиПотом
	|ПОМЕСТИТЬ ВТ_ПотребностьСПроцентами
	|ИЗ
	|	ВТ_ПотребностьПоПериодамВремени КАК ВТ_ПотребностьПоПериодамВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоНормамСотрудников КАК ВТ_ЦеныПоНормамСотрудников
	|		ПО ВТ_ПотребностьПоПериодамВремени.Организация = ВТ_ЦеныПоНормамСотрудников.Организация
	|			И ВТ_ПотребностьПоПериодамВремени.Сотрудник = ВТ_ЦеныПоНормамСотрудников.Сотрудник
	|			И ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы = ВТ_ЦеныПоНормамСотрудников.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьПоПериодамВремени.Организация,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы,
	|	ВТ_ПотребностьПоПериодамВремени.МВЗ,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МВЗ,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСПроцентами.Организация КАК Организация,
	|	ВТ_ПотребностьСПроцентами.МВЗ КАК МВЗ,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиРанее) КАК ПроцентПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиСейчас) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиПотом) КАК ПроцентПотребностиПотом,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиРанее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиСейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиПотом) КАК СтоимостьПотребностиПотом,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ОтветственноеЛицо,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормы,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
	|ИЗ
	|	ВТ_ПотребностьСПроцентами КАК ВТ_ПотребностьСПроцентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСПроцентами.Организация,
	|	ВТ_ПотребностьСПроцентами.МВЗ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоОтветственнымЛицам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Подразделение КАК Подразделение,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Должность КАК Должность,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Маппинг
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи.СрезПоследних(, НоменклатураНормыОрганизации.Владелец = &Организация) КАК СоответствияНоменклатурыВыдачиСрезПоследних
	|ГДЕ
	|	СоответствияНоменклатурыВыдачиСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	1 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	2 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	3 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Сотрудник КАК Сотрудник,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	4 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	5 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	6 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	7 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура,
	|	ВТ_Маппинг.Приоритет КАК Приоритет,
	|	8 КАК ПриоритетУсловия
	|ПОМЕСТИТЬ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНормыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация КАК Организация,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность,
	|	ВложенныйЗапрос.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			,
	|			Организация = &Организация
	|				И (НЕ &ИспользоватьФильтрПоОтветственнымЛицам
	|					ИЛИ Сотрудник.ОтветственноеЛицо В (&СписокОтветственныхЛиц))) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|			ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|			ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы
	|		ИЗ
	|			РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|					,
	|					Организация = &Организация
	|						И НЕ Организация.ИспользоватьГруппыИЛИ
	|						И (НЕ &ИспользоватьФильтрПоОтветственнымЛицам
	|							ИЛИ Сотрудник.ОтветственноеЛицо В (&СписокОтветственныхЛиц))) КАК ПотребностьВыдачиСИЗОстатки) КАК ВложенныйЗапрос
	|		ПО ОсновноеМестоРаботыСотрудникаСрезПоследних.Организация = ВложенныйЗапрос.Организация
	|			И ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Подразделение,
	|	Должность,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновноеМестоРаботы.Организация КАК Организация,
	|	ВТ_ОсновноеМестоРаботы.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Номенклатура
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Номенклатура
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.ПриоритетУсловия
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.ПриоритетУсловия
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.ПриоритетУсловия
	|	КОНЕЦ КАК ПриоритетУсловия,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Приоритет
	|		КОГДА НЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации ЕСТЬ NULL
	|			ТОГДА ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Приоритет
	|		ИНАЧЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.Приоритет
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПолныйМаппинг
	|ИЗ
	|	ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_Должность КАК ВТ_Маппинг_Сотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Сотрудник = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.Сотрудник
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_Сотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность
	|		ПО ВТ_ОсновноеМестоРаботы.Должность = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.Должность
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_Должность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.Подразделение = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.Подразделение
	|			И ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_Подразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность КАК ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность
	|		ПО ВТ_ОсновноеМестоРаботы.НоменклатураНормы = ВТ_Маппинг_ПустойСотрудник_ПустоеПодразделение_ПустаяДолжность.НоменклатураНормыОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолныйМаппинг.Организация КАК Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник КАК Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы КАК НоменклатураНормы,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.ПриоритетУсловия) КАК ПриоритетУсловия,
	|	МИНИМУМ(ВТ_ПолныйМаппинг.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныеПриоритеты
	|ИЗ
	|	ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолныйМаппинг.Организация,
	|	ВТ_ПолныйМаппинг.Сотрудник,
	|	ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МинимальныеПриоритеты.Организация КАК Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник КАК Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_ПолныйМаппинг.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингСотрудников
	|ИЗ
	|	ВТ_МинимальныеПриоритеты КАК ВТ_МинимальныеПриоритеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолныйМаппинг КАК ВТ_ПолныйМаппинг
	|		ПО ВТ_МинимальныеПриоритеты.Организация = ВТ_ПолныйМаппинг.Организация
	|			И ВТ_МинимальныеПриоритеты.Сотрудник = ВТ_ПолныйМаппинг.Сотрудник
	|			И ВТ_МинимальныеПриоритеты.ПриоритетУсловия = ВТ_ПолныйМаппинг.ПриоритетУсловия
	|			И ВТ_МинимальныеПриоритеты.Приоритет = ВТ_ПолныйМаппинг.Приоритет
	|			И ВТ_МинимальныеПриоритеты.НоменклатураНормы = ВТ_ПолныйМаппинг.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МинимальныеПриоритеты.Организация,
	|	ВТ_МинимальныеПриоритеты.Сотрудник,
	|	ВТ_МинимальныеПриоритеты.НоменклатураНормы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Организация КАК Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Организация,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаппингСотрудников.Организация КАК Организация,
	|	ВТ_МаппингСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_МаппингСотрудников.НоменклатураНормы КАК НоменклатураНормы,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныПоНормамСотрудников
	|ИЗ
	|	ВТ_МаппингСотрудников КАК ВТ_МаппингСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_МаппингСотрудников.Организация = ВТ_Цены.Организация
	|			И ВТ_МаппингСотрудников.Номенклатура = ВТ_Цены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК Выдано
	|ПОМЕСТИТЬ ВТ_Выдано_ххх2
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|			,
	|			Организация = &Организация
	|				И Организация.ЧастичнаяВыдача = 2
	|				И (НЕ &ИспользоватьФильтрПоОтветственнымЛицам
	|					ИЛИ Сотрудник.ОтветственноеЛицо В (&СписокОтветственныхЛиц))) КАК ВыданныеСредстваЗащитыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыданныеСредстваЗащитыОстатки.Организация,
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВыдачиСИЗОстатки.Организация КАК Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ) КАК МесяцПотребности,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0) КАК Выдано_ххх2
	|ПОМЕСТИТЬ ВТ_Потребность
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			,
	|			Организация = &Организация
	|				И НЕ Организация.ИспользоватьГруппыИЛИ
	|				И (НЕ &ИспользоватьФильтрПоОтветственнымЛицам
	|					ИЛИ Сотрудник.ОтветственноеЛицо В (&СписокОтветственныхЛиц))) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выдано_ххх2 КАК ВТ_Выдано_ххх2
	|		ПО ПотребностьВыдачиСИЗОстатки.Организация = ВТ_Выдано_ххх2.Организация
	|			И ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_Выдано_ххх2.Сотрудник
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = ВТ_Выдано_ххх2.НоменклатураНормы
	|			И ПотребностьВыдачиСИЗОстатки.ДатаПотребности = ВТ_Выдано_ххх2.ДатаВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Организация,
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ПотребностьВыдачиСИЗОстатки.НормаВыдачи,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	НАЧАЛОПЕРИОДА(ПотребностьВыдачиСИЗОстатки.ДатаПотребности, МЕСЯЦ),
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи,
	|	ЕСТЬNULL(ВТ_Выдано_ххх2.Выдано, 0),
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник.ОтветственноеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтветственноеЛицо,
	|	Сотрудник,
	|	НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НормаВыдачи) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.ОтветственноеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтветственноеЛицо,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Потребность.НоменклатураНормы) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_Нормы_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.ОтветственноеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтветственноеЛицо,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Нормы_хх0х.Организация КАК Организация,
	|	ВТ_Нормы_хх0х.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	СУММА(ВТ_Нормы_хх0х.КоличествоНорм) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоНормПоОтветственномуЛицу_хх0х
	|ИЗ
	|	ВТ_Нормы_хх0х КАК ВТ_Нормы_хх0х
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Нормы_хх0х.Организация,
	|	ВТ_Нормы_хх0х.ОтветственноеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Нормы_хх1х.Организация КАК Организация,
	|	ВТ_Нормы_хх1х.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	СУММА(ВТ_Нормы_хх1х.КоличествоНорм) КАК КоличествоНорм
	|ПОМЕСТИТЬ ВТ_КоличествоНормПоОтветственномуЛицу_хх1х
	|ИЗ
	|	ВТ_Нормы_хх1х КАК ВТ_Нормы_хх1х
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Нормы_хх1х.Организация,
	|	ВТ_Нормы_хх1х.ОтветственноеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НормаВыдачи,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	МАКСИМУМ(ВТ_Потребность.ПериодичностьВыдачи.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	СУММА(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоНормПоОтветственномуЛицу_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх0х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх0х КАК ВТ_МаксимальныйПриоритет_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх0х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх0х.Сотрудник
	|			И ВТ_Потребность.НормаВыдачи = ВТ_МаксимальныйПриоритет_хх0х.НормаВыдачи
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх0х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоНормПоОтветственномуЛицу_хх0х КАК ВТ_КоличествоНормПоОтветственномуЛицу_хх0х
	|		ПО ВТ_Потребность.Организация = ВТ_КоличествоНормПоОтветственномуЛицу_хх0х.Организация
	|			И ВТ_Потребность.ОтветственноеЛицо = ВТ_КоличествоНормПоОтветственномуЛицу_хх0х.ОтветственноеЛицо
	|ГДЕ
	|	НЕ ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх0х.МаксимальныйПриоритет,
	|	ВТ_КоличествоНормПоОтветственномуЛицу_хх0х.КоличествоНорм,
	|	ВТ_Потребность.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность.Организация КАК Организация,
	|	ВТ_Потребность.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_Потребность.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности КАК МесяцПотребности,
	|	МАКСИМУМ(ВТ_Потребность.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТ_Потребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_КоличествоНормПоОтветственномуЛицу_хх1х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_Потребность_хх1х
	|ИЗ
	|	ВТ_Потребность КАК ВТ_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПриоритет_хх1х КАК ВТ_МаксимальныйПриоритет_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_МаксимальныйПриоритет_хх1х.Организация
	|			И ВТ_Потребность.Сотрудник = ВТ_МаксимальныйПриоритет_хх1х.Сотрудник
	|			И ВТ_Потребность.НоменклатураНормы = ВТ_МаксимальныйПриоритет_хх1х.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоНормПоОтветственномуЛицу_хх1х КАК ВТ_КоличествоНормПоОтветственномуЛицу_хх1х
	|		ПО ВТ_Потребность.Организация = ВТ_КоличествоНормПоОтветственномуЛицу_хх1х.Организация
	|			И ВТ_Потребность.ОтветственноеЛицо = ВТ_КоличествоНормПоОтветственномуЛицу_хх1х.ОтветственноеЛицо
	|ГДЕ
	|	ВТ_Потребность.Организация.СверткаПотребностиПоНоменклатуреНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потребность.Организация,
	|	ВТ_Потребность.Сотрудник,
	|	ВТ_Потребность.НоменклатураНормы,
	|	ВТ_Потребность.МесяцПотребности,
	|	ВТ_МаксимальныйПриоритет_хх1х.МаксимальныйПриоритет,
	|	ВТ_КоличествоНормПоОтветственномуЛицу_хх1х.КоличествоНорм,
	|	ВТ_Потребность.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодичностьВыдачиСИЗ.Приоритет КАК Приоритет,
	|	ПериодичностьВыдачиСИЗ.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_Периодичность
	|ИЗ
	|	Справочник.ПериодичностьВыдачиСИЗ КАК ПериодичностьВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх0х.Организация КАК Организация,
	|	ВТ_Потребность_хх0х.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_Потребность_хх0х.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_хх0х.НоменклатураНормы КАК НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх0х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВремени,
	|	ВТ_Потребность_хх0х.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_Потребность_хх0х.Выдано_ххх2 КАК Выдано_ххх2,
	|	ВТ_Потребность_хх0х.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Потребность_хх0х.МаксимальныйПриоритет КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_СобраннаяПотребность
	|ИЗ
	|	ВТ_Потребность_хх0х КАК ВТ_Потребность_хх0х
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Потребность_хх1х.Организация,
	|	ВТ_Потребность_хх1х.ОтветственноеЛицо,
	|	ВТ_Потребность_хх1х.Сотрудник,
	|	ВТ_Потребность_хх1х.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|		КОГДА НАЧАЛОПЕРИОДА(ВТ_Потребность_хх1х.МесяцПотребности, МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВТ_Потребность_хх1х.КоличествоОстаток,
	|	ВТ_Потребность_хх1х.Выдано_ххх2,
	|	ВТ_Потребность_хх1х.КоличествоНорм,
	|	ВТ_Потребность_хх1х.МаксимальныйПриоритет
	|ИЗ
	|	ВТ_Потребность_хх1х КАК ВТ_Потребность_хх1х
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобраннаяПотребность.Организация КАК Организация,
	|	ВТ_СобраннаяПотребность.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_СобраннаяПотребность.Сотрудник КАК Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.ПериодВремени КАК ПериодВремени,
	|	СУММА(ВТ_СобраннаяПотребность.КоличествоОстаток) КАК Потребность,
	|	СУММА(ВТ_СобраннаяПотребность.Выдано_ххх2) КАК Выдано_ххх2,
	|	ВТ_СобраннаяПотребность.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде КАК КоличествоВПериоде
	|ПОМЕСТИТЬ ВТ_ПотребностьДляРасчета
	|ИЗ
	|	ВТ_СобраннаяПотребность КАК ВТ_СобраннаяПотребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Периодичность КАК ВТ_Периодичность
	|		ПО ВТ_СобраннаяПотребность.МаксимальныйПриоритет = ВТ_Периодичность.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобраннаяПотребность.Организация,
	|	ВТ_СобраннаяПотребность.Сотрудник,
	|	ВТ_СобраннаяПотребность.НоменклатураНормы,
	|	ВТ_СобраннаяПотребность.КоличествоНорм,
	|	ВТ_Периодичность.КоличествоВПериоде,
	|	ВТ_СобраннаяПотребность.ПериодВремени,
	|	ВТ_СобраннаяПотребность.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация КАК Организация,
	|	ВТ_ПотребностьДляРасчета.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_ПотребностьДляРасчета.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм КАК КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде КАК КоличествоВПериоде,
	|	ВТ_ПотребностьДляРасчета.Потребность КАК Потребность_Ранее,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2 КАК Выдано_ххх2_Ранее,
	|	0 КАК Потребность_Сейчас,
	|	0 КАК Выдано_ххх2_Сейчас,
	|	0 КАК Потребность_Потом,
	|	0 КАК Выдано_ххх2_Потом
	|ПОМЕСТИТЬ ВТ_ПотребностьПоПериодамВремени
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.ОтветственноеЛицо,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2,
	|	0,
	|	0
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПотребностьДляРасчета.Организация,
	|	ВТ_ПотребностьДляРасчета.ОтветственноеЛицо,
	|	ВТ_ПотребностьДляРасчета.Сотрудник,
	|	ВТ_ПотребностьДляРасчета.НоменклатураНормы,
	|	ВТ_ПотребностьДляРасчета.КоличествоНорм,
	|	ВТ_ПотребностьДляРасчета.КоличествоВПериоде,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ПотребностьДляРасчета.Потребность,
	|	ВТ_ПотребностьДляРасчета.Выдано_ххх2
	|ИЗ
	|	ВТ_ПотребностьДляРасчета КАК ВТ_ПотребностьДляРасчета
	|ГДЕ
	|	ВТ_ПотребностьДляРасчета.ПериодВремени = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьПоПериодамВремени.Организация КАК Организация,
	|	ВТ_ПотребностьПоПериодамВремени.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Ранее) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиРанее,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * (ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас - ВТ_ПотребностьПоПериодамВремени.Выдано_ххх2_Сейчас) / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			КОГДА ВТ_ПотребностьПоПериодамВремени.Организация.ЧастичнаяВыдача = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_ПотребностьПоПериодамВремени.Потребность_Потом = 0
	|							ТОГДА 0
	|						ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм
	|					КОНЕЦ
	|			ИНАЧЕ 100 / ВТ_ПотребностьПоПериодамВремени.КоличествоНорм * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом / ВТ_ПотребностьПоПериодамВремени.КоличествоВПериоде
	|		КОНЕЦ) КАК ПроцентПотребностиПотом,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Ранее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Сейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ЕСТЬNULL(ВТ_ЦеныПоНормамСотрудников.Цена, 0) * ВТ_ПотребностьПоПериодамВремени.Потребность_Потом) КАК СтоимостьПотребностиПотом
	|ПОМЕСТИТЬ ВТ_ПотребностьСПроцентами
	|ИЗ
	|	ВТ_ПотребностьПоПериодамВремени КАК ВТ_ПотребностьПоПериодамВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоНормамСотрудников КАК ВТ_ЦеныПоНормамСотрудников
	|		ПО ВТ_ПотребностьПоПериодамВремени.Организация = ВТ_ЦеныПоНормамСотрудников.Организация
	|			И ВТ_ПотребностьПоПериодамВремени.Сотрудник = ВТ_ЦеныПоНормамСотрудников.Сотрудник
	|			И ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы = ВТ_ЦеныПоНормамСотрудников.НоменклатураНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьПоПериодамВремени.Организация,
	|	ВТ_ПотребностьПоПериодамВремени.НоменклатураНормы,
	|	ВТ_ПотребностьПоПериодамВремени.ОтветственноеЛицо,
	|	ВТ_ПотребностьПоПериодамВремени.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСПроцентами.Организация КАК Организация,
	|	ВТ_ПотребностьСПроцентами.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиРанее) КАК ПроцентПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиСейчас) КАК ПроцентПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.ПроцентПотребностиПотом) КАК ПроцентПотребностиПотом,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиРанее) КАК СтоимостьПотребностиРанее,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиСейчас) КАК СтоимостьПотребностиСейчас,
	|	СУММА(ВТ_ПотребностьСПроцентами.СтоимостьПотребностиПотом) КАК СтоимостьПотребностиПотом,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.НоменклатураНормОрганизации.ПустаяСсылка)) КАК НоменклатураНормы,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
	|ИЗ
	|	ВТ_ПотребностьСПроцентами КАК ВТ_ПотребностьСПроцентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСПроцентами.Организация,
	|	ВТ_ПотребностьСПроцентами.ОтветственноеЛицо";
	
	Возврат ТекстЗапроса;
	
КонецФункции